{
  "industry": "technology",
  "collected_at": "2026-02-08T02:23:42.790401+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "The kids 'picked last in gym class' gear up for Super Bowl",
      "url": "https://techcrunch.com/2026/02/07/the-kids-picked-last-in-gym-class-gear-up-for-super-bowl/",
      "published": "2026-02-08T01:26:49+00:00",
      "summary": "YouTube CEO Neal Mohan is expected to be there. Apple's Tim Cook, too.",
      "content_text": "The Super Bowl is happening in Silicon Valley this Sunday, and the Patriots-Seahawks game at Levi’s Stadium is going to be packed with tech money. YouTube CEO Neal Mohan is expected to be there. Apple’s Tim Cook, too. (He has become a Super Bowl fixture since Apple Music began sponsoring the halftime show several years ago.) Longtime VC Venky Ganesan from Menlo Ventures gave the New York Times a quote about the whole thing, saying the Super Bowl in the Bay Area is “tech billionaires who got picked last in gym class paying $50,000 to pretend they’re friends with the guys who got picked first.” Added Ganesan, “And for the record, I, too, was picked last in gym class.” Ganesan could likely afford a $50,000 ticket if he needed one. Menlo went all-in on Anthropic, setting up a $100 million fund with the AI company in summer 2024 to invest in other AI startups. The firm has also joined numerous funding rounds for Anthropic itself, both through its flagship fund and various special purpose vehicles. (Anthropic is reportedly expected to close a $20 billion round of funding next week at a post-money valuation of $350 billion.) Tickets are expensive across the board, averaging almost $7,000 according to the Times (with some last-minute seats still available on StubHub for closer to $3,600, according to a quick glance at the ticket reseller site). Only a quarter go to the general public; the rest are distributed to NFL teams. Of all ticket buyers, the largest group (27%) is coming from Washington State for the Seahawks, who’ve won just one Super Bowl in franchise history compared with the Patriots’ six titles, all with Tom Brady at quarterback. Google , OpenAI, Anthropic , Amazon , and Meta are splashing out for competing ads about whose AI is best for customers, so maybe their respective CEOs will show up, too. Other than Amazon’s Andy Jassy, who reportedly splits his time between Seattle and Santa Monica, all of them have homes within an hour or so of Sunday’s game. This is just the third time the Bay Area has hosted the Super Bowl. The first time was in 1985 at Stanford Stadium, the original football stadium at Stanford University, where the 49ers beat the Dolphins. The second took place 10 years ago at Levi’s Stadium, when the Broncos beat the Panthers. Techcrunch event Boston, MA | June 23, 2026",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/01/tim-coook-apple-tv-GettyImages-2235568147-1.jpg?w=1024"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "GitHub - localgpt-app/localgpt",
      "url": "https://github.com/localgpt-app/localgpt",
      "published": "2026-02-08T01:26:38+00:00",
      "summary": "<p>I built LocalGPT over 4 nights as a Rust reimagining of the OpenClaw assistant pattern (markdown-based persistent memory, autonomous heartbeat tasks, skills system).<p>It compiles to a single ~27MB binary — no Node.js, Docker, or Python required.<p>Key features:<p>- Persistent memory via markdown files (MEMORY, HEARTBEAT, SOUL markdown files) — compatible with OpenClaw's format - Full-text search (SQLite FTS5) + semantic search (local embeddings, no API key needed) - Autonomous heartbeat runner that checks tasks on a configurable interval - CLI + web interface + desktop GUI - Multi-provider: Anthropic, OpenAI, Ollama etc - Apache 2.0<p>Install: `cargo install localgpt`<p>I use it daily as a knowledge accumulator, research assistant, and autonomous task runner for my side projects. The memory compounds — every session makes the next one better.<p>GitHub: <a href=\"https://github.com/localgpt-app/localgpt\" rel=\"nofollow\">https://github.com/localgpt-app/localgpt</a> Website: <a href=\"https://localgpt.app\" rel=\"nofollow\">https://localgpt.app</a><p>Would love feedback on the architecture or feature ideas.</p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46930391\">https://news.ycombinator.com/item?id=46930391</a></p> <p>Points: 5</p> <p># Comments: 0</p>",
      "content_text": "You can’t perform that action at this time.",
      "cover_image_url": "https://opengraph.githubassets.com/eb51eecade2818828940b85c8b706ba258e708baf6087cc5783ed8d10fa88a77/localgpt-app/localgpt"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Former Tumblr head Jeff D’Onofrio steps in as acting CEO at the Washington Post",
      "url": "https://www.theverge.com/tech/875433/tumblr-jeff-donofrio-ceo-washington-post-layoffs",
      "published": "2026-02-07T23:41:23+00:00",
      "summary": "After what can generously be called a contentious tenure as the CEO of The Washington Post, Will Lewis is stepping down following mass layoffs this week. Jeff D'Onofrio, former CEO of Tumblr from 2017 to 2022, will step in as acting CEO and publisher. D'Onofrio has been CFO at the Post since June of last [&#8230;]",
      "content_text": "After what can generously be called a contentious tenure as the CEO of The Washington Post , Will Lewis is stepping down following mass layoffs this week. Jeff D’Onofrio, former CEO of Tumblr from 2017 to 2022, will step in as acting CEO and publisher. D’Onofrio has been CFO at the Post since June of last year, meaning he’s had a front row seat to Jeff Bezos’ dismantling of the once storied paper for the last nine months. D’Onofrio’s resume doesn’t include extensive experience in traditional news media, nor many notable success stories. He was briefly the general manager of Yahoo News while it was still a Verizon property, before shifting his focus solely to Tumblr. Under his leadership, Tumblr tried to clean up its image by banning adult content, but its traffic fell by 30 percent . Yahoo had purchased Tumblr for $1.1 billion in 2013. By 2019, it was sold to Automatic, the owner of WordPress, reportedly for less than $3 million .",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/gettyimages-490730284.jpg?quality=90&strip=all&crop=0%2C14.560455138261%2C100%2C70.879089723477&w=1200"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Super Bowl LX ads: all AI everything",
      "url": "https://www.theverge.com/entertainment/874504/super-bowl-lx-ads-big-game",
      "published": "2026-02-07T23:10:44+00:00",
      "summary": "Super Bowl LX is nearly here, with the Seattle Seahawks taking on the New England Patriots. While Bad Bunny will be the star of the halftime show, AI could be the star of the commercial breaks, much like crypto was a few years ago. Last year’s Super Bowl featured a Google Gemini ad that fumbled [&#8230;]",
      "content_text": "Super Bowl LX is nearly here, with the Seattle Seahawks taking on the New England Patriots. While Bad Bunny will be the star of the halftime show, AI could be the star of the commercial breaks, much like crypto was a few years ago . Last year’s Super Bowl featured a Google Gemini ad that fumbled a Gouda cheese stat , and this year’s game is already slated to include an ad for Anthropic’s AI platform that takes jabs at its competitors, namely OpenAI. AI-generated ads could make an appearance, too. Super Bowl LX is set to kick off at 6:30PM ET/3:30PM PT on Sunday, February 8th at Levi’s Stadium in Santa Clara, California.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24008751/acastro_STK099_NFL_01.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "FDA Intends to Take Action Against Non-FDA-Approved GLP-1 Drugs",
      "url": "https://www.fda.gov/news-events/press-announcements/fda-intends-take-action-against-non-fda-approved-glp-1-drugs",
      "published": "2026-02-07T22:25:03+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.fda.gov/news-events/press-announcements/fda-intends-take-action-against-non-fda-approved-glp-1-drugs\">https://www.fda.gov/news-events/press-announcements/fda-intends-take-action-against-non-fda-approved-glp-1-drugs</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46928810\">https://news.ycombinator.com/item?id=46928810</a></p> <p>Points: 77</p> <p># Comments: 134</p>",
      "content_text": "For Immediate Release: February 06, 2026 Statement From: Martin A Makary, M.D., M.P.H. Commissioner of Food and Drugs - Food and Drug Administration Today, the U.S. Food and Drug Administration is announcing its intent to take decisive steps to restrict GLP-1 active pharmaceutical ingredients (APIs) intended for use in non-FDA-approved compounded drugs that are being mass-marketed by companies — including Hims & Hers and other compounding pharmacies — as similar alternatives to FDA-approved drugs. These actions are aimed to safeguard consumers from drugs for which the FDA cannot verify quality, safety, or efficacy. We take seriously any potential violations of the Federal Food, Drug, and Cosmetic Act. The FDA is also taking steps to combat misleading direct-to-consumer advertising and marketing following warning letters that were sent in the fall of 2025. In promotional materials, companies cannot claim that non-FDA-approved compounded products are generic versions or the same as drugs approved by FDA. They also cannot state compounded drugs use the same active ingredient as the FDA-approved drugs or that compounded drugs are clinically proven to produce results for the patient. The FDA will use all available compliance and enforcement tools within its authorities to address unsubstantiated claims and associated public health concerns. Entities engaged in the manufacture, distribution, or marketing of unapproved compounded GLP-1 products should be aware that failure to adequately address any violations may result in legal action without further notice, including, without limitation, seizure and injunction. Related Information ### Boilerplate The FDA, an agency within the U.S. Department of Health and Human Services, protects the public health by assuring the safety, effectiveness, and security of human and veterinary drugs, vaccines and other biological products for human use, and medical devices. The agency also is responsible for the safety and security of our nation’s food supply, cosmetics, dietary supplements, radiation-emitting electronic products, and for regulating tobacco products. Content current as of: 02/06/2026",
      "cover_image_url": "https://www.fda.gov/themes/custom/preview/img/FDA-Social-Graphic.png"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "TCC : Tiny C Compiler",
      "url": "https://bellard.org/tcc/",
      "published": "2026-02-07T21:45:54+00:00",
      "summary": "<p>Article URL: <a href=\"https://bellard.org/tcc/\">https://bellard.org/tcc/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46928435\">https://news.ycombinator.com/item?id=46928435</a></p> <p>Points: 127</p> <p># Comments: 56</p>",
      "content_text": "Tiny C Compiler News [Note: I am no longer working on TCC. Check the mailing list to get up to date information.] Features SMALL! You can compile and execute C code everywhere, for example on rescue disks (about 100KB for x86 TCC executable, including C preprocessor, C compiler, assembler and linker). FAST! tcc generates x86 code. No byte code overhead. Compile, assemble and link several times faster than GCC . UNLIMITED! Any C dynamic library can be used directly. TCC is heading torward full ISOC99 compliance. TCC can of course compile itself. SAFE! tcc includes an optional memory and bound checker . Bound checked code can be mixed freely with standard code. Compile and execute C source directly. No linking or assembly necessary. Full C preprocessor and GNU-like assembler included. C script supported : just add '#!/usr/local/bin/tcc -run' at the first line of your C source, and execute it directly from the command line. With libtcc , you can use TCC as a backend for dynamic code generation. Compilation Speed Compilation speed for the Links Browser project . There are 76936 lines (including headers). 1950947 lines (67.2 MBytes) are compiled because the same headers are included in many files. TinyCC is about 9 times faster than GCC. Compiler Time(s) lines/second MBytes/second TinyCC 0.9.22 2.27 859000 29.6 GCC 3.2 -O0 20.0 98000 3.4 Measures were done on a 2.4 GHz Pentium 4. Real time is measured. Compilation time includes compilation, assembly and linking. More up to date tests are available: 1 , 2 , 3 , 4 . You want to help ? Here are some suggestions: Report bugs to the mailing list (and eventually fix them). Links License TCC is distributed under the GNU Lesser General Public License. Copyright (c) 2001-2018 Fabrice Bellard Fabrice Bellard - https://bellard.org/ - https://bellard.org/tcc/",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "NBA star Giannis Antetokounmpo joins Kalshi as an investor",
      "url": "https://techcrunch.com/2026/02/07/nba-star-giannis-antetokounmpo-joins-kalshi-as-an-investor/",
      "published": "2026-02-07T21:30:41+00:00",
      "summary": "Antetokounmpo is the first NBA player to directly invest in Kalshi.",
      "content_text": "Giannis Antetokounmpo of the Milwaukee Bucks announced Friday that he has joined prediction market Kalshi as a shareholder, making him the first NBA player to invest directly in the company. “The internet is full of opinions. I decided it was time to make some of my own,” said the two-time NBA MVP in a social media post . “Today, I’m joining Kalshi as a shareholder. We all on Kalshi now.” The announcement has not gone over well on social media. On Reddit , for example, one user described it as “literally a conflict of interest,” while another described Kalshi as “cancerous” and yet another wondered, “is this even allowed.” According to The Athletic , the NBA’s recent collective bargaining agreement allows players to advertise and take stakes of up to 1% in sports betting companies, as long as they’re not promoting league-related wagers. Kalshi said it will partner with Antetokounmpo on marketing and live events — and in accordance with the company’s “strict terms of service that ban insider trading and market manipulation,” he will not be allowed to trade on markets related to the NBA.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2186559456.jpg?w=1024"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "GOG is already working on native Linux support",
      "url": "https://www.theverge.com/tech/875425/gog-native-linux-support",
      "published": "2026-02-07T20:23:46+00:00",
      "summary": "GOG recently posted a job listing for a senior software engineer focused on porting its Galaxy desktop client to Linux. Now, in reply to a Reddit AMA, the GOG team has revealed that work on native Linux support is already underway. It's still too early to give an ETA, according to the Reddit thread. But [&#8230;]",
      "content_text": "“We’re at a very early stage right now, but we of course see the rising popularity and importance of this OS for gamers and agree on its value. We’ve started the recruitment process for a Senior Engineer who would help handle it. When it comes to specifics, we can’t share much at the moment. Nonetheless, the work has started, and this will appear on GOG one day. That much we can say.”",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/gog-logo.webp?quality=90&strip=all&crop=0,10.945238432149,100,78.109523135701"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Notepad on my Windows PC broke thanks to Microsoft's servers",
      "url": "https://www.windowscentral.com/microsoft/windows-11/windows-locked-me-out-of-notepad-is-the-thin-client-era-ruining-pcs",
      "published": "2026-02-07T19:51:56+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-locked-me-out-of-notepad-is-the-thin-client-era-ruining-pcs\">https://www.windowscentral.com/microsoft/windows-11/windows-locked-me-out-of-notepad-is-the-thin-client-era-ruining-pcs</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46927098\">https://news.ycombinator.com/item?id=46927098</a></p> <p>Points: 100</p> <p># Comments: 121</p>",
      "content_text": "A couple of weeks ago, I found that I couldn't open Notepad on my desktop PC. It wasn't because Windows 11 had crashed, but rather, Microsoft told me it wasn't \"available in (my) account\". It turned out that an error (0x803f8001) with Microsoft Store's licensing service stopped me from opening a few first-party apps, including the Snipping Tool. Yes, even the app I usually use to screenshot error messages was busted. Ironic. Now, I'm usually a fairly level-headed Windows enthusiast who can relate to users who both love and loathe Microsoft's operating system, but I couldn't open Notepad.exe — are we serious? You've probably all seen the memes: it's called \"This PC\" now, and not \"My Computer\" anymore. It's usually easy to laugh off as a disgruntled conspiracy, but I can see why it trends when the themings of Software as a Service (SaaS) are creeping into the most basic Windows apps. I was locked out of Notepad due to Microsoft's server bug — is this the 'Thin Client' era? - YouTube Watch On After all, Notepad is supposed to be the absolute barebones, most ultra-basic app in the entire OS. Well, it was, before Microsoft added Copilot and users started looking for a way to disable the unusual AI addition . Sure, you can still type C:\\Windows\\notepad.exe into 'Run' with Windows + R for a legacy fallback, but many perhaps wouldn't know about it. I'm still a Windows guy, and I always will be. Nevertheless, I can't ignore that Windows 11 regularly feels less like an operating system and more like a thin client; just a connection to Microsoft's cloud with fewer options for you to act as the administrator of your own PC. This PC vs. My Computer I was completely locked out of the modern Notepad (Image credit: Ben Wilson | Windows Central) To be clear, I don't have major problems with the default, out-of-box experience (OOBE) of Windows 11. In fact, it doesn't take me long to make changes when installing fresh copies on new desktop builds. Default pins on the Start menu don't matter because I barely use it, and disabling ads is straightforward enough . The major points pretty much boil down to: Uninstalling OneDrive : The web app is fine for manual backups, but I definitely don't want my files automatically synced. Creating a local account : Microsoft keeps making it harder, but I'll always use workarounds. After that, I don't take issue with the normal desktop — unless something unexpectedly breaks. Our Editor-in-Chief, Daniel Rubino, said it best, \"People don’t hate change. They hate surprise. \" It was certainly a surprise to lose access to my plain text editor, loaded up with more than what an extended (Windows + V) clipboard would be useful for. Nobody asked for this. So, is the solution to look for open‑source Notepad clones? Maybe for some enthusiasts, but that's just another app to add to a growing Winget list , and I'd rather Microsoft stay true to its word about walking back Windows 11's AI overload . I can't abide by comments on social platforms suggesting people \"just use a debloater\" on a new Windows PC, either — we shouldn't have to. I generally avoid recommending Windows debloat scripts from GitHub to anyone in the first place. That, and I generally avoid recommending Windows debloat scripts from GitHub to anyone in the first place. Windows can be adjusted to your liking if you follow the right guides , and while you can inspect open-source code for yourself and generally trust some well-respected coders on that platform, it's a strange solution that needn't exist. Stop nudging your users towards danger I built my PC around the 9800X3D, but is it really mine? (Image credit: Ben Wilson | Windows Central) I'm not naive enough to think Windows is Microsoft's top priority. Cloud computing and Microsoft 365 are far more valuable than a consumer-level operating system, though Microsoft does have a staggering lead over the competition — one that would be absurd to jeopardize. Still, my problems with Notepad and Snipping Tool are a raindrop in the Pacific Ocean of Microsoft's broader plans, but I don't want first-party apps asking for authentication from its servers — nor do I want our readers to download the first debloat script they find on the web. There are justifications for Microsoft adding elements of its cloud business to Windows, but I wish it wouldn't force it in a way that locks people into an online-only experience. My PC should be entirely functional without an Internet connection — especially when I need a few scribbles from Notepad. AI is undoubtedly the future, at least in some capacity. Even if Satya Nadella says artificial intelligence needs to prove its worth , there's no believable chance that it's going away, especially now that Copilot is so deeply ingrained in practically everything Microsoft owns. Still, if online-only services are all active by default and Windows 12 is ultimately an agentic AI OS , I wouldn't be surprised if more people stick with a debloated Windows 11, just as others did with Windows 10 . Do you think the next version of Windows will return some control back to the user, or will it be even more Internet-dependent? Join us on Reddit at r/WindowsCentral to share your insights and discuss our latest news, reviews, and more.",
      "cover_image_url": "https://cdn.mos.cms.futurecdn.net/wPJcMXqD44weR2UTFWd8fJ-1920-80.jpg"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "I went back to Linux and it was a mistake",
      "url": "https://www.theverge.com/report/875077/linux-was-a-mistake",
      "published": "2026-02-07T19:30:00+00:00",
      "summary": "It's a complete coincidence that I installed Linux around the same time as my colleagues Nathan Edwards and Stevie Bonifield. A few months ago, I decided to breathe new life into a 2019 Dell XPS 15 that had been collecting dust for a couple of years. Despite its (at the time) high-end Core i7 CPU [&#8230;]",
      "content_text": "It’s a complete coincidence that I installed Linux around the same time as my colleagues Nathan Edwards and Stevie Bonifield. A few months ago, I decided to breathe new life into a 2019 Dell XPS 15 that had been collecting dust for a couple of years. Despite its (at the time) high-end Core i7 CPU and 32GB of RAM, Windows was frustratingly slow on it. The fan was constantly at full throttle even when the machine was idle, and it regularly failed to install updates. So in early 2024, I gave up and switched to an M1 MacBook Pro. But I wanted to give my oldest child something to practice typing on. Plus, I’d been trying to find a suitable distraction-free writing solution . (Spoiler: this laptop was not the solution I was looking for .) So I installed Ubuntu. Again. See, before the MacBook and before the Dell XPS, I was a Linux user. I first installed Ubuntu in 2006 on a ThinkPad X40. And it remained my primary OS across three different laptops and 13 years. My Ubuntu desktop in 2007. Despite some... let’s call them quirks (Wi-Fi didn’t work out of the box on that X40), I was happy with Linux for a long time. I dual-booted Windows out of necessity, and often had a work-issued MacBook on hand. But those were for testing apps or specific tasks, like editing video. 99 percent of my life was spent in Ubuntu. That is, until about 2017. As I got older, tinkering with my laptop changed from a hobby to something that got in the way of me pursuing my other hobbies. I had rediscovered my love of making music, and, try as it might, Ubuntu Studio just wasn’t cutting it. I was spending more time in Ableton Live , which meant more time in Windows, until in 2019, I bought the aforementioned XPS and switched over completely. A lot has changed in the 20 years since I first installed Linux, and even in the seven years since I last used it. It’s now arguably the best platform for PC gaming . There are genuinely great photo-editing apps, such as Darktable , which was introduced in 2009. And there are even viable, commercial options for making music in Bitwig and Reaper , all of which have improved dramatically since 2019. Darktable is a capable RAW photo editor, but it’s no Lightroom. The Ubuntu installation process hasn’t changed much, but the interface is prettier. I put the ISO on a thumb drive and briefly considered wiping the XPS completely. I chickened out at the last minute and decided to dual-boot, which meant repartitioning my hard drive. Right off the bat, I was reminded that Linux hasn’t completely overcome its fiddly nature. The fingerprint reader didn’t work. A minor annoyance I decided to ignore. More concerning was that Ubuntu failed to install updates because of an EFI partition issue specific to the XPS 15 that was also causing problems under Windows. I managed to get them installed, but I’m not convinced I didn’t create a ticking time bomb by deleting essential files. Ubuntu also refused to mount my Windows partition for the first month or so, before suddenly working for unknown reasons. Stevie similarly admitted to “ rage quitting and going to bed ” when they couldn’t get Ubuntu to connect to a second SSD. Nathan had his own bizarre problems where his CachyOS refused to acknowledge his mouse clicks . He was also hit with option paralysis, trying to choose between four bootloaders and thirteen desktop environments. For some, this is part of the appeal, the infinite customizability, the power to bend your computer to your every whim and make it truly yours. Ubuntu doesn’t throw its customizability in your face, the way Cachy does, but it’s still there if you want it. The problem, as I encountered during my days of meticulously tweaking desktops and crafting my dream note-taking tool using Obsidian , is that you’re building a house of cards. One tiny thing in some seemingly inconsequential library or plugin could cause the whole system to come crumbling down. I don’t want to be wasting my time tweaking and troubleshooting when I already have things that work. Even if you keep it simple, as I did on my XPS, you’re hardly guaranteed smooth sailing. Ubuntu is one of the best-supported Linux distros. And, while my specific XPS 15 isn’t one of them, Dell has sold many Ubuntu-certified laptops over the years, so I figured I was in the clear — wrong. Several apps, whether from the official Ubuntu App Center, downloaded snaps , or .deb packages, quietly failed to install. No obvious error, no nothing. I had to open the terminal and install them from there to see what went wrong. Installing software on Linux is somehow even more confusing than it was 20 years ago. Bitwig proves that Linux can do it all these days. Even the things that worked weren’t seamless. I got Steam up and running, but it took hours , required installing outdated 32-bit libraries, and it crashed along the way. Oh, and Steam games refused to recognize my audio interface; they would only play through the laptop’s speakers. CachyOS or Bazzite would have provided a smoother Steam experience. But it’s also illustrative of the problem. Saying you use Linux is almost meaningless because there are so many different flavors. Thankfully, Bitwig recognized my audio interface, but it was fickle about which MIDI controllers it wanted to work with (an issue I’d never had on the Mac version), and crashed when I first tried to run it. Also, while the native Bitwig instruments are solid, I missed my favorite soft synths and effects, like Arturia’s Pigments , which is Windows- and Mac-only. There were a handful of other minor annoyances. If my laptop went to sleep (which it only seems to do when it’s plugged in, go figure), it refused to reconnect to the external hard drive I have hooked up, and it stopped recognizing the SD card reader. To get them working again, I have to reboot. It also doesn’t wake on input from a Bluetooth mouse or keyboard. I have to open the lid to wake it when it’s hooked up to my dock and an external monitor. If I just need a web browser, Ubuntu works like a charm. I had no issues with my Wi-Fi or with Firefox. My XPS now runs faster and quieter than it did with Windows. And I got Obsidian up and running with minimal fuss. I used Ubuntu as my primary work machine for a few days, and everything was fine. But I can do most of my job from the confines of a web browser. It’s everything else. I can game on my Linux machine, but the experience is smoother on my Switch or PS4. I can make music in Bitwig or Reaper on Ubuntu, but Ableton on macOS is easier to use and supports all my VSTs. GIMP and Darktable offer solid image editing, but let’s be honest, they’re nowhere near as powerful as Lightroom and Photoshop. Linux can do all the things now — sometimes better than Windows. But for all it does, it always feels like there’s a better option. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Terrence O'Brien Analysis Linux Report Tech",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/Screenshot-From-2026-01-15-13-38-29.png?quality=90&strip=all&crop=0%2C10.839398969906%2C100%2C78.321202060188&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Brookhaven Lab's RHIC concludes 25-year run with final collisions",
      "url": "https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/",
      "published": "2026-02-07T19:07:27+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/\">https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46926576\">https://news.ycombinator.com/item?id=46926576</a></p> <p>Points: 48</p> <p># Comments: 50</p>",
      "content_text": "<p>Article URL: <a href=\"https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/\">https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46926576\">https://news.ycombinator.com/item?id=46926576</a></p> <p>Points: 48</p> <p># Comments: 50</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "New York lawmakers propose a three-year pause on new data centers",
      "url": "https://techcrunch.com/2026/02/07/new-york-lawmakers-propose-a-three-year-pause-on-new-data-centers/",
      "published": "2026-02-07T18:23:04+00:00",
      "summary": "Although the bill’s prospects are uncertain, New York is at least the sixth state to consider pausing construction of new data centers.",
      "content_text": "New Yorker state lawmakers have introduced a bill that would impose a moratorium of at least three years on permits tied to the construction and operation of new data centers. While the bill’s prospects are uncertain, Wired reports that New York is at least the sixth state to consider pausing construction of new data centers. As tech companies plan to spend ever-increasing amounts of money to build AI infrastructure, both Democrats and Republicans have expressed concerns about the impact those data centers might have on surrounding communities. Studies have also linked data centers to increased home electricity bills . Critics include progressive Senator Bernie Sanders, who has called for a national moratorium , as well as conservative Florida Governor Ron De Santis, who said data centers will lead to “higher energy bills just so some chatbot can corrupt some 13 year old kid online.” More than 230 environmental groups including Food & Water Watch, Friends of the Earth, and Greenpeace recently signed an open letter to Congress calling for a national moratorium on the construction of new data centers. Eric Weltman of Food & Water Watch told Wired that the New York bill — sponsored by state senator Liz Krueger and assemblymember Anna Kelles, both Democrats — was “our idea.” Data center pauses have also been proposed by Democrats in Georgia, Vermont, and Virginia, while Republicans sponsored similar bills in Maryland and Oklahoma. According to Politico , Krueger described her state as “completely unprepared” for the “massive data centers” that are “gunning for New York.” “It’s time to hit the pause button, give ourselves some breathing room to adopt strong policies on data centers, and avoid getting caught in a bubble that will burst and leave New York utility customers footing a huge bill,” she said. Techcrunch event Boston, MA | June 23, 2026 Last month, New York Governor Kathy Hochul announced a new initiative called Energize NY Development, which her office said would both modernize the way large energy users (i.e., data centers) would connect to the grid while also requiring them to “pay their fair share.”",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-2217198328.jpeg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Speed up responses with fast mode",
      "url": "https://code.claude.com/docs/en/fast-mode",
      "published": "2026-02-07T18:08:23+00:00",
      "summary": "<p>Article URL: <a href=\"https://code.claude.com/docs/en/fast-mode\">https://code.claude.com/docs/en/fast-mode</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46926043\">https://news.ycombinator.com/item?id=46926043</a></p> <p>Points: 120</p> <p># Comments: 130</p>",
      "content_text": "Fast mode is in research preview . The feature, pricing, and availability may change based on feedback. Fast mode delivers faster Opus 4.6 responses at a higher cost per token. Toggle it on with /fast when you need speed for interactive work like rapid iteration or live debugging, and toggle it off when cost matters more than latency. Fast mode is not a different model. It uses the same Opus 4.6 with a different API configuration that prioritizes speed over cost efficiency. You get identical quality and capabilities, just faster responses. What to know: Use /fast to toggle on fast mode in Claude Code CLI. Also available via /fast in Claude Code VS Code Extension. Fast mode for Opus 4.6 pricing starts at $30/150 MTok. Fast mode is available at a 50% discount for all plans until 11:59pm PT on February 16. Available to all Claude Code users on subscription plans (Pro/Max/Team/Enterprise) and Claude Console. For Claude Code users on subscription plans (Pro/Max/Team/Enterprise), fast mode is available via extra usage only and not included in the subscription rate limits. This page covers how to toggle fast mode , its cost tradeoff , when to use it , requirements , and rate limit behavior . Toggle fast mode Toggle fast mode in either of these ways: Type /fast and press Tab to toggle on or off Set \"fastMode\": true in your user settings file Fast mode persists across sessions. For the best cost efficiency, enable fast mode at the start of a session rather than switching mid-conversation. See understand the cost tradeoff for details. When you enable fast mode: If you’re on a different model, Claude Code automatically switches to Opus 4.6 You’ll see a confirmation message: “Fast mode ON” A small ↯ icon appears next to the prompt while fast mode is active Run /fast again at any time to check whether fast mode is on or off When you disable fast mode with /fast again, you remain on Opus 4.6. The model does not revert to your previous model. To switch to a different model, use /model . Understand the cost tradeoff Fast mode has higher per-token pricing than standard Opus 4.6: Mode Input (MTok) Output (MTok) Fast mode on Opus 4.6 (<200K) $30 $150 Fast mode on Opus 4.6 (>200K) $60 $225 Fast mode is compatible with the 1M token extended context window. When you switch into fast mode mid-conversation, you pay the full fast mode uncached input token price for the entire conversation context. This costs more than if you had enabled fast mode from the start. Decide when to use fast mode Fast mode is best for interactive work where response latency matters more than cost: Rapid iteration on code changes Live debugging sessions Time-sensitive work with tight deadlines Standard mode is better for: Long autonomous tasks where speed matters less Batch processing or CI/CD pipelines Cost-sensitive workloads Fast mode vs effort level Fast mode and effort level both affect response speed, but differently: Setting Effect Fast mode Same model quality, lower latency, higher cost Lower effort level Less thinking time, faster responses, potentially lower quality on complex tasks You can combine both: use fast mode with a lower effort level for maximum speed on straightforward tasks. Requirements Fast mode requires all of the following: Not available on third-party cloud providers : fast mode is not available on Amazon Bedrock, Google Vertex AI, or Microsoft Azure Foundry. Fast mode is available through the Anthropic Console API and for Claude subscription plans using extra usage. Extra usage enabled : your account must have extra usage enabled, which allows billing beyond your plan’s included usage. For individual accounts, enable this in your Console billing settings . For Teams and Enterprise, an admin must enable extra usage for the organization. Fast mode usage is billed directly to extra usage, even if you have remaining usage on your plan. This means fast mode tokens do not count against your plan’s included usage and are charged at the fast mode rate from the first token. Admin enablement for Teams and Enterprise : fast mode is disabled by default for Teams and Enterprise organizations. An admin must explicitly enable fast mode before users can access it. If your admin has not enabled fast mode for your organization, the /fast command will show “Fast mode has been disabled by your organization.” Enable fast mode for your organization Admins can enable fast mode in: Handle rate limits Fast mode has separate rate limits from standard Opus 4.6. When you hit the fast mode rate limit or run out of extra usage credits: Fast mode automatically falls back to standard Opus 4.6 The ↯ icon turns gray to indicate cooldown You continue working at standard speed and pricing When the cooldown expires, fast mode automatically re-enables To disable fast mode manually instead of waiting for cooldown, run /fast again. Research preview Fast mode is a research preview feature. This means: The feature may change based on feedback Availability and pricing are subject to change The underlying API configuration may evolve Report issues or feedback through your usual Anthropic support channels. See also",
      "cover_image_url": "https://claude-code.mintlify.app/_next/image?url=%2F_mintlify%2Fapi%2Fog%3Fdivision%3DConfiguration%26appearance%3Dsystem%26title%3DSpeed%2Bup%2Bresponses%2Bwith%2Bfast%2Bmode%26description%3DGet%2Bfaster%2BOpus%2B4.6%2Bresponses%2Bin%2BClaude%2BCode%2Bby%2Btoggling%2Bfast%2Bmode.%26logoLight%3Dhttps%253A%252F%252Fmintcdn.com%252Fclaude-code%252Fo69F7a6qoW9vboof%252Flogo%252Flight.svg%253Ffit%253Dmax%2526auto%253Dformat%2526n%253Do69F7a6qoW9vboof%2526q%253D85%2526s%253D536eade682636e84231afce2577f9509%26logoDark%3Dhttps%253A%252F%252Fmintcdn.com%252Fclaude-code%252Fo69F7a6qoW9vboof%252Flogo%252Fdark.svg%253Ffit%253Dmax%2526auto%253Dformat%2526n%253Do69F7a6qoW9vboof%2526q%253D85%2526s%253D0766b3221061e80143e9f300733e640b%26primaryColor%3D%25230E0E0E%26lightColor%3D%2523D4A27F%26darkColor%3D%25230E0E0E%26backgroundLight%3D%2523FDFDF7%26backgroundDark%3D%252309090B&w=1200&q=100"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "GitHub - Momciloo/fun-with-clip-path",
      "url": "https://github.com/Momciloo/fun-with-clip-path",
      "published": "2026-02-07T17:45:27+00:00",
      "summary": "<p>Two clip-paths, over the navigation:<p>- The first clip-path is a circle (top-left corner) - The second clip-path is a polygon, that acts like a ray (hardcoded, can be improved)<p>The original work by Iventions Events <a href=\"https://iventions.com/\" rel=\"nofollow\">https://iventions.com/</a> uses JavaScript, but I found CSS-only approach more fun<p>Here's a demo and the codebase: <a href=\"https://github.com/Momciloo/fun-with-clip-path\" rel=\"nofollow\">https://github.com/Momciloo/fun-with-clip-path</a></p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46925811\">https://news.ycombinator.com/item?id=46925811</a></p> <p>Points: 60</p> <p># Comments: 11</p>",
      "content_text": "Momciloo/fun-with-clip-path You can’t perform that action at this time.",
      "cover_image_url": "https://opengraph.githubassets.com/b5272831b20a201533630583506623dc29e04f27317cdab71f2e3439197d0901/Momciloo/fun-with-clip-path"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Jonathan Whiting",
      "url": "https://jonathanwhiting.com/writing/blog/games_in_c/",
      "published": "2026-02-07T17:45:25+00:00",
      "summary": "<p>Article URL: <a href=\"https://jonathanwhiting.com/writing/blog/games_in_c/\">https://jonathanwhiting.com/writing/blog/games_in_c/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46925808\">https://news.ycombinator.com/item?id=46925808</a></p> <p>Points: 175</p> <p># Comments: 165</p>",
      "content_text": "Why I Write Games in C (yes, C) I am an unusual beast. All my solo project games I've been making recently have been written in 'vanilla' C. Nobody does this. So I think it might be interesting to explain why I do. Dry programming language opinions incoming, you have been warned . What I need from a language There's some things which are non-negotiable. First of, it has to be reliable. I can't afford to spend my time dealing with bugs I didn't cause myself. A lot of my games were written for flash, and now flash is dying. I do not want to spend my time porting old games to new platforms, I want to make new games. I need a platform that I am confident will be around for a while. Similarly I want to avoid tying myself to a particular OS, and ideally I'd like to have the option of developing for consoles. So it's important that my programming language is portable, and that it has good portable library support. What I want from a language The strongest thing on my desired, but not required list is simplicity. I find looking up language features, and quirky 'clever' api's incredibly tiring. The ideal language would be one I can memorize, and then never have to look things up. Dealing with bugs is huge creative drain. I want to produce less bugs, so I want strict typing, strong warning messages and static code analysis. I want bugs to be easier to find, so I want good debuggers and dynamic analysis. I'm not interesting in high-def realism, but I do still care a bit about performance. Having more cycles available broadens the palette of things you can do. It's particularly interesting to explore what is possible with modern, powerful computers if you aren't persuing fidelity. Even more than that I care about the speed of the compiler. I am not a zen master of focus, and waiting 10+ seconds is wasteful, yes, but more importantly it breaks my flow. I flick over to Twitter and suddenly 5+ minutes are gone. I am not an OOP convert. I've spent most of my professional life working with classes and objects, but the more time I spend, the less I understand why you'd want to combine code and data so rigidly. I want to handle data as data and write the code that best fits a particular situation. The Alternatives C++ is still the most common language for writing games, and not without reason. I still do almost all of my contract work in it. I dislike it intensely. C++ covers my needs, but fails my wants badly. It is desperately complicated. Despite decent tooling it's easy to create insidious bugs. It is also slow to compile compared to C. It is high performance, and it offers features that C doesn't have; but features I don't want, and at a great complexity cost. C# and Java have similar issues. They are verbose and complex beasts, and I am searching for a concise, simple creature. They both do a lot to railroad a programmer into a strongly OOP style that I am opposed to. As per most higher level languages they have a tendency to hide away complexity in a way that doesn't actually prevent it from biting you. I like Go a lot. In many ways it is C revisited, taking into account what has be learnt in the long years since it was released. I would like to use it, but there are big roadblocks that prevent me. The stop-the-world garbage collection is a big pain for games, stopping the world is something you can't really afford to do. The library support for games is quite poor, and though you can wrap C libs without much trouble, doing so adds a lot of busy work. It is niche enough that I worry a little about long term relevance. It would be nice to make things for the web, but it feels like a terrifyingly fast moving enviroment. It is particularly scary with the death of flash. I really dislike javascript, it is so loose that I marvel that people are able to write big chunks of software in it. I have no interest in trying. Haxe feels much more promising than most alternatives. If I do web stuff again I'll be diving in here. There is some good library support. I am a little concerned by its relative youth, will it last? I don't much have else to say about it though, I've only dabbled with the surface. Some people just say screw it, I'll write my own language, the language I want to use. I admire this, and sometimes I toy with the idea of doing the same. It feels like too much to throw away all existing library support, and taking full responsibilty for future compatibility. It is also very difficult, and when it comes down to it I would rather be making games than programming languages. Why C is still my best fit C is dangerous, but it is reliable. A very sharp knife that can cut fingers as well as veg, but so simple it's not too hard to learn to use it carefully. It is fast, and when it comes to compilation I can't think of anything faster. It can be made to run on just about anything. Usually this is relatively easy. It is hard to imagine a time when this won't be the case. The library and tooling support is strong and ongoing. I say this with some sadness, but it is still the language for me. I absolutely DO NOT mean to say \"hey, you should use C too\". I full appeciate preferences here are pretty specific and unusual. I have also already written more 'vanilla' C code than most, and this certainly is part of my comfort. So yeah, that's it :-) Back to main site",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "xorvoid",
      "url": "https://xorvoid.com/sectorc.html",
      "published": "2026-02-07T17:39:53+00:00",
      "summary": "<p>Article URL: <a href=\"https://xorvoid.com/sectorc.html\">https://xorvoid.com/sectorc.html</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46925741\">https://news.ycombinator.com/item?id=46925741</a></p> <p>Points: 214</p> <p># Comments: 38</p>",
      "content_text": "SectorC: A C Compiler in 512 bytes SectorC ( github ) is a C compiler written in x86-16 assembly that fits within the 512 byte boot sector of an x86 machine. It supports a subset of C that is large enough to write real and interesting programs. It is quite likely the smallest C compiler ever written. In a base64 encoding, it looks like this: 6gUAwAdoADAfaAAgBzH/6DABPfQYdQXoJQHr8+gjAVOJP+gSALDDqluB+9lQdeAG/zdoAEAfy+gI AegFAYnYg/hNdFuE9nQNsOiqiwcp+IPoAqvr4j3/FXUG6OUAquvXPVgYdQXoJgDrGj0C2nUGV+gb AOsF6CgA68Ow6apYKfiD6AKrifgp8CaJRP7rrOg4ALiFwKu4D4Srq1fonP9ewz2N/HUV6JoA6BkA ieu4iQRQuIs26IAAWKvD6AcAieu4iQbrc4nd6HkA6HYA6DgAHg4fvq8Bra052HQGhcB19h/DrVCw UKroWQDoGwC4WZGrW4D/wHUMuDnIq7i4AKu4AA+ridirH8M9jfx1COgzALiLBOucg/j4dQXorf/r JIP49nUI6BwAuI0G6wyE0nQFsLiq6wa4iwarAduJ2KvrA+gAAOhLADwgfvkx2zHJPDkPnsI8IH4S weEIiMFr2wqD6DABw+gqAOvqicg9Ly90Dj0qL3QSPSkoD5TGidjD6BAAPAp1+eu86Ln/g/jDdfjr slIx9osEMQQ8O3QUuAACMdLNFIDkgHX0PDt1BIkEMcBaw/v/A8H9/yvB+v/34fb/I8FMAAvBLgAz wYQA0+CaANP4jwCUwHf/lcAMAJzADgCfwIUAnsCZAJ3AAAAAAAAAAAAAAAAAAAAAAAAAAAAAVao= Supported language A fairly large subset is supported: global variables, functions, if statements, while statements, lots of operators, pointer dereference, inline machine-code, comments, etc. All of these features make it quite capable. For example, the following program animates a moving sine-wave: int y; int x; int x_0; void sin_positive_approx() { y = ( x_0 * ( 157 - x_0 ) ) >> 7; } void sin() { x_0 = x; while( x_0 > 314 ){ x_0 = x_0 - 314; } if( x_0 <= 157 ){ sin_positive_approx(); } if( x_0 > 157 ){ x_0 = x_0 - 157; sin_positive_approx(); y = 0 - y; } y = 100 + y; } int offset; int x_end; void draw_sine_wave() { x = offset; x_end = x + 314; while( x <= x_end ){ sin(); pixel_x = x - offset; pixel_y = y; vga_set_pixel(); x = x + 1; } } int v_1; int v_2; void delay() { v_1 = 0; while( v_1 < 50 ){ v_2 = 0; while( v_2 < 10000 ){ v_2 = v_2 + 1; } v_1 = v_1 + 1; } } void main() { vga_init(); offset = 0; while( 1 ){ vga_clear(); draw_sine_wave(); delay(); offset = offset + 1; if( offset >= 314 ){ // mod the value to avoid 2^16 integer overflow offset = offset - 314; } } } Screenshot But, how? When I started thinking about SectorC, I had just finished Deobfuscating OTCC with a lot of its ideas freshly loaded into my head. I also just had some healthy doses of justine.lol and Tom7 to inspire the absurdity of it all. Did I think I would succeed? I suspected NO. Fit an entire C compiler in 510 bytes of instruction memory? Good luck (sarcasm). Tokenizing The first problem came quickly. In C, the tokenizer/lexer alone seems larger than one 512 byte sector! We need to consume an arbitrary stream of bytes and produce ‚Äútokens‚Äù. For example: int main() { if( a < 5 ){ func(); } } Would be consumed and converted into: 'int' TOKEN_KEYWORD_INT 'main' TOKEN_IDENTIFIER '(' TOKEN_LPAREN ')' TOKEN_RPAREN '{' TOKEN_LBRACE 'if' TOKEN_KEYWORD_IF '(' TOKEN_LPAREN 'a' TOKEN_IDENTIFIER '<' TOKEN_OPERATOR '5' TOKEN_NUMBER ')' TOKEN_RPAREN '{' TOKEN_LBRACE 'func' TOKEN_IDENTIFIER '(' TOKEN_LPAREN ')' TOKEN_RPAREN ';' TOKEN_SEMI '}' TOKEN_RBRACE '}' TOKEN_RBRACE We need to specifically recognize keywords , identifiers , operators , and numbers . And then we need to convert numbers from string to integer with something like atoi() : int atoi(const char *s) { int n = 0; while (1) { char c = *s++; if (!c) break; n = 10 * n + (c - '0'); } return n; } I wrote a fairly straight-forward and minimalist lexer and it took >150 lines of C code. A crude estimate of the same code in x86-16 would require 300-450 bytes minimum (e.g. a simple add ax,bx instruction encodes as 2 bytes). And this doesn‚Äôt include any symbol table, recursive-descent parser, code-generator, branch-patching, etc. No Chance. So, naturally ‚Ä¶ I continued. Always pick the losers. The lolz are more fun that way. Big Insight #1 Big Insight #1 came while thinking about other languages such as Forth. The tokenizer in Forth is nearly trivial. Every token is simply space-delimited. Every token is just called a WORD and nothing is special (slight lie). Hmm, how about a C that does that? So dreamed up a C that is technically still a C, is probably turing-complete, and will definitely make every code maintainer terrified. üòè I will call it the Barely C Programming Language : int done , a , b , c , p , cond ; int(main)(){while(!done){ a = b - c ; *(int*) p = b - c ; a = *(int*) p ; if(cond) a = b - 45 ; }} Here we have spacing strategically placed to create ‚Äúmega-tokens‚Äù For example: int(main)(){while(!done){ is one such \"mega-token\". In a sense, we actually have a language more like: VAR_BEGIN done AND a AND b AND c AND p AND cond END MAIN_BEGIN a = b - c END DEREF p = b - c END a = DEREF p END COND a = b - 45 END MAIN_END But, a normal C compiler will also recognize it as C! Even after using space-delimiters, we still have a lot of tokens and need to find more ways to minimize the tokenizer. What is essential? Well it‚Äôs quite hard to avoid the atoi() if we want to actually have integer literals. What else do we need? How about nothing. Big Insight #2 Big Insight #2 is that atoi() behaves as a (bad) hash function on ordinary text. It consumes characters and updates a 16-bit integer. Hashes are perhaps the holy-grail of computer-science. With a good hash, we can just side-step all the hard problems by trading them for an even harder problem (hash collisions), and then we just ignore that harder problem. Brilliant. (sticks fingers in ears) ü§™ So we have this: Token Type Meaning of atoi() Integer Literal uint16 number Keyword token ‚Äùenum‚Äù value Identifier hash value into a 64K array Implementing Barely C The first implementation of Barely C fit in 468 bytes. It was a simple recursive-descent parser over the atoi tokens. There was no symbol table of any kind. Variables simply access a 64K segment using the hash value. Codegen is emitted somewhat similar to OTCC , using ax as the result register and shuffling values to the stack and then to cx for binary operators. Minimizing with Byte-Threaded Code In an attempt to steal every good idea Forth ever had, I then dreamed up what I will call ‚Äúbyte-threaded-code‚Äù. Since a sector is 512 bytes, if we simply align address on a 2-byte boundary, we can do addressing with a single byte! We can have a series of ‚Äúgadgets‚Äù and do forth-style threading: bits 16 cpu 386 jmp 0x07c0:entry entry: push cs pop ds lea si,operations next: xor ax,ax lodsb add ax,ax push next jmp ax putch: mov ah,0x01 mov al,bl mov dx,0 int 0x14 ret align 2 hang: jmp hang align 2 print_F: mov bx,'F' jmp putch align 2 print_G: mov bx,'G' jmp putch operations: db 17 ; print_F db 20 ; print_G db 17 ; print_F db 17 ; print_F db 20 ; print_G db 17 ; print_F db 17 ; print_F db 17 ; print_F db 20 ; print_G db 16 ; hang Annoyingly, nasm won‚Äôt let you do something like db print_F/2 so I had to write a custom little assembler to do it. Alas, this idea didn‚Äôt work out. In 512 bytes, the overhead of this Forth-style computation model doesn‚Äôt pay for itself. There are a lot of little overheads: 2 byte alignment, extra ret instructions, calling other ‚Äúthreads‚Äù, the next function, etc. The byte-threaded version of Barely C ended up at the same size as the straight-forward version However, the idea is fun and I decided to document it anyways in the event that someone else finds utility. Minimizing the Straight-Forward version Instead, I returned to the straight-forward version and minimized it as much as possible. From 468 bytes ‚áí 303 bytes (165 bytes saving): 510 - 303 ‚áí 207 spare bytes to use for new features! Some tricks: Reorganize code to allow ‚Äúfall-through‚Äù instead of jmp or call Use tail-calls via jmp wherever possible Perform call-fusion (e.g. call tok_next2 instead of call tok_next; call tok_next ) Utilize stosw and lodsw extensively Eliminate machine code tables for cheaper inline stosw versions Prefer cmp ax,imm over cmp bx,imm Keep jump offsets within 8-bits to encode more efficiently Look Ma, A Real C! As it turns out, a lot can be accomplished in 200 bytes if you already have a tokenizer, parser, and code-generator in 300 bytes. With these 200 bytes, Barely C became a proper C: Arbitrarily nested if statement block with an arbitrary expression condition Arbitrarily nested while statement block with an arbitrary expression condition Lots of operators: + , - , * , & , | , ^ , << , >> , == , != , < , > , <= , >= Grouping expressions: ( expression ) Function definitions and recursive function calls (using func() as a hash value into a symbol table at segment 0x3000) A special asm statement for inline machine-code Single-line // comments Multi-line /* comments A trick to do ‚Äúspace-injection‚Äù before semicolons to make code look more normal The biggest enabler here is the binary_oper_tbl which allows for a very cheap way to add lots of operations. Each operator is simply a <16-bit token-value> <16-bit-machine-code> pair, costing just 4 bytes.The above 14 operators cost just 56 bytes plus a little overhead to scan the table. Grammar Here's the full grammer specification: program = (var_decl | func_decl)+ var_decl = \"int\" identifier \";\" func_decl = \"void\" func_name \"{\" statement* \"}\" func_name = <identifier that ends in \"()\" with no space> statement = \"if(\" expr \"){\" statement* \"}\" | \"while(\" expr \"){\" statement* \"}\" | \"asm\" integer \";\" | func_name \";\" | assign_expr \";\" assign_expr = deref? identifier \"=\" expr deref = \"*(int*)\" expr = unary (op unary)? unary = deref identifier | \"&\" identifier | \"(\" expr \")\" | indentifier | integer op = \"+\" | \"-\" | \"&\" | \"|\" | \"^\" | \"<<\" | \">>\" | \"==\" | \"!=\" | \"<\" | \">\" | \"<=\" | \">=\" In addition, both // comment and /* multi-line comment */ styles are supported. (NOTE: This grammar is 704 bytes in ascii, 38% larger than it's implementation!) Inline Machine-Code A programming language without I/O is useless. And, as the C language is defined in an I/O agnostic way, we need some way out. Thus, an asm extension is supported. This allows programs to generate raw x86-16 machine code literals inline. Using asm , programs can access any low-level detail of the machine. This is used extensively in the example code. Error-Handling What is ‚Äúerror-handling‚Äù? ü§£ In traditional C style, we trust the programmer to write correct and well-formed programs. We are certain they are all minor gods and goddesses with the ability of perfection. Obviously, spending bytes on error-checking would be foolish. Surely all will agree that this is a very reasonable standard. For the less divine among us, a lint was also written (that doesn‚Äôt fit in a sector) to detect errors. The author certainly didn‚Äôt require this tool for development. Runtime If C compiler writers were a secret shadow organization like the Free Masons, Illuminati, Lizard Peoples, or Pizzagaters our inner-secret would be ‚ÄúC actually has a runtime‚Äù. SectorC has a runtime under rt/ consisting of two files implemented in C itself: rt/lib.c: A collection of library routines, often coded in inline asm rt/_start.c: The actual entry-point _start() The runtime code is concatenated with program source to construct the full source to compile and run. Examples A few examples are provided that leverage the unique hardware aspects of the x86-16 IBM PC: examples/hello.c: Print a text greeting on the screen writing to memory at 0xB8000 examples/sinwave.c: Draw a moving sine wave animation with VGA Mode 0x13 using an appropriately bad approximation of sin(x) examples/twinkle.c: Play ‚ÄúTwinkle Twinkle Little Star‚Äù through the PC Speaker (Warning: LOUD) Conclusion It seems fitting to end an article with ‚Äútakeaways‚Äù or ‚Äúwhat did we learn‚Äù. So.. umm.. what did we learn? Honestly, I‚Äôm not sure. But in the interest of fun, here‚Äôs a Choice Your Own Adventure version of What Did We Learn: What Did We Learn Your Chosen Adventure Things that seem impossible often aren‚Äôt and we should Just Do It anyway Move to the South Pole with absolutely no gear on a Homesteading Mission Software is too bloated these days, we only need a few KBs Go check yourself into the technology hippie-commune of suckless Error checking is overrated Take Elon up on his pitch to be a mars astronaut because Earth really doesn‚Äôt need more software that ignores errors. Anything X can do, C can do better Something like this? link . Monzy, we need a new rap! (call me) That was all gibberish nonsense and thank you for wasting my life (passive-aggression) Feel regret that you wasted the time because there is a lot better content in the world you‚Äôd rather consume and decide to get a therapist to work through your issues with reading nonsense internet gibberish This xorvoid person/robot/AI is ridiculous/absurd/dumb and does arguably pointless things for fun Follow, like, subscribe, ring the bell.. üòÅ (rss)",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "LG’s C5 TV and Anker’s powerful power bank are this week’s best deals",
      "url": "https://www.theverge.com/gadgets/874585/lg-c5-tv-anker-power-bank-deal-sale-super-bowl",
      "published": "2026-02-07T16:00:00+00:00",
      "summary": "It’s the first weekend of February, which can only mean one thing: The Super Bowl (or “Benito Bowl,” if you’re mainly tuning in for the Bad Bunny-led halftime show) is upon us. The game is Sunday, February 8th, at 6:30PM ET on Peacock, NFL Plus, and on live services that include NBC. With that out [&#8230;]",
      "content_text": "It’s the first weekend of February, which can only mean one thing: The Super Bowl (or “ Benito Bowl ,” if you’re mainly tuning in for the Bad Bunny-led halftime show) is upon us. The game is Sunday, February 8th, at 6:30PM ET on Peacock , NFL Plus , and on live services that include NBC. With that out of the way, I’m here to surface this week’s best deals. There were plenty of good ones, from cheap yet extremely handy two-headed USB-C cables and a $20 sci-fi first-person shooter PC game bundle to steep discounts on big OLED TVs that will impress people at your Super Bowl watch party. If you happen to be in the market for a 65-inch OLED 4K TV (can I come over?), the LG C5 is almost half off its original asking price of $2,699. Whether you buy one through Amazon for $1,397 or from Best Buy at $1399.99, there’s a good chance that you can have it installed by kickoff on Sunday. Amazon currently has fast shipping for this TV, and many Best Buy brick-and-mortar locations are likely to have this model in stock. LG’s C-series TVs are some of the most popular OLED models each year. With pixel-level brightness control, they boast excellent black levels and color accuracy, and are an incredible value for movie lovers, gamers, sports fans, and everyone in between. However, if you’re looking for the best of the best when it comes to brightness, Samsung’s pricier S95F beats the C5. And, while LG’s glossy screen looks fantastic, it’ll show more reflections than the S95F’s matte finish. It’s been a while since we featured a good deal on Anker’s Laptop Power Bank , its 25,000mAh / 90Wh powerhouse that peaks at 100W when charging a single device (or up to 165W with two USB-C devices). Now, we’re featuring its best-ever price that’s currently happening at Newegg and through Anker itself. You can buy the black model at its all-time low price of $89.99 ($45 off) directly from Anker with code VergeYWP0QJDE . This power bank’s output speed, capacity, and selection of four ports (three USB-C, one USB-A) are good and all, but it’s the small details that make this one stand out. Notably, it comes with two built-in USB-C cables, one of which retracts while the other doubles as handle. For those who own an iPhone 12 or newer, or a Google Pixel 10, Belkin’s Stage Powergrip is exactly the accessory you may not have realized you wanted. It’s a 9,300mAh battery-equipped gadget that adds a camera grip to your phone, snapping on snugly with MagSafe or Pixelsnap magnets, depending on the device you have. It lets you snap photos with its dedicated shutter button, and the grip can swivel to let you get the types of shots you want without feeling like you’re endangering your precious phone. There’s been a deal happening all week on the black model, which costs $68.39 at Amazon (originally $79.99, the current cost of the blue and sand-colored options). More ways to save this weekend",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/lgc5lede.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Al Lowe on model trains, funny deaths and working with Disney",
      "url": "https://spillhistorie.no/2026/02/06/interview-with-sierra-veteran-al-lowe/",
      "published": "2026-02-07T15:52:42+00:00",
      "summary": "<p>Article URL: <a href=\"https://spillhistorie.no/2026/02/06/interview-with-sierra-veteran-al-lowe/\">https://spillhistorie.no/2026/02/06/interview-with-sierra-veteran-al-lowe/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46924790\">https://news.ycombinator.com/item?id=46924790</a></p> <p>Points: 89</p> <p># Comments: 18</p>",
      "content_text": "You know he did other things than Larry, right? We talked with Al Lowe about Leisure Suit Larry, but mostly other stuff. This was Roar’s first interview and he ran out of time before he could dive into what Al is mostly known for. Al Lowe is an American software developer who started making games in the early eighties. His is mostly known for the Leisure Suit Larry games, created with Sierra, but he is also a musical man who loves playing his sax and still plays with his model trains. He has also created lots of other games for Sierra, not only the Larry series. If you think Al is great, but you already know all you need to know about Larry, then this is the article for you. And it is pretty long. Get your coffee now, before continuing… Roar: Have you ever been to Norway? Al: Oh yeah, sure. I have this eyeball right here. It works because I spent a week recuperating in the Department of Ophthalmology at Oslo University Hospital. I had a detached retina when we were flying into Oslo, and went to an ophthalmologist, and she said to get to the hospital right now. The next morning a bunch of Norwegian women started poking around in my eye and fixed it. Al Lowe in 2025, cut from Roars interview. Of course, I was blind in that eye for the next week, and I was already blind in the other eye, so I wandered around in the dark while my wife went sightseeing. I went with her, but I didn’t see any sights. Roar: So you have felt and smelt the beautiful fjords, but never seen them. Al: Well, on an earlier trip, we did take the railroad to Bergen. Over the mountain plateau [Hardangervidda]. So we spent some time there, and that was fun. Roar: I’ve never actually taken that trip myself, but I heard it’s wonderful. Al: It was not for us. We got to the top, up in the top of the mountains. And the electricity went off. And so, we parked in the middle of this beautiful snowy scene for three hours, before they finally got the power back on. Then we went on our journey but we had already missed the connecting rides. We had booked a trip on a boat through the fjords, and a trip on the cog railway. We missed all of them. So be sure you go when there is electricity. Roar: Yeah, we like to joke about that in Norway, the richest country in the world and the lousiest trains. I guess that is a good segue, because you do like trains, don’t you? At least model trains? Al: Yes, I do. I’ve been a model railroader for most of my life. I got my first model train when I was 2 years old, and my dad wouldn’t let me play with it. So he ran it around the Christmas tree and I had to watch. But eventually, when I was 9 or 10, I got interested in HO size trains, and built a layout in our basement. Completely by myself, I had no idea what I was doing or anything, but I just learned as I went, piddled around and figured it out. I went to the hobby shop sometime and would say stuff like: How do you glue this stuff to this stuff? And they’d give me some special glue and and teach me how. Al Lowe put trains in his educational game Donald Duck’s Playground. Photo: MobyGames . So, it was fun. I learned a lot, and I proved that I could do things with my hands. I ended up learning a lot about wiring and electricity. And scenery, I did stuff with papier-mâché. I took old tomato sticks from our garden, cut them in different heights. I wrapped old screen door wire over the top of them and coated that with plaster to make mountains and stuff. So I did a lot of stuff, mostly things I’d read about in magazines, but I think it helped me understand that I could learn something if I didn’t already know it. Roar: Did you add any miniature figures or models and stuff like that in the scenery as well? Al: Sure, yeah, lots of stuff. In fact, I built buildings out of balsa wood. And I read an article in a magazine that said if you hold your X-Acto knife at just the right angle and drag it across the balsa wood, you can make clapboard siding, you know, where the siding overlaps. I also built doors from scraps of wood. Anyway, it was fun. It’s a fun hobby, and it served me for ten years at first. Then I went to college and started playing music, and I forgot about it. But then when my son was 10 years old I thought: I liked doing this when I was 10, maybe he will. So we went to the hobby shop and bought a bunch of trains. Of course he wasn’t interested at all, but I got hooked again! So for the last 35 years I’ve been doing N-scale trains, where the locomotive is about five inches long. Roar: So your son is 45, then? Al: Yes! Roar: Yes, then you could have been my dad, because I’m 46. Al: Well, you’re the right age, then, I guess. National Model Railroad Association Magazine. Photo: E-bay . Model trains are not what they used to be Roar: I was sent a link to the National Model Railroad Association where you are mentioned as a member of the board of directors of the 4th Division of the Pacific Northwest region. Al: The Pacific Northwest Region of the NMRA, yeah. I did that for 10 years at least. Then I was assistant director for another 10 years so I worked at that organization for about 20 years. But recently I said: That’s enough, let some new blood come in. So we got new people now, and they’re much better, so I’m happy. Roar: But you didn’t get any money for it? Al: No, no, it’s a volunteer organization. At first we did a paper newsletter every month. We would print and fold and staple and stamp and address-label hundreds of newsletters. I did that for a couple years until I finally convinced everybody that we’ve got to go online. So then I made a PDF, posted it, and we sent out an email. That was much better, but we still had a few die-hard people that would download it and print it out every time. I was part of this for 24 years. Roar: Are there any physical magazines about model trains today? Al: Yes. Well, the man who ran one of the biggest ones just passed away and so his magazine’s gone now, but there’s still a magazine called N Scale, and it’s housed right here in the suburb of Seattle. It is distributed all over the world. And then there’s the National Model Railroad Association, which publishes a magazine every month, all over the world. And then there’s Model Railroader and Railroad Model Craftsman. I know there’s one for each of the scales, for HO and S and O and G for garden railroads. N Scale Railroading. Photo: N Scale . Al: It’s an old hobby. A weird hobby, in that it follows my path. Most people get interested in trains when they’re little kids. And then they grow out of it in high school. Then later in life, they realize: I got time and money now. I could get back in it, this is a good hobby. And it really is. It’s great socially, because the group that I’m in have a layout that’s portable and we can bring it to shows. So 6-8 times a year we pack everything up into a trailer, move it to a place, and set it up. And we run trains all weekend, we talk with the public and hundreds of people come by and see my work. Then we pack it up and put it back in the trailer and then wait for the next show. So it doesn’t get old because it’s so long between shows. It’s really fun. Roar: I guess there’s not that much development in the field, so even though you haven’t done it for 20 years, it’s not that hard to just continue where you left off? Al: Actually, it has changed completely with computers. So you couldn’t be more wrong! Actually, you were correct for 40 years at least. But in the 90s people started developing computerized means of running the trains. And in the mid-90s, the National Model Railroad Association set up standards and said: If you follow all these rules then your stuff can run on anybody’s system. And that’s when it really changed over. About 2001 or 2002, we went from the old system, which was a rheostat that controlled the amount of voltage applied to the rails, just like a volume control. So we went from a potentiometer that changed the amount of power to the tracks to constantly powered tracks, with a computer chip inside each locomotive. It has a number address that you can set. Then on your remote control you can type in the number of the locomotive you want to drive, turn a knob, and it sends a radio signal through the air to a computer that’s permanently affixed to the layout. And that computer multiplexes a serial signal on top of the power, just kind of like your old phone modems where they overlaid a signal on top of the regular phone lines. It then tells the locomotive to go this fast, back up, or sound the whistle and so on. Roar: I guess for you this was not a bad thing at all, because you love that kind of stuff. Al: Oh, no, right? It was right up my the alley there. N Scale is really small. Photo: Freddie10538 (public domain). Roar: I have some experience painting Warhammer miniature figures. Did you paint miniatures yourself? Al: Yeah. The trouble with N Scale is that the people are very small. It’s a challenge to paint. We always tell everybody that the hard part is getting the eyelashes right. Roar: And that’s at least one thing that does not get easier with age. Al: No, no, that’s true. But I have lots of special tools for that. I have an optimizer that has LED lights built around it, so I can zoom right in on things and paint the tiny little stuff. Roar: Pretending to be a cyborg. Al: Yeah, well … getting the help I need. Al Lowe and music Roar: Music is very important to you. And people wouldn’t think about music when they hear your name. But for me, I got this mp3-file in the late 90s with the title: «Al Lowe – For Your Thighs Only». And that played the music from Leisure Suit Larry. So then I learned the name. And of course, I had played these games earlier, but never picked up on the name. Al: I hope you paid me a royalty. Roar: Yeah, of course! So for me you were a musician before I found out that you had also created these games. Al: Well, I was involved with a lot of Sierra products in one way or another. I worked on their spelling program when they had a word processor. I worked on their assembler for Apple II. I worked on … God, just a lot of different stuff. 26 products in 16 years. Al Lowe’s website. Oh, yeah, I should plug my website . Tell people, if they have gotten this far, they should visit my website. There’s lots more stuff there. If you enjoy this, you’ll enjoy that. Roar: Yeah, I believe I will. Your kids, did they go for music, game developing, or anything else in their father’s footsteps? Al: Of course not. They’re my kids. Roar: Since you’re a saxophone player, I would guess that you can play a lot of other instruments as well? Al: Well, I was a high school band director, so I had to learn to play every instrument somewhat. So, I can pick up a viola and play badly, and I can play a trombone or French horn, but my real instrument is the saxophone and also flute and clarinet. Roar: So, what kind of music do you like? Al: Big Band Jazz. But I play as much as I listen. I tend to watch films and read books, but I play music. I’m in two big bands, where I play lead alto sax. And they meet every week for a couple hours in the evening. And I’m in two saxophone quartets that meet a little less regularly, but we play classical saxophone music, and also some pop songs and things, but it’s just four saxophones, and so we get a lot of interesting work. That’s real fun. Roar: I’ve been looking at this YouTube video , where you played in a band called The David Hasselhoff Big Band. Al: Yes, the group is ironically named. Al Lowe and The David Hasselhoff Big Band. Photo: Youtube . Roar: Metallica had been covered by a band of four cello players. Would it be possible to do something like that with saxophones? Al: It would absolutely be possible, but the question is, why would you do that? Roar: That is the better question. I guess being Norwegian, I don’t really feel like any music should be without some kind of growling. Al Lowe and television Roar: Do you watch any modern series on television? Al: We watch a lot of Scandinavian noir shows. A lot of Danish and a couple of Norwegian shows. And we watch them in Norwegian with subtitles. We don’t want to use the English voiceover, because they are usually not very good. Roar: No, I would guess not. Al: It is easier and better just to listen to the Norwegian and not know what you’re saying, but be able to read the subtitles and get the gist. I can’t think of a title right now, but we’ve got a long list on Netflix. Roar: Yeah. Today it’s very easy to consume whatever you want to consume. Even though you don’t necessarily own the stuff you watch. Al: From very early on I didn’t want to own any movies or TV shows. We never bought anything. I always felt like I would rather just rent and see something new – see more stuff, instead of looking at the same thing over and over. And so, I didn’t build up a collection of VHS or DVDs. I was «streaming» when that was still analog. We got discs in the mail, you know. That was pretty advanced. Roar: Yeah like Netflix, the original Netflix? Al: Yeah. Leisure Suit Larry. Photo: Mobygames. Al Lowe and humor Roar: What about humor? The modern humor scene versus the old humor scene. Some things that were acceptable to say back in the eighties are not any more, and so on, and we even rewrite old things to make them more «modern». Do you have any views about this issue, being an old humorist yourself? Al: Well, I said and did things in the eighties’ games that I would never dream of doing now. Let’s put it that way. On the other hand, violence seems to be quite popular. I don’t understand it. We get scared of humor, but yet, you just can’t blow a person up any more than we do now. It is an odd situation isn’t it? Roar: Yep. There has also been so much nudity in the last 10 years in all kinds of movies, and very explicit nudity. Al: Yeah, which I enjoy. I have no problem with that. Roar: Yeah, yeah, I won’t complain. Al: Well, all in all, I guess my opinion is that things have gotten better. How long has it been since I wrote Larry 1? 35 years? No, 38 years. So in the 38 years since I wrote Larry 1, I think all of that stuff has gotten better, with the exception of violence. I’m not happy with that. I think we show too much, too often, and too strongly and too dramatically. Roar: It’s very brutal now. Al: But, you know, I think all these things are a pendulum, right? You know, it’s gonna swing over here, and then eventually it’s gonna swing back. Typical human behaviour. Roar: Yes, that’s true. Al: We’ll see what happens. Well, I won’t see what happens. You can see what happens. Gelfling Adventure. Photo: Hardcoregaming . Old Sierra games Roar: Yes. Um, I guess I also have to talk to you about the old Sierra games. And these might not be the most original questions. Al: Well, I only want original questions….. Roar: You had, among other things, been working on the Dark Crystal Game: Gelfling Adventure. Al: Yeah, I did. Roar: And growing up when I did, I loved watching that old Dark Crystal movie. It was pretty scary when I was eight or nine, but man, what a wonderful movie. Al: It was. Yeah, it sure was. And Roberta [Williams] was delighted when Jim Henson asked her to do a computer game based on Dark Crystal. And I was delighted, because after the artists had done all the backgrounds and things for Dark Crystal, Sierra asked me to spin off an educational version of it. We called it the Gelfling Adventure, and it wasn’t a big hit, but it was sure fun to work on. Roar: I would guess if you could get it today, in a big box, it would be worth a fortune. Al: I used to have a copy, but I think I sold it on eBay when I cleaned out my attic. I had an attic full of games, and finally I just put them on eBay and sold them off one at a time. Roar: You did? Was it that collection Metal Jesus Rocks bought? Al: Ah, no, that was not a game, that was stuff from Sierra. We should tell people what we’re referring to – there’s a YouTube channel ca",
      "cover_image_url": "https://spillhistorie.no/wp-content/uploads/2026/02/al-lowe-topp.png"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "The second-gen AirTags are a scatterbrain’s best friend",
      "url": "https://www.theverge.com/tech/875314/airtags-second-gen-review-item-tracker",
      "published": "2026-02-07T15:30:00+00:00",
      "summary": "In a somewhat controversial Vergecast episode, I declared that AirTags are a superior product to iPads. The iPad lovers roasted me across social media. I have heard and respect their opinions. But, I'm sorry - the second-gen AirTag has only deepened my conviction that the humble, $29 item tracker is one of Apple's most helpful [&#8230;]",
      "content_text": "In a somewhat controversial Vergecast episode , I declared that AirTags are a superior product to iPads. The iPad lovers roasted me across social media. I have heard and respect their opinions. But, I’m sorry — the second-gen AirTag has only deepened my conviction that the humble, $29 item tracker is one of Apple’s most helpful gizmos. The new updates focus more on making a good thing better. There are upgraded ultra-wideband and Bluetooth chips that help extend the range by about 1.5 times. The chime has a new, higher pitch and is 50 percent louder thanks to a redesigned speaker. And you can now use Precision Finding for AirTags on an Apple Watch, provided you have at least a Series 9 or Ultra 2. Before Apple announced the refresh last week, my spouse and I owned seven AirTags and were planning on buying a few more. Both of us struggle with ADHD. We have wily cats who love to bat things under couches and beds and behind shelving. Without AirTags, we’d probably spend an hour a day running up and down the 42 stairs of our four-story townhome trying to find our essentials. We have AirTags on our key fobs, TV remotes, wallets, car glove boxes, and inside our Canada Goose jackets. (They were expensive and it is arctically cold on the East Coast right now, okay?) But we also have plenty of complaints about our AirTags. The other day, my spouse lost their keys in a car lot and spent 90 minutes looking for them. The chime was way too low, and the AirTag was struggling to connect over Bluetooth. The pudgy disc shape is annoying for wallets unless you buy one specially made to fit it. (And those wallets tend to be ugly .) They scuff easily. If your cat bats it down a staircase, there’s a good chance it comes flying apart, and you have to race the unhinged scamp so he doesn’t eat the battery. The second-gen AirTags don’t fix most of that. They’re still the same shape, size, and design. (And, thankfully, price.) My review unit scuffed two seconds after I stuck it in the accompanying key ring. But the louder chime and extended range made a huge difference in testing. You’ve got a new ultra-wideband chip, upgraded Bluetooth chip, redesigned speaker, IP67, and NFC. I pitted the second-gen AirTag against an original one with a freshly replaced battery. I quickly noticed how the extended range improved connectivity. Connecting to my phone was always much faster than the original, regardless of distance. That speed meant the chime rang sooner and the signal for Precision Finding appeared quicker. The vertical range improved, too. AirTags are best if you’re looking for things in horizontal space. They really struggle if you’re on a different floor — a perpetual problem in our townhouse. The original AirTag was fine if I was one floor up or down from my desired object. But two or more floors? Forget it. The best I could hope for was the Precision Finding screen telling me the tag was “far” or, more likely, unreachable. Not so for the second-gen AirTag. I stuck it on the ground floor of my house and ran up all the way to the fourth floor. Not only could I reliably get a quick connection for Precision Finding, to my surprise, I could also easily hear the chime. (If everything on my street were dead silent, I could maybe hear the original AirTag from the same position, but often couldn’t.) This was true when I stuffed the AirTags under blankets and between couch cushions, too. My favorite new feature, however, was the ability to use Precision Finding from the Apple Watch. It’s not intuitive to set up. Instead of using the Find Items app, you have to add a button to the Apple Watch control panel. It works well. When I’m doing chores around the house, I often leave my phone behind. If something with the original AirTag on it is missing, I have to first find my phone and then use Precision Finding on it to find the lost item. I never lose my Apple Watch because it’s always on me. (Honestly, the most-used function on my Apple Watch is finding my phone.) As with the original AirTags, the new versions still have unwanted tracker alerts. Apple’s announcement post for the new model argues that the louder chime makes AirTags less attractive for nefarious purposes. Apple makes a point during setup to say that these devices are not meant for tracking people or pets — unlike Tile — but bad actors won’t listen . I haven’t had this unit long enough to see how the louder chime and extended range impact this feature in an organically triggered scenario. I’ll report back once I have. Adding AirTag Precision Finding to the Apple Watch was my absolute favorite upgrade. I now want to upgrade all our perfectly good original AirTags. At minimum, that’ll set us back $200. While you can recycle old AirTags for free, you don’t get a store credit, and I hate the idea of e-waste when it’s affordable to replace the coin cell battery. My father-in-law has declared he has no such qualms and plans to update all eight of his AirTags immediately. I suggest a more reasonable compromise if you’re an AirTag power user like me. Be patient, identify the four items you tend to lose most, get a four-pack when they’re on sale, and then repurpose the original ones for items you use (or lose) less frequently but still want to track. Ultimately, the iPad lovers have vociferously reminded me that AirTags are not for everyone. I’m inherently jealous of you geniuses who always seem to know where your things are. But if you’re like me, plagued with the executive dysfunction of a goldfish, the second-gen AirTags are a meaningful update — even if it’s not a flashy one. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Victoria Song Accessory Reviews Gadgets Reviews Tech",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/268280_AirTags_2_AKrales_0003.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "[2602.05192] First Proof",
      "url": "https://arxiv.org/abs/2602.05192",
      "published": "2026-02-07T15:25:49+00:00",
      "summary": "<p>Article URL: <a href=\"https://arxiv.org/abs/2602.05192\">https://arxiv.org/abs/2602.05192</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46924591\">https://news.ycombinator.com/item?id=46924591</a></p> <p>Points: 108</p> <p># Comments: 69</p>",
      "content_text": "BibTeX formatted citation ×",
      "cover_image_url": "/static/browse/0.3.4/images/arxiv-logo-fb.png"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "StrongDM Software Factory",
      "url": "https://factory.strongdm.ai/",
      "published": "2026-02-07T15:05:56+00:00",
      "summary": "<p>See also <a href=\"https://simonwillison.net/2026/Feb/7/software-factory/\" rel=\"nofollow\">https://simonwillison.net/2026/Feb/7/software-factory/</a></p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46924426\">https://news.ycombinator.com/item?id=46924426</a></p> <p>Points: 145</p> <p># Comments: 306</p>",
      "content_text": "We built a Software Factory : non-interactive development where specs + scenarios drive agents that write code, run harnesses, and converge without human review. The narrative form is included below. If you'd prefer to work from first principles, I offer a few constraints & guidelines that, applied iteratively, will accelerate any team toward the same intuitions, convictions 1 , and ultimately a factory 2 of your own. In kōan or mantra form: Why am I doing this? (implied: the model should be doing this instead) In rule form: Code must not be written by humans Code must not be reviewed by humans Finally, in practical form: If you haven't spent at least $1,000 on tokens today per human engineer, your software factory has room for improvement The StrongDM AI Story On July 14th, 2025, Jay Taylor and Navan Chauhan joined me (Justin McCarthy, co-founder, CTO) in founding the StrongDM AI team. The catalyst was a transition observed in late 2024: with the second revision of Claude 3.5 (October 2024), long-horizon agentic coding workflows began to compound correctness rather than error. Compounding correctness vs compounding error By December of 2024, the model's long-horizon coding performance was unmistakable via Cursor's YOLO mode . Prior to this model improvement, iterative application of LLMs to coding tasks would accumulate errors of all imaginable varieties (misunderstandings, hallucinations, syntax, version DRY violations, library incompatibility, etc). The app or product would decay and ultimately \"collapse\": death by a thousand cuts, etc. Together with YOLO mode, the updated model from Anthropic provided the first glimmer of what we now refer to internally as non-interactive development or grown software. Find Knobs, Turn To Eleven \"These go to 11\" In the first hour of the first day of our AI team, we established a charter which set us on a path toward a series of findings (which we refer to as our \"unlocks\"). In retrospect, the most important line in the charter document was the following: Hands off! Initially it was just a hunch. An experiment. How far could we get, without writing any code by hand? Not very far! At least: not very far, until we added tests. However, the agent, obsessed with the immediate task, soon began to take shortcuts: return true is a great way to pass narrowly written tests, but probably won't generalize to the software you want. Tests were not enough. How about integration tests? Regression tests? End-to-end tests? Behavior tests? From Tests to Scenarios and Satisfaction One recurring theme of the agentic moment: we need new language. For example, the word \"test\" has proven insufficient and ambiguous. A test, stored in the codebase, can be lazily rewritten to match the code. The code could be rewritten to trivially pass the test. We repurposed the word scenario to represent an end-to-end \"user story\", often stored outside the codebase (similar to a \"holdout\" set in model training), which could be intuitively understood and flexibly validated by an LLM. Synthetic scenario curation and shaping interface Because much of the software we grow itself has an agentic component, we transitioned from boolean definitions of success (\"the test suite is green\") to a probabilistic and empirical one. We use the term satisfaction to quantify this validation: of all the observed trajectories through all the scenarios, what fraction of them likely satisfy the user? Validating Scenarios in the Digital Twin Universe In previous regimes, a team might rely on integration tests, regression tests, UI automation to answer \"is it working?\" We noticed two limitations of previously reliable techniques: Tests are too rigid - we were coding with agents, but we're also building with LLMs and agent loops as design primitives; evaluating success often required LLM-as-judge Tests can be reward hacked - we needed validation that was less vulnerable to the model cheating The Digital Twin Universe is our answer: behavioral clones of the third-party services our software depends on. We built twins of Okta, Jira, Slack, Google Docs, Google Drive, and Google Sheets, replicating their APIs, edge cases, and observable behaviors. With the DTU, we can validate at volumes and rates far exceeding production limits. We can test failure modes that would be dangerous or impossible against live services. We can run thousands of scenarios per hour without hitting rate limits, triggering abuse detection, or accumulating API costs. Digital Twin Universe: behavioral clones of Okta, Jira, Google Docs, Slack, Drive, and Sheets (click to enlarge) Unconventional Economics Our success with DTU illustrates one of the many ways in which the Agentic Moment has profoundly changed the economics of software. Creating a high fidelity clone of a significant SaaS application was always possible, but never economically feasible. Generations of engineers may have wanted a full in-memory replica of their CRM to test against, but self-censored the proposal to build it. They didn't even bring it to their manager, because they knew the answer would be no. Those of us building software factories must practice a deliberate naivete : finding and removing the habits, conventions, and constraints of Software 1.0 . The DTU is our proof that what was unthinkable six months ago is now routine. Read Next Principles : what we believe is true about building software with agents Techniques : repeated patterns for applying those principles Products : tools we use daily and believe others will benefit from Thank you for reading. We wish you the best of luck constructing your own Software Factory.",
      "cover_image_url": "https://factory.strongdm.ai/images/og-image.png"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Anker’s new 45-watt Nano charger has a screen and other upgrades. Here’s what it’s like",
      "url": "https://www.theverge.com/tech/873655/anker-nano-charger-smart-display-45w-folding-prongs",
      "published": "2026-02-07T15:00:00+00:00",
      "summary": "The latest Anker 45-watt Nano charger, announced in January, which remains one of the smallest 45-watt chargers on the market, adds a full color screen displaying an animated character and a smattering of details about the device you're charging. The display is occasionally useful if you like to keep tabs on how much power your [&#8230;]",
      "content_text": "The latest Anker 45-watt Nano charger, announced in January , which remains one of the smallest 45-watt chargers on the market, adds a full color screen displaying an animated character and a smattering of details about the device you’re charging. $30 Anker Nano 45W charger with a built-in screen Read More The display is occasionally useful if you like to keep tabs on how much power your device is drawing, but the screen feels more like a marketing gimmick than a feature most consumers will actually benefit from. But it’s not the only upgrade that makes the charger worth considering. The Nano’s hallmark feature is a roughly 1-inch-wide screen that takes up half of the charger’s glossy front panel. These sorts of screens are typically only found on Anker’s larger multi-port power stations, and are frequently limited in what information they display. Supported devices are identified and briefly named when plugged into the Nano charger. Anker promotes the Nano as “the world’s first smart display charger that knows your iPhone.” When you plug one in, the screen will briefly display your device’s name, then show how much power is being delivered and its battery level. But the charger is limited to Apple hardware and only recognizes a limited number of devices, including iPhone 15 and later models and iPad models from 2020 onward. I tested it with an iPhone 16 Pro and an iPad 10 from 2022, and both were recognized and identified. The Nano also has a three-stage charging system that adjusts the power delivery rate to help prolong battery life. As the device’s charge level increases, power delivery is reduced. The stages are displayed as “fast,” “steady,” and “trickle” alongside the current wattage and an animated blob-like character whose expression often confuses me. Sometimes it’s sleepy, and other times it appears mad, even if that’s not intentional. When only a USB cable is plugged in, the character will occasionally take a swing at a baseball, or turn into a cookie that opens to reveal fortunes like “fun ahead,” which doesn’t mean anything at all. Tapping a touch-sensitive indent next to the Nano’s USB-C port cycles through two additional screens, including a temperature display and one for switching between charging modes, or you can hold it for two seconds to flip the display 180 degrees as needed. The Nano charger has three screens showing charging rates, temperature, and charging modes that can be cycled by tapping its touch-sensitive button. Instead of a touchscreen, the Nano charger has a touch-sensitive button on top (that looks like a dimple) you press to change screens or change modes. The default charging mode is auto (the charger resets to it every time it’s unplugged), and it adjusts the power delivery over time. Care mode reduces the power to help further prolong battery life by keeping your phone cooler. It’s designed for times when you’re not in a hurry to top up your device, such as charging overnight, and it displays the word “gentle” onscreen to remind you to switch to auto mode if you’re in a rush. Pressing the charger’s touch-sensitive button for two seconds flips the screen 180 degrees so you can reposition its USB-C port. It doesn’t just stop working when connected to devices that aren’t officially supported. I tested it with a Kobo e-reader and a Playdate, and instead of identifying either device, the charger jumped straight to the charging status screen, displaying how much power was being delivered without their battery levels. The screen-equipped version of the Nano charger (right) is slightly larger and heavier than the version introduced last year (left). The display’s most useful feature is being able to check your iPhone or iPad’s charge level, but that’s information those devices already show. After a few seconds, the Nano charger’s screen automatically turns off, requiring you to reach over to the outlet with a tap to see the charging progress again. You can’t keep the display on at all times, so if your phone or tablet isn’t on the other side of the room and connected via a 60-foot USB cable, why not just reach for your device to check if it’s charged? The Nano’s display would feel less gimmicky if it offered additional functionality, such as an estimate of how long it will take to fully charge, or an option to automatically switch to care mode overnight. The prongs on the Nano charger can fold flat for travel but also rotate 180 degrees, adding more flexibility for where you can plug it in. The most compelling reason to spend an extra $5 on the new $39.99 Nano charger instead of last year’s $34.99 model is its redesigned folding prongs. They now rotate 180 degrees, so you can plug the charger into an outlet in two different ways to reorient the screen or keep the USB-C port accessible. It’s a simple but clever design change that I wouldn’t be surprised to see Anker incorporate into other smaller chargers in the future. Photography by Andrew Liszewski / The Verge Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Andrew Liszewski Gadgets Hands-on Reviews Tech",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/anker_nano6.jpg?quality=90&strip=all&crop=0%2C10.740836125969%2C100%2C78.518327748063&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Stories From 25 Years of Software Development",
      "url": "https://susam.net/twenty-five-years-of-computing.html",
      "published": "2026-02-07T14:42:16+00:00",
      "summary": "<p>Article URL: <a href=\"https://susam.net/twenty-five-years-of-computing.html\">https://susam.net/twenty-five-years-of-computing.html</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46924264\">https://news.ycombinator.com/item?id=46924264</a></p> <p>Points: 142</p> <p># Comments: 16</p>",
      "content_text": "Stories From 25 Years of Software Development By Susam Pal on 06 Feb 2026 Last year, I completed 20 years in professional software development. I wanted to write a post to mark the occasion back then, but couldn't find the time. This post is my attempt to make up for that omission. In fact, I have been involved in software development for a little longer than 20 years. Although I had my first taste of computer programming as a child, it was only when I entered university about 25 years ago that I seriously got into software development. So I'll start my stories from there. These stories are less about software and more about people. Unlike many posts of this kind, this one offers no wisdom or lessons. It only offers a collection of stories. I hope you'll like at least a few of them. Contents Viewing the Source The first story takes place in 2001, shortly after I joined university. One evening, I went to the university computer laboratory to browse the Web. Out of curiosity, I typed susam.com into the address bar and landed on its home page . I remember the text and banner looking much larger back then. Display resolutions were lower, so they covered almost half the screen. I knew very little about the Internet then and I was just trying to make sense of it. I remember wondering what it would take to create my own website, perhaps at susam.com . That's when an older student who had been watching me browse over my shoulder approached and asked if I had created the website. I told him I hadn't and that I had no idea how websites were made. He asked me to move aside, took my seat and clicked View > Source in Internet Explorer. He then explained how websites are made of HTML pages and how those pages are simply text instructions. Next, he opened Notepad and wrote a simple HTML page that looked something like this: <BODY><FONT COLOR=\"RED\">HELLO</FONT></BODY> Yes, we had a FONT tag back then and it was common practice to write HTML tags in uppercase. He then opened the page in a web browser and showed how it rendered. After that, he demonstrated a few more features such as changing the font face and size, centring the text and altering the page's background colour. Although the tutorial lasted only about ten minutes, it made the World Wide Web feel far less mysterious and much more fascinating. That person had an ulterior motive though. After the tutorial, he never returned the seat to me. He just continued browsing the Web and waited for me to leave. I was too timid to ask for my seat back. Seats were limited, so I returned to my dorm room both disappointed that I couldn't continue browsing that day and excited about all the websites I might create with this newfound knowledge. I could never register susam.com for myself though. That domain was always used by some business selling Turkish cuisines. Eventually, I managed to get the next best thing: a .net domain of my own. That brief encounter in the university laboratory set me on a lifelong path of creating and maintaining personal websites. The Reset Vector The second story also comes from my university days. One afternoon, I was hanging out with my mates in the computer laboratory. In front of me was an MS-DOS machine powered by an Intel 8086 microprocessor, on which I was writing a lift control program in assembly. In those days, it was considered important to deliberately practise solving made-up problems as a way of honing our programming skills. As I worked on my program, my mind drifted to a small detail about the 8086 microprocessor that we had recently learnt in a lecture. Our professor had explained that, when the 8086 microprocessor is reset, execution begins with CS:IP set to FFFF:0000. So I murmured to anyone who cared to listen, 'I wonder if the system will reboot if I jump to FFFF:0000.' I then opened DEBUG.EXE and jumped to that address. C:\\> DEBUG - G =FFFF:0000 The machine rebooted instantly. One of my friends, who topped the class every semester, had been watching over my shoulder. As soon as the machine restarted, he exclaimed, 'How did you do that?' I explained that the reset vector is located at physical address FFFF0 and that the CS:IP value FFFF:0000 maps to that address in real mode. After that, I went back to working on my lift control program and didn't think much more about the incident. About a week later, the same friend came to my dorm room. He sat down with a grave look on his face and asked, 'How did you know to do that? How did it occur to you to jump to the reset vector?' I must have said something like, 'It just occurred to me. I remembered that detail from the lecture and wanted to try it out.' He then said, 'I want to be able to think like that. I come top of the class every semester, but I don't think the way you do. I would never have thought of taking a small detail like that and testing it myself.' I replied that I was just curious to see whether what we had learnt actually worked in practice. He responded, 'And that's exactly it. It would never occur to me to try something like that. I feel disappointed that I keep coming top of the class, yet I am not curious in the same way you are. I've decided I don't want to top the class anymore. I just want to explore and experiment with what we learn, the way you do.' That was all he said before getting up and heading back to his dorm room. I didn't take it very seriously at the time. I couldn't imagine why someone would willingly give up the accomplishment of coming first every year. But he kept his word. He never topped the class again. He still ranked highly, often within the top ten, but he kept his promise of never finishing first again. To this day, I feel a mix of embarrassment and pride whenever I recall that incident. With a single jump to the processor's reset entry point, I had somehow inspired someone to step back from academic competition in order to have more fun with learning. Of course, there is no reason one cannot do both. But in the end, that was his decision, not mine. Man in the Middle In my first job after university, I was assigned to a technical support team where part of my work involved running an installer to deploy a specific component of an e-banking product for customers, usually large banks. As I learnt to use the installer, I realised how fragile it was. The installer, written in Python, often failed because of incorrect assumptions about the target environment and almost always required some manual intervention to complete successfully. During my first week on the project, I spent much of my time stabilising the installer and writing a step-by-step user guide explaining how to use it. The result was well received by both my seniors and management. To my surprise, the user guide received more praise than the improvements I made to the installer itself. While the first few weeks were productive, I soon realised I would not find the work fulfilling for long. I wrote to management a few times to ask whether I could transfer to a team where I could work on something more substantial. My emails were initially met with resistance. After several rounds of discussion, however, someone who had heard about my situation reached out and suggested a team whose manager might be interested in interviewing me. The team was based in a different city. I was young and willing to relocate wherever I could find good work, so I immediately agreed to the interview. This was in 2006, when video conferencing was not yet common. On the day of the interview, the hiring manager called me on my office desk phone. He began by introducing the team, which was called Archie , short for architecture . The team developed and maintained the web framework and core architectural components on which the entire e-banking product was built. The product had existed long before open source frameworks such as Spring or Django came into existence, so features such as API routing, authentication and authorisation layers, cookie management, etc. were all implemented in-house as Java Servlets and JavaServer Pages (JSP). Since the software was used in banking environments, it also had to pass strict security testing and regular audits to minimise the risk of serious flaws. The interview began well. He asked several questions related to software security, such as what SQL injection is and how it can be prevented or how one might design a web framework that mitigates cross-site scripting attacks. He also asked programming questions, most of which I answered pretty well. Towards the end, however, he asked how we could prevent MITM attacks. I had never heard the term, so I admitted that I did not know what MITM meant. He then asked, 'Man in the middle?' but I still had no idea what that meant or whether it was even a software engineering concept. He replied, 'Learn everything you can about PKI and MITM. We need to build a digital signatures feature for one of our corporate banking products. That's the first thing we'll work on.' Over the next few weeks, I studied RFCs and documentation related to public key infrastructure, public key cryptography standards and related topics. At first, the material felt intimidating, but after spending time each evening reading whatever relevant literature I could find, things gradually began to make sense. Concepts that initially seemed complex and overwhelming eventually felt intuitive and elegant. I relocated to the new city a few weeks later and delivered the digital signatures feature about a month after joining the team. We used the open source Bouncy Castle library to implement the feature. After that project, I worked on other parts of the product too. The most rewarding part was knowing that the code I was writing became part of a mature product used by hundreds of banks and millions of users. It was especially satisfying to see the work pass security testing and audits and be considered ready for release. That was my first real engineering job. My manager also turned out to be an excellent mentor. Working with him helped me develop new skills and his encouragement gave me confidence that stayed with me for years. Nearly two decades have passed since then, yet the product is still in service and continues to be actively developed. In fact, in my current phase of life I sometimes encounter it as a customer. Occasionally, I open the browser's developer tools to view the page source where I can still see traces of the HTML generated by code I wrote almost twenty years ago. Sphagetti Code Around 2007 or 2008, I began working on a proof of concept for developing widgets for an OpenTV set-top box. The work involved writing code in a heavily trimmed-down version of C. One afternoon, while making good progress on a few widgets, I noticed that they would occasionally crash at random. I tried tracking down the bugs, but I was finding it surprisingly difficult to understand my own code. I had managed to produce some truly spaghetti code full of dubious pointer operations that were almost certainly responsible for the crashes, yet I could not pinpoint where exactly things were going wrong. Ours was a small team of four people, each working on an independent proof of concept. The most senior person on the team acted as our lead and architect. Later that afternoon, I showed him my progress and explained that I was still trying to hunt down the bugs causing the widgets to crash. He asked whether he could look at the code. After going through it briefly and probably realising that it was a bit of a mess, he asked me to send him the code as a tarball, which I promptly did. He then went back to his desk to study the code. I remember thinking that there was no way he was going to find the problem anytime soon. I had been debugging it for hours and barely understood what I had written myself; it was the worst spaghetti code I had ever produced. With little hope of a quick solution, I went back to debugging on my own. Barely five minutes later, he came back to my desk and asked me to open a specific file. He then showed me exactly where the pointer bug was. It had taken him only a few minutes not only to read my tangled code but also to understand it well enough to identify the fault and point it out. As soon as I fixed that line, the crashes disappeared. I was genuinely in awe of his skill. I have always loved computing and programming, so I had assumed I was already fairly good at it. That incident, however, made me realise how much further I still had to go before I could consider myself a good software developer. I did improve significantly in the years that followed and today I am far better at managing software complexity than I was back then. In another project from that period, we worked on another set-top box platform that supported Java Micro Edition (Java ME) for widget development. One day, the same architect from the previous story asked whether I could add animations to the widgets. I told him that I believed it should be possible, though I'd need to test it to be sure. Before continuing with the story, I need to explain how the different stakeholders in the project were organised. Our small team effectively played the role of the software vendor. The final product going to market would carry the brand of a major telecom carrier, offering direct-to-home (DTH) television services, with the set-top box being one of the products sold to customers. The set-top box was manufactured by another company. So the project was a partnership between three parties: our company as the software vendor, the telecom carrier and the set-top box manufacturer. The telecom carrier wanted to know whether widgets could be animated on screen with smooth slide-in and slide-out effects. That was why the architect approached me to ask whether it could be done. I began working on animating the widgets. Meanwhile, the architect and a few senior colleagues attended a business meeting with all the partners present. During the meeting, he explained that we were evaluating whether widget animations could be supported. The set-top box manufacturer immediately dismissed the idea, saying, 'That's impossible. Our set-top box does not support animation.' When the architect returned and shared this with us, I replied, 'I do not understand. If I can draw a widget, I can animate it too. All it takes is clearing the widget and redrawing it at slightly different positions repeatedly. In fact, I already have a working version.' I then showed a demo of the animated widgets running on the emulator. The following week, the architect attended another partners' meeting where he shared updates about our animated widgets. I was not personally present, so what follows is second-hand information passed on by those who were there. I learnt that the set-top box company reacted angrily. For some reason, they were unhappy that we had managed to achieve results using their set-top box and APIs that they had officially described as impossible. They demanded that we stop work on animation immediately, arguing that our work could not be allowed to contradict their official position. At that point, the telecom carrier's representative intervened and bluntly told the set-top box representative to just shut up. If the set-top box guy was furious, the telecom guy was even more so, 'You guys told us animation was not possible and these people are showing that it is! You manufacture the set-top box. How can you not know what it is capable of?' Meanwhile, I continued working on the proof of concept. It worked very well in the emulator, but I did not yet have access to the actual hardware. The device was still in the process of being shipped to us, so all my early proof-of-concepts ran on the emulator. The following week, the architect planned to travel to the set-top box company's office to test my widgets on the real hardware. At the time, I was quite proud of demonstrating results that even the hardware maker beli",
      "cover_image_url": "files/blog/ctf-2019.png"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Cairn is a climbing journey about perseverance and obsession",
      "url": "https://www.theverge.com/games/874914/cairn-review-pc-playstation-5",
      "published": "2026-02-07T14:00:00+00:00",
      "summary": "I'm an awful rock climber. Being scared of heights probably doesn't help. But when I've tried it, I've loved the slow, methodical work of moving from one ledge to the next. It reminds me a lot of why I love running; in both sports, you achieve goals that seem insurmountable by taking them one step [&#8230;]",
      "content_text": "I’m an awful rock climber. Being scared of heights probably doesn’t help. But when I’ve tried it, I’ve loved the slow, methodical work of moving from one ledge to the next. It reminds me a lot of why I love running; in both sports, you achieve goals that seem insurmountable by taking them one step at a time. Cairn , a new game from The Game Bakers, is one of the few games I’ve played that truly captures that feeling. You play as Aava, a famous climber obsessed with summiting a mountain called Kami. You climb by moving all four of Aava’s limbs, one by one, to find safe cracks, bumps, and ledges to let you inch your way higher, all while managing tools and resources carried in your backpack. Climbing games are becoming something of a trend, but Cairn is different from Jusant , where you just control the character’s hands, or Baby Steps , a sillier game where you just control the character’s feet. It’s been a decade since my short-lived membership at a rock-climbing gym, but Cairn ’s mechanics brought back all sorts of memories of my time scaling the walls, especially the importance of good footwork. Based on my amateur experience, it’s a great rock-climbing simulator. By setting spikes into the walls, you can make spots where your rope will catch you if you slip off the mountain face. A robot companion picks up the spikes when you reach safety so you can use them again. By using chalk, you get a temporary boost to your grip. With food and drink, you’ll help keep yourself fed, hydrated, and warm. Progress can be grueling. I was almost always on edge as I methodically searched for the next place to put Aava’s hand or foot. Slipping comes at a cost; you’ll fall to your last spike or to the ground, and depending on how far down those are, it could mean another long climb, hitting yourself against the wall, or, in the worst case, death. Rain, wind, snow, and ice make things even more difficult. But it’s also peaceful, in a way. I was incredibly focused while playing, and more than once, I caught myself holding my Steam Deck right up to my nose as I hunted for the next step of my climb. I was often completely in the zone. As I journeyed, I even started to internalize Aava’s quest as my own. When she quipped about a good grip, I would be elated that I had a brief moment of safety. When she was precariously close to falling, her breath would speed up in panic, and my stress levels would spike, too. When she would fall, she often shouted in frustration, usually mirroring how I felt about the situation. Aava will meet other people during her journey and hear from people who care for her, and they provide companionship during what’s largely a solo quest. But sometimes, she’s also rude to them or will alienate and ignore those who care for her. Aava even takes out her anger on her robot buddy. Still, I could relate. Like Aava, I also just wanted to climb the damn mountain, and usually, I didn’t want anything to get in my way. I am predisposed to like Cairn : I love long runs, and to me, there are fewer things more satisfying than the feeling of overcoming a seemingly insurmountable obstacle one step at a time. I’ve fallen out of running lately, and I’ve missed it. Cairn reminded me what’s possible when you focus just on the next thing in front of you — and of the complex feelings that come with persevering through the quest. Cairn is available now for PC and PS5. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Jay Peters Entertainment Games Review Gaming",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/ss_827a05c5af0d469f5e27bbd4e5b298be244f7fb4.1920x1080.jpg?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "Target Darts Omni Auto Scoring System Hits the Mark",
      "url": "https://www.wired.com/story/target-darts-omni-auto-scoring-system-rave/",
      "published": "2026-02-07T14:00:00+00:00",
      "summary": "Step up to the oche and hit the bull’s-eye with this automatic darts scoring system for online play.",
      "content_text": "I never liked playing darts, but I did a complete 180 with this auto-scoring system. This gadget has ignited my newfound love of the old pub favorite. It’s a light ring with four hi-def cameras that slots onto your board. Connect with the DartCounter app via Wi-Fi and you get effortless automatic scoring with an announcer calling your points and telling you what you need to check out. I’ve been testing the Target Darts Omni Auto Scoring System for the last few weeks, playing locally on my own and with family, and playing the odd match online. It’s a pricey system, but for darts fans and players looking to improve their game, it could be worth the investment. As a casual fan, I've found that a wee game of darts is a great way to unwind at the end of your day. Stepping Up to the Oche Target Darts Omni Auto Scoring System The Target Darts Omni Auto Scoring System pairs with the DartCounter app ( Android or iOS ). It’s quick and easy to put together, attaching to your board via magnetic legs, but you will need to run the power cable to an outlet. Connect to Wi-Fi, run a short calibration, and it’s time to play. I tested with Target’s Star Wars Millennium Falcon Surround and Dartboard ($200 or £150 ) and a set of Darth Vader Darts ($340 or £250 )—both amazing Star Wars gifts for the fan in your life—but it should work with most boards and any darts. The LED ring lights up the dartboard beautifully. The four HD cameras accurately record the score for each dart thrown. The DartCounter app compiles comprehensive statistics on your play. You can configure all the match parameters in the app for a tailor-made session, and there are also multiple practice modes and games, such as Around the Clock, where you have to hit each number in sequence and then the bull’s-eye, and Bob’s 27, where you start with 27 points and have to hit the doubles shown. Online multiplayer is perhaps the biggest selling point, and you can find matches or create your own lobby in the DartCounter app. I never had any trouble finding a match, and there were well over 100 live matches in progress every time I checked. You get three free online matches every week. To unlock all the features, including tournaments, unlimited online games, more detailed stats, and the Master Caller using your name, you must subscribe for $6 a month or $40 a year (£6 and £40 in the UK). You get a three-month free trial with the system. Local play is free, with the exception of a couple of games (121 Checkout and Halve It), so you don’t need to subscribe. I’ve played loads of games over the past few weeks, but I had the most fun playing a tournament with my brother. We had a dartboard in the garage when I was a teen and spent hours throwing darts, but neither of us had played in years. After much hilarity at how inept we had become and plenty of reminiscing, we both got our eye in, and things became competitive. I won the best-of-five classic 501 matches, but then my brother beat me at Around the Clock (I got stuck on the bull’s-eye).",
      "cover_image_url": "https://media.wired.com/photos/6986615f5841b2ac3d4d7a88/191:100/w_1280,c_limit/Target%20Darts%20Omni%20Auto%20Scoring%20System%201%20SOURCE%20Simon%20Hill.png"
    }
  ]
}