{
  "industry": "technology",
  "collected_at": "2026-02-27T04:54:15.886170+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "The Hunt for Dark Breakfast",
      "url": "https://moultano.wordpress.com/2026/02/22/the-hunt-for-dark-breakfast/",
      "published": "2026-02-27T03:49:48+00:00",
      "summary": "<p>Article URL: <a href=\"https://moultano.wordpress.com/2026/02/22/the-hunt-for-dark-breakfast/\">https://moultano.wordpress.com/2026/02/22/the-hunt-for-dark-breakfast/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47176257\">https://news.ycombinator.com/item?id=47176257</a></p> <p>Points: 52</p> <p># Comments: 18</p>",
      "content_text": "It started with a flash of insight like a thunderbolt in a snow storm, the sort of insight that can only be induced by high altitude hypoxia and making breakfast. “Breakfast is a vector space. You can place pancakes, crepes, and scrambled eggs on a simplex where the variables are the ratios between milk, eggs, and flour. We have explored too little of this manifold. More breakfasts can exist than we have known.” Like all such hypoxia-addled-brain thoughts, it was a successful tweet . I stood in the kitchen paralyzed by indecision. The mixing bowl was in front of me, the milk, eggs, and flour next to it, all of them individually as familiar as they had been a moment before, but now the possibilities for their combination were just too great. Breakfast was now an alien fractal intruding on our world like the lighthouse at the end of Annihilation . The thoughts came unbidden. “In the manifold of breakfast, are there empty subspaces? Might there be breakfasts that no one has ever had? With a theoretical model of breakfast, can we derive the existence of ‘dark breakfasts,’ breakfasts that we know must exist, but have never observed?” The curtain of reality had pulled back for me, and I could no longer pretend to be ignorant of these eldritch possibilities. I furiously began to map the known breakfasts. If the dark breakfast exists, I must be able to find it in the interstices of the normal familiar world. First I mapped all that I could recall from memory, pancakes, crepes, waffles, scrambled eggs, popovers, omelettes, and on and on, scouring my brain for every fast I had ever broken. The beginnings of the contours of breakfast began to reveal themselves. A gaping hole stared back at me, but I couldn’t yet be sure. I had to search the dark corners of the world to see if somewhere in far off lands that abyss had yet been filled. I called upon friendly ghosts . I paged through ancient tomes . I added kaiserschmarrn, swedish pancakes, dan bing, madeleines, crumpets, clafoutis, blinis, pannu kakku, parathas, nalesniki. The map filled in bit by bit, but it was no use. The gap in the fabric of breakfast remained. I searched for benign explanations. Could it be that milk is simply too heavy, and that by including the weight of the water content that boils off I am tilting the simplex too far in its direction? Could it be that by excluding slices of bread as ingredients since they aren’t raw flour and do not go in a mixing bowl, I have excluded breakfasts like french toast, eggs in a basket, breakfast burritos, and breakfast sandwiches that might yet have saved us? Could I have overlooked some arcane culture that breaks their fast with dumplings or egg noodles? None of these satisfied me. The Abyss stared back. The breakfasts I was able to identify cluster into three major regions: The Pancake Local Group: Here are found most of the conventional breakfasts, pancakes, crepes, waffles, and all of their international variants. Space here is chaotic, fractal. Any slight deviation from your recipe in this region is likely to produce something else entirely. Breakfast here is metastable at best. ( prior research on the pancake cluster ) The Baked Good Quadrant: The items here are only breakfasts by convention. Any of them could be served at other meals, and often are. The Egg Singularity and Custard Accretion Disk: While only omelettes are labelled for brevity, there are dozens of named dishes that could be stacked on top of the pure egg point, over easy, sunny side up, hard boiled, soft boiled, etc. From these a small tail of egg based dishes sneaks down the right side, each with some amount of milk added, often a variable or optional amount. I was days into my research before I finally found a clue. In an obscure document on the website of the International House of Pancakes Corporation there was a hint that the dark breakfast had been made. IHOP omelettes include pancake batter. While I cannot place IHOP omelettes exactly on the map, by interpolating between pancakes and omelettes, we can bound where they must occur, and confirm that the manifold possibilities do indeed pass through the Dark Breakfast Abyss. We do not know why the Dark Breakfast Abyss is empty. But by anthropic reasoning, we should conclude that it is empty for good reason. The International House of Pancakes is playing a dangerous game. If someday a remote IHOP splashes a little too much batter in their omelette, cooks the Forbidden Breakfast, and thereby brings about the end of the world, well, at least we know the Waffle House will be open . For other breakfast scholars who wish to further my study, I offer my data and code . If you are so foolhardy that you wish to explore the bounds of dark breakfast yourself, the recipe is as follows: Dark Breakfast Ingredients: ¼ cup Milk 4 Eggs ½ cup Flour Instructions : Unknown The most merciful thing in the world, I think, is the inability of the human mind to correlate all its contents. We live on a placid island of ignorance in the midst of black seas of infinity, and it was not meant that we should voyage far. The sciences, each straining in its own direction, have hitherto harmed us little; but some day the piecing together of dissociated knowledge will open up such terrifying vistas of reality, and of our frightful position therein, that we shall either go mad from the revelation or flee from the deadly light into the peace and safety of a new dark age. H.P. Lovecraft – The Call of Cthulhu",
      "cover_image_url": "https://moultano.wordpress.com/wp-content/uploads/2026/02/breakfast_simplex-4.png"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "GitHub - Frikallo/parakeet.cpp: Ultra fast and portable Parakeet implementation for on-device inference in C++ using Axiom with MPS+Unified Memory and Cuda support",
      "url": "https://github.com/Frikallo/parakeet.cpp",
      "published": "2026-02-27T03:48:05+00:00",
      "summary": "<p>Article URL: <a href=\"https://github.com/Frikallo/parakeet.cpp\">https://github.com/Frikallo/parakeet.cpp</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47176239\">https://news.ycombinator.com/item?id=47176239</a></p> <p>Points: 10</p> <p># Comments: 2</p>",
      "content_text": "You can’t perform that action at this time.",
      "cover_image_url": "https://opengraph.githubassets.com/c6c10d95ae0b4893b7d5057e37ecb2f9e8a4143f3f45582a6f71cdb0ef548811/Frikallo/parakeet.cpp"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "A Nationwide Book Ban Bill Has Been Introduced in the House of Representatives",
      "url": "https://bookriot.com/hr7661-book-ban-legislation/",
      "published": "2026-02-27T03:34:12+00:00",
      "summary": "<p>Article URL: <a href=\"https://bookriot.com/hr7661-book-ban-legislation/\">https://bookriot.com/hr7661-book-ban-legislation/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47176157\">https://news.ycombinator.com/item?id=47176157</a></p> <p>Points: 37</p> <p># Comments: 5</p>",
      "content_text": "Following this week’s State of the Union Address, House Republicans worked quickly to advance legislation to ban books from public schools nationwide. House Resolution 7661 (H.R. 7661), also known as the “Stop the Sexualization of Children Act” would modify the Elementary and Secondary Education Act of 1965 by prohibiting use of funds under the act “to develop, implement, facilitate, host, or promote any program or activity for, or to provide or promote literature or other materials to, children under the age of 18 that includes sexually oriented material, and for other purposes.” The bill was introduced by House Representative Mary Miller (Republican, Illinois). 17 additional Representatives cosigned it. H.R. 7661 is an anti-trans bill, and tucked within its provisions are those that ban books for those under 18 that “include sexually oriented material.” This is the same vague language used in numerous states across the U.S. to ban books from public schools and public libraries. This bill includes “lewd” and “lascivious” dancing as prohibited topics or themes. No such books for young readers exist, but facts don’t matter to a regime seeking total and complete control. The bill goes on to further define “sexually oriented material” as anything broaching the topics of “gender dysphoria or transgenderism.” The latter is an intentionally harmful word used as a cudgel to harm trans people. Such a broad definition also ensures that this kind of bill could be applicable in any situation where it would benefit the banners. It isn’t a stretch to see a bill like this used to outright ban all books by or about LGBTQ+ people under the guise of it being “sexually oriented.” Though this legislation would apply to institutions using funds from the Elementary and Secondary Education Act of 1965, there’s little question that it would expand to include all public libraries, not just those in public schools. We’ve already seen this very thing play out across the country. Literary Activism News you can use plus tips and tools for the fight against censorship and other bookish activism! Subscribe to Selected No Thanks Katy Independent School District (TX) banned any books about “gender fluidity” among its bans of “sexually explicit materials.” Just last month, the Texas school district outside Houston banned over 140 LGBTQ+ books under the policy. Greenville Public Library (SC) has banned all books for those under 18 with “trans” themes or topics, a ban later replicated and expanded in York County Library to include “gender identity” books (also in South Carolina). Greenville’s library was sued by the state’s chapter of the ACLU on behalf of several library patrons. These local-level policies, alongside state-level policies like Iowa’s Senate File 496 and Idaho’s House Bill 710 –both still working their way through numerous lawsuits–provided the roadmap for the proposal of federal-level book ban legislation. It was only a matter of time, and the ongoing onslaught of anti-trans legislation and rhetoric that has grown exponentially under the Trump-Vance regime made this the prime moment. Discussion of gender is not sexualization. Making books available to students that represent the diversity of their experiences and showcase the numerous ways to be a person in the world is not sexualizing them. Such an interpretation says far more about the adults and the perspectives they’re applying to books than it does about the books or their intended audiences. You can read the full text of H.R. 7661 here , including its list of cosponsors. Right now, your best way to have your voice heard about this hateful and discriminatory bill is to call your House representatives and urge them to veto this bill at every opportunity. There are years’ worth of resources from which you can pull about where and how all of these bills are calculated and targeted, and you can pull from the numerous ongoing lawsuits challenging similar bills and policies at the local and state level. Let your lawmakers know that you’re watching them and their voting records, especially if they’re among the roster of those proposing the legislation. These bills aren’t about removing books; books are just one of the tools. These bills are about the complete and total erasure and removal of queer people from American life.",
      "cover_image_url": "https://s2982.pcdn.co/wp-content/uploads/2026/02/house-of-representatives-image.jpg.optimal.jpg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Google Workers Seek 'Red Lines' on Military A.I., Echoing Anthropic",
      "url": "https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html",
      "published": "2026-02-27T03:08:09+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html\">https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47175931\">https://news.ycombinator.com/item?id=47175931</a></p> <p>Points: 122</p> <p># Comments: 45</p>",
      "content_text": "<p>Article URL: <a href=\"https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html\">https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47175931\">https://news.ycombinator.com/item?id=47175931</a></p> <p>Points: 122</p> <p># Comments: 45</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Founding Reliability & Performance Engineer",
      "url": "https://www.ycombinator.com/companies/litellm/jobs/unlCynJ-founding-reliability-performance-engineer",
      "published": "2026-02-27T01:18:18+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.ycombinator.com/companies/litellm/jobs/unlCynJ-founding-reliability-performance-engineer\">https://www.ycombinator.com/companies/litellm/jobs/unlCynJ-founding-reliability-performance-engineer</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47175013\">https://news.ycombinator.com/item?id=47175013</a></p> <p>Points: 0</p> <p># Comments: 0</p>",
      "content_text": "TLDR LiteLLM is an open-source AI gateway (36K+ GitHub stars) that routes hundreds of millions of LLM API calls daily for companies like NASA, Adobe, Netflix, Stripe, and Nvidia. We're at $7M ARR, 10 people, YC W23. When LiteLLM goes down, our customers' entire AI stack goes down. We need someone who makes sure that doesn't happen. You'd be the first dedicated reliability hire. You'll own reliability, performance, and production stability end-to-end. Nobody will tell you how to do it What this job actually is We'll be straight with you: this role is roughly 60% operational reliability and 40% deep performance engineering. On any given week you might be: Hunting a memory leak in our async streaming handler that causes OOMs after 4 hours under load Fixing a race condition where PodLockManager releases another pod's lock Profiling why update_database() does 7 deep copies per request in the spend tracking hot path Helping a Fortune 500 customer debug why their 20-pod deployment is exhausting Postgres connections Building soak tests that catch degradation before a release goes out Reviewing a PR that touches the request hot path and saying \"this will add 50ms at P99, here's why\" If you're looking for a pure optimization role where you sit in a profiler all day — this isn't it. If you want to own production health for one of the most widely deployed AI infrastructure projects in the world — keep reading. Why this matters We route traffic for some of the largest AI deployments on the planet. One customer is scaling from 20M to 200M daily AI calls through our gateway. Another has 150K users hitting us daily. When we ship a bad release, it doesn't just break a dashboard — it breaks production AI systems at companies you've heard of. The problems here are genuinely hard: Memory management in long-running Python async services — our proxy handles thousands of concurrent streaming connections. HTTP client sessions, response iterators, and background tasks all need careful lifecycle management. Database at scale — spend logging, auth, and rate limiting all interact with Postgres. At 100K+ requests/day, naive patterns fall apart. 100+ provider surface area — we translate between OpenAI, Anthropic, Bedrock, Vertex, and 100+ other APIs. Each has unique streaming behavior. A refactor that fixes one provider can break three others. You won't run out of interesting problems. What you'll own Production reliability On-call for critical issues (shared rotation with the team, not solo) Incident response and blameless post-mortems Customer escalation support for enterprise deployments Making the proxy self-healing when DB/Redis is temporarily unavailable Performance engineering Memory leak detection and prevention (soak tests, CI integration) Hot path optimization — our target is <10ms overhead at 5K+ RPS P50/P95/P99 latency benchmarks that block releases on regression Profiling and fixing bottlenecks (Pydantic validation, connection pools, async task scheduling) Observability & release safety Structured logging, distributed tracing, correlation IDs Prometheus metrics that are actually accurate and actionable Building toward canary deployments and automated rollback SLO definition and tracking for enterprise customers Who you are Must have: 2+ years of experience running Python services in production, with real exposure to debugging things that break at scale Strong understanding of Python async internals — asyncio event loop, aiohttp/httpx session management, connection pooling Experience debugging production memory leaks, OOMs, or latency degradation (bonus if you've used memray, py-spy, or tracemalloc) Solid PostgreSQL knowledge — connection pool tuning, query optimization, understanding how DB operations on the request path degrade under load Comfort with Kubernetes at an operational level — pod lifecycle, resource limits, health probes You've been on-call before and you didn't hate it Strong signals: You've worked on a proxy, API gateway, load balancer, or middleware service where overhead itself is what you optimize You've worked at Meta (Production Engineering), Cloudflare, Fastly, Datadog, Stripe, or a similar infrastructure company You've been an early reliability/infra hire at a startup and built production practices from scratch You've contributed to open-source infrastructure projects You understand HTTP/2, streaming responses (SSE), and how async Python handles them under concurrency Why LiteLLM Scale & impact : Your work is in the critical path for hundreds of millions of AI API calls daily. NASA, Netflix, Adobe, Stripe depend on this. Open source visibility : 36K GitHub stars. Your contributions are visible to the entire AI infrastructure community. Your GitHub profile will look incredible. Ownership : First dedicated reliability hire. You define what reliability means here. No bureaucracy, no tickets — you see a problem, you fix it. Trajectory : $7M ARR growing fast, 10-person team, YC W23. Meaningful equity at a stage where it can matter.",
      "cover_image_url": "https://bookface-images.s3.amazonaws.com/logos/d7ce0a49202038373852e1b840f81ae7a8d90a5c.png?1741382512"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "The Latest Repair Battlefield Is the Iowa Farmlands-Again",
      "url": "https://www.wired.com/story/latest-repair-battlefield-iowa-farmlands-again/",
      "published": "2026-02-27T01:05:41+00:00",
      "summary": "A new bill that would give farmers in Iowa the right to repair is a big threat to tractor manufacturer John Deere.",
      "content_text": "Iowa lawmakers voted to advance state House bill 751 last week, legislation that would ensure farmers in the state can freely repair their own agricultural equipment, like tractors. This Tuesday, the bill was renamed to House File 2709 , and it will be voted on again. Should the political winds align, it will go through the Iowa House and Senate before the Iowa Legislature adjourns on April 21. The bill is the first of nearly 57 state bills supported by repair advocates across the country in 2026. Many of them focus on farm equipment in states like Oklahoma , Wyoming , Delaware , and West Virginia . Repair advocates hope a win in Iowa—the second-highest-grossing state in the US for agricultural products, behind California—will help further legislative and broader efforts to make phones, cars, and other devices more repairable. “This isn't just a blue state thing; this isn't just a Colorado activist thing,” says Elizabeth Chamberlain , director of sustainability for the right-to-repair advocate arm of iFixit . “Its real. Farmers have trouble repairing their equipment and want change.” Farmers and their tractors have long been a focal point of the right-to-repair movement, the ever-growing global effort to let product owners fix their own devices and equipment without manufacturer approval. Farmers who use tractors to plant, cultivate, and harvest crops often need to repair their equipment while they work. Waiting for manufacturer approval to get something fixed, or taking the time to bring the equipment to an approved dealership, can cause delays, frustration, and missed opportunities to harvest crops. The Iowa bill defines which agricultural equipment it covers, including tractors, trailers, combines, sprayers, balers, and other equipment used to cultivate and harvest crops. It excludes aircraft and irrigation equipment, along with jet skis and snowmobiles. Manufacturers would also be required to provide owners with data—documentation, like manuals, and access to embedded operating software—on their tractors, including future patches and fixes, all without charging for it or requiring authorization for internet access. The bill also limits the use of digital locks—software restrictions that prevent accessing features without manufacturer approval. Oh Deere The most prominent opposition to the Iowa bill is tractor manufacturer John Deere, which has a long history of opposing repair efforts and frustrating farmers who want to take more control of their equipment. The company is still fighting a lawsuit the US Federal Trade Commission levied against John Deere in January 2025 for “unlawful” repairability policies. The company has lobbied against the Iowa bill and outright opposes its passing. “John Deere is steadfast in supporting farmers' ability to repair their equipment,” wrote a John Deere representative in a statement responding to WIRED’s inquiry. “And we back that up by offering industry-leading self-repair tools and resources to both equipment owners and alternative service providers.” John Deere points to its online repair hub that catalogs ways its product owners can repair their products. Chamberlain says it is true that John Deere offers self-repair options, but they are not always in line with the reality of what farmers need to make fixes in the moment. “Ultimately, it doesn’t matter if the vast majority of repairs are possible if there’s a repair that takes your equipment down and that means loss of harvest or having to wait weeks for a dealer representative to come out,” Chamberlain says. John Deere has said it supports third-party and self-repair of its equipment before. In 2023, John Deere and the American Farm Bureau agreed to a memorandum of understanding about how the company would allow access to repairs on its products in response to repair laws passing in states like Colorado. But repair advocates criticized the move , saying the memorandum did little to make John Deere adhere to new regulations.",
      "cover_image_url": "https://media.wired.com/photos/69a0d9524a77d405a11503a1/191:100/w_1280,c_limit/Latest-Repair-Battlefield-is-Iowa-Farmlands-Again-Gear-2192165992.jpg"
    },
    {
      "industry": "technology",
      "source": "VentureBeat",
      "title": "Jack Dorsey's Block cuts 40% of staff, 4,000+ people — and yes, it's because of AI efficiencies",
      "url": "https://venturebeat.com/orchestration/jack-dorseys-block-cuts-40-of-staff-4-000-people-and-yes-its-because-of-ai",
      "published": "2026-02-27T00:46:00+00:00",
      "summary": "<p>Former Twitter co-founder Jack Dorsey&#x27;s new company <a href=\"https://block.xyz/\">Block</a> — the parent of merchants payment system Square, mobile peer-to-peer payments Cash App, music streamer Tidal, and open source AI agentic system <a href=\"https://venturebeat.com/infrastructure/claude-code-costs-up-to-usd200-a-month-goose-does-the-same-thing-for-free\">Goose</a> — is sending shockwaves across the business world tonight after announcing a more than 40% headcount, cutting its workforce by more than 4,000 people out of a prior total of 10,000, despite its <a href=\"https://s29.q4cdn.com/628966176/files/doc_financials/2025/q4/Q4-2025-Shareholder-Letter_Block.pdf\">latest quarterly earnings statement</a> released today showing $2.87 billion in gross profit up 24% year-over-year. </p><p>The culprit? Newfound AI efficiencies. As Dorsey put it in a <a href=\"https://x.com/jack/status/2027129697092731343\">note shared on his own former social network, X</a>: </p><p><i>&quot;we&#x27;re not making this decision because we&#x27;re in trouble. our business is strong. gross profit continues to grow, we continue to serve more and more customers, and profitability is improving. but something has changed. we&#x27;re already seeing that the intelligence tools we’re creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company. and that&#x27;s accelerating rapidly. i had two options: cut gradually over months or years as this shift plays out, or be honest about where we are and act on it now. i chose the latter. repeated rounds of cuts are destructive to morale, to focus, and to the trust that customers and shareholders place in our ability to lead. i&#x27;d rather take a hard, clear action now and build from a position we believe in than manage a slow reduction of people toward the same outcome. a smaller company also gives us the space to grow our business the right way, on our own terms, instead of constantly reacting to market pressures.&quot;</i></p><h2><b>Technology: The &quot;agentic&quot; shift</b></h2><p>The core of this reorganization is a pivot toward an &quot;intelligence-native&quot; model. Dorsey argues that a significantly smaller team, leveraging the very tools they are building, can deliver more value than a traditional large-scale organization. Block is re-engineering its entire operational stack to be orchestrated by AI, moving away from human-intensive management hierarchies toward what it calls &quot;agentic AI infrastructure&quot;.</p><p>This includes four primary focus areas:</p><ul><li><p><b>Customer Capabilities:</b> Atomic features that allow customers to build directly on top of Block&#x27;s infrastructure.</p></li><li><p><b>Proactive Intelligence: </b>Moving from reactive dashboards to tools like Moneybot that anticipate customer needs before they ask.</p></li><li><p><b>Intelligence Models:</b> A system to orchestrate the company’s internal operations, aiming for extreme speed and product velocity.</p></li><li><p><b>Operational Orchestration: </b>An AI model designed to manage the internal decision-making and risk-assessment processes of the firm.</p></li></ul><h2><b>Product: scaling strength via automation</b></h2><p>The financial strength cited in the lede is driven by deep engagement in Cash App and Square. Cash App’s gross profit grew 33% YoY to $1.83 billion, while Square saw its strongest year on record for new volume added (NVA).</p><p>Specific product highlights include:</p><ul><li><p><b>Cash App Green: </b>This status program for &quot;modern earners&quot; — a segment of 125 million people including gig workers and freelancers — has become a cornerstone of the company’s engagement strategy.</p></li><li><p><b>Square AI:</b> Now embedded in the Square Dashboard, it provides sellers with instant insights into staffing and customer behavior.</p></li><li><p><b>Consumer Lending: </b>Cash App Borrow origination",
      "content_text": "<p>Former Twitter co-founder Jack Dorsey&#x27;s new company <a href=\"https://block.xyz/\">Block</a> — the parent of merchants payment system Square, mobile peer-to-peer payments Cash App, music streamer Tidal, and open source AI agentic system <a href=\"https://venturebeat.com/infrastructure/claude-code-costs-up-to-usd200-a-month-goose-does-the-same-thing-for-free\">Goose</a> — is sending shockwaves across the business world tonight after announcing a more than 40% headcount, cutting its workforce by more than 4,000 people out of a prior total of 10,000, despite its <a href=\"https://s29.q4cdn.com/628966176/files/doc_financials/2025/q4/Q4-2025-Shareholder-Letter_Block.pdf\">latest quarterly earnings statement</a> released today showing $2.87 billion in gross profit up 24% year-over-year. </p><p>The culprit? Newfound AI efficiencies. As Dorsey put it in a <a href=\"https://x.com/jack/status/2027129697092731343\">note shared on his own former social network, X</a>: </p><p><i>&quot;we&#x27;re not making this decision because we&#x27;re in trouble. our business is strong. gross profit continues to grow, we continue to serve more and more customers, and profitability is improving. but something has changed. we&#x27;re already seeing that the intelligence tools we’re creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company. and that&#x27;s accelerating rapidly. i had two options: cut gradually over months or years as this shift plays out, or be honest about where we are and act on it now. i chose the latter. repeated rounds of cuts are destructive to morale, to focus, and to the trust that customers and shareholders place in our ability to lead. i&#x27;d rather take a hard, clear action now and build from a position we believe in than manage a slow reduction of people toward the same outcome. a smaller company also gives us the space to grow our business the right way, on our own terms, instead of constantly reacting to market pressures.&quot;</i></p><h2><b>Technology: The &quot;agentic&quot; shift</b></h2><p>The core of this reorganization is a pivot toward an &quot;intelligence-native&quot; model. Dorsey argues that a significantly smaller team, leveraging the very tools they are building, can deliver more value than a traditional large-scale organization. Block is re-engineering its entire operational stack to be orchestrated by AI, moving away from human-intensive management hierarchies toward what it calls &quot;agentic AI infrastructure&quot;.</p><p>This includes four primary focus areas:</p><ul><li><p><b>Customer Capabilities:</b> Atomic features that allow customers to build directly on top of Block&#x27;s infrastructure.</p></li><li><p><b>Proactive Intelligence: </b>Moving from reactive dashboards to tools like Moneybot that anticipate customer needs before they ask.</p></li><li><p><b>Intelligence Models:</b> A system to orchestrate the company’s internal operations, aiming for extreme speed and product velocity.</p></li><li><p><b>Operational Orchestration: </b>An AI model designed to manage the internal decision-making and risk-assessment processes of the firm.</p></li></ul><h2><b>Product: scaling strength via automation</b></h2><p>The financial strength cited in the lede is driven by deep engagement in Cash App and Square. Cash App’s gross profit grew 33% YoY to $1.83 billion, while Square saw its strongest year on record for new volume added (NVA).</p><p>Specific product highlights include:</p><ul><li><p><b>Cash App Green: </b>This status program for &quot;modern earners&quot; — a segment of 125 million people including gig workers and freelancers — has become a cornerstone of the company’s engagement strategy.</p></li><li><p><b>Square AI:</b> Now embedded in the Square Dashboard, it provides sellers with instant insights into staffing and customer behavior.</p></li><li><p><b>Consumer Lending: </b>Cash App Borrow origination volume surged 223% YoY, proving to be a high-return product that manages income variability for users.</p></li></ul><p>Block also exceeded the Rule of 40—the industry benchmark where the sum of gross profit growth and adjusted operating income margin exceeds 40%—for the first time in the fourth quarter.</p><h2><b>Community reactions</b></h2><p>Not everyone was convinced by Dorsey&#x27;s letter stating that AI efficiencies were the primary driver of the layoffs. As <a href=\"https://x.com/BamaBonds/status/2027142091596288314\">Will Slaughter wrote on X</a>: &quot;In 3 years from December 2019 to December 2022, Block $XYZ more than tripled its headcount from 3,900 to 12,500. Unwinding less than half an insane COVID overhiring binge has much more to do with Jack Dorsey&#x27;s managerial incompetence than whether AI is going to take your job.&quot;</p><div></div><p>Entrepreneur <a href=\"https://x.com/MarceloLima/status/2027150295290220864\">Marcelo P. Lima offered a similar sentiment on X</a>, writing in part: &quot;Everyone will assume Jack Dorsey &#x27;greatest of all time&#x27; is doing this because of AI. He&#x27;s not. Block has been massively bloated for years. Don&#x27;t forget, Jack was head of Twitter. When Elon took over, he fired 80% of staff within 5 months and the product got better. This was before generative AI and Claude Code.&quot; </p><div></div><p>And yet, regardless of how heavily AI factored into these layoffs in particular, the outcome on the wider enterprise landscape may ultimately be the same. With Block&#x27;s stock price <a href=\"https://www.cnbc.com/2026/02/26/block-laying-off-about-4000-employees-nearly-half-of-its-workforce.html\">rising more than 24%</a> on the news, the boards and leadership of other public companies will likely be forced to at least entertain the idea of similarly drastic cuts if they believe AI can replace human labor and drive greater organizational efficiencies. </p><p>As user <a href=\"https://x.com/hkuppy/status/2027133562416251300\">@khuppy wrote on X</a>: &quot;By Q2, if you aren’t firing lots of employees, your board will fire you for being a dinosaur who doesn’t implement AI. It’s going to happen fast now. Feudalism, here we come…&quot;</p><div></div><p>Clearly, companies across sectors but especially those in tech and services will be re-examining their headcount in light of Block&#x27;s latest move. </p><h2><b>The human cost</b></h2><p>Despite the robust financial performance, the human cost is stark. The reduction from over 10,000 to just under 6,000 employees is one of the most drastic in fintech history. Dorsey’s internal note, while aimed at transparency, was met with a mix of awe at the technical vision and criticism of the timing.</p><p>Affected employees are receiving a severance package that includes 20 weeks of salary plus one week per year of tenure, equity vesting through May, and a $5,000 transition fund. </p><p>Dorsey noted that communication channels would stay open through Thursday evening so the team could say goodbye properly, stating, &quot;i&#x27;d rather it feel awkward and human than efficient and cold.&quot;</p><h2><b>How enterprise decision-makers and leaders should interpret the news</b></h2><p>For enterprise decision-makers, Block’s move represents a fundamental challenge to the &quot;growth at all costs&quot; hiring model that has defined the last decade of tech. </p><p>Leadership teams should view this not merely as a cost-cutting measure, but as a strategic reset where organizational value is measured by the ratio of output to &quot;intelligence-native&quot; tools rather than total headcount. Executives should begin by auditing their own internal workflows to identify where agentic AI can consolidate roles and flatten management hierarchies before market pressures force a more reactive, less orderly contraction. </p><p>Even if not leading to as drastic of cuts, hiring slowdowns and freezes, Block&#x27;s move should likely prompt at least the kind of policy introduced separately by <a href=\"https://www.cnbc.com/2025/04/07/shopify-ceo-prove-ai-cant-do-jobs-before-asking-for-more-headcount.html\">Shopify CEO Tobi Lutke nearly a year ago</a>: &quot;Before asking for more Headcount and resources, teams most demonstrate why they cannot get what they want done using AI.&quot; </p><p>While the community reaction to Block’s layoffs highlights the potential for brand damage and morale loss, the 24% surge in Block’s stock price suggests that the public market is increasingly rewarding lean, automated efficiency over human-intensive scaling. </p><p>Decision-makers should evaluate their current &quot;bloat&quot; against the benchmark set by Dorsey: if a company of 6,000 can drive $12.20 billion in gross profit, the standard for organizational efficiency has been permanently raised.</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "These Are Our Absolute Favorite Android Earbuds, and They're Below $200",
      "url": "https://www.wired.com/story/pixel-buds-pro-2-deal-226/",
      "published": "2026-02-27T00:36:07+00:00",
      "summary": "The Pixel Buds Pro 2 have great ANC and long battery life, and they’re marked down in several colors.",
      "content_text": "If you're an esteemed Android user like me, and you felt left out of yesterday's deal on the AirPods Pro 3 , I've got you covered today with an even bigger discount on the Pixel Buds Pro 2 . Both Amazon and Best Buy have the hazel color marked down from $229 to $180, a $49 discount on Google's most upgraded wireless earbuds. Photograph: Julian Chokkattu The first change you'll notice from the previous generation Pixel Buds Pro is that the newer model is much lighter, and the buds are 27 percent smaller. As a result, these are an excellent choice for anyone with small ears, and they stay put super well. Reviewer Parker Hall “had no problem doing hours of tree pruning and going on long sweaty runs in Portland's early fall heat wave.” With some help from top-notch physical sound isolation, the active noise-canceling on these is just as good as Apple’s and even goes toe-to-toe with big hitters like Bose and Sony. The transparency mode works just as well, too, with a wider range and clearer audio than a lot of other headphones offer. When it's time to actually turn up the tunes, you can enjoy a wide, natural soundstage that has excellent detail in the midrange and clear, sparkling treble. The Gemini integration, unfortunately, leaves a bit to be desired. It's not the smoothest experience, particularly when asking multiple questions, and the Pixel Buds Pro 2 aren't offering anything that other earbuds can't do. Apple's live translations and heart rate monitors are more useful features, but if you're on Android, you're locked out of them anyway. If you're interested in upgrading your earbud game, and you already have a Pixel, you can grab the Pixel Buds Pro 2 in hazel for $180 from either Amazon or Best Buy . If that color doesn't suit you, I also spotted lesser discounts on the peony color for $189 , or the porcelain color for $210 . For anyone who isn't already sold on the Pixel Buds Pro 2, make sure to swing by our guide to the best wireless earbuds , with picks for both Apple and Android owners.",
      "cover_image_url": "https://media.wired.com/photos/69a091906fafed81fadd5e34/191:100/w_1280,c_limit/Save%20Almost%20$50%20on%20Our%20Favorite%20Android%20Earbuds.png"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "Hands-On With Nano Banana 2, the Latest Version of Google’s AI Image Generator",
      "url": "https://www.wired.com/story/google-nano-banana-2-ai-image-generator-hands-on/",
      "published": "2026-02-27T00:01:10+00:00",
      "summary": "Google’s latest image model, Nano Banana 2, is a powerful AI photo editor that punctures reality. Well, sometimes.",
      "content_text": "Google just debuted Nano Banana 2, an updated version of its AI image generator. It combines the abilities of Google’s previous release, Nano Banana Pro —like text rendering and web searching—with speedier image generation. This tool will be the new default in Google’s Gemini chatbot . The first image model from Google under the Nano Banana moniker dropped last August, and the Pro version arrived three months later. The AI tool was widely adopted online to alter photos of real people, from generating custom action figures to nostalgic images of people hugging younger versions of themselves. Nano Banana 2 is not only faster at crafting images, it’s also a more powerful photo editor. Despite some rough edges and unconvincing generations in my initial hands-on experience through Gemini , Google’s latest release marks the continued improvement of photorealistic AI tools that can manipulate existing images and serves as a stark reminder to always scrutinize unverified images you see online. Getting Started If you want to try the new image model, the easiest way to access Nano Banana 2 is through the Gemini app or website. You can either click the banana emoji to generate images or just put the request in your prompts to the chatbot. This new image model is also available through Google’s Search tools, AI Studio, Cloud, and other services. Google says the Nano Banana 2 image generator pulls real-time information from the web, which can be useful for generating infographics. To test this, I asked Gemini to generate a custom weather report for my upcoming weekend getaway. Here’s my prompt: I'm going skiing in Dodge Ridge this weekend with some friends. Could you create an infographic that covers the weather conditions? Nano Banana Pro made it easier to generate images with text—pulled from data on the web—and Nano Banana 2 makes that image generation speedier than ever. AI-GENERATED BY REECE ROGERS At first glance, the result looks decent. No wobbly text or disfigured skiers in the background. The forecast for each day includes expected temperatures as well as wind and snow conditions. A small disclaimer at the bottom of the infographic reads, “Weather and conditions subject to change. Check official sources.” I’m glad I did! When I looked up the forecast for this weekend from a different source, I realized that Gemini had messed up the dates and pulled the Google Weather context from last week. When I pointed out this mistake to the bot, it used Nano Banana 2 to replace the text from its first attempt with the correct weather data. Tub Time If you want more details about my getaway, I’m headed to a cozy ski lodge with friends who are skiers. I’m a novice and still deciding whether to actually hit the slopes or just turn into a wrinkly prune sitting in the hot tub all day long. Maybe Nano Banana 2 could make a dumb meme to send to the group chat? I uploaded a photo of myself to Gemini with this prompt: Take this image and put me in a cozy outdoor jacuzzi surrounded by snow. Make my skin comically wrinkly from sitting in there for hours.",
      "cover_image_url": "https://media.wired.com/photos/69a070265fd6da9c76c63408/191:100/w_1280,c_limit/Aspect%20Ratio.jpg"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Netflix backs out of bid for Warner Bros. Discovery, giving studios, HBO, and CNN to Ellison-owned Paramount",
      "url": "https://techcrunch.com/2026/02/26/netflix-warner-bros-discovery-paramount-wbd-bid-studios-hbo-cnn-ellison/",
      "published": "2026-02-26T23:55:39+00:00",
      "summary": "In a one-two punch of centibillion-dollar offers, the bidding war for Warner Bros. Discovery is over. David Ellison-owned Paramount will acquire Warner Bros. Discovery. Netflix has lost.",
      "content_text": "In a flurry of deal offers in the high tens of billions of dollars, the bidding war for Warner Bros. Discovery is over. David Ellison-owned Paramount will acquire Warner Bros. Discovery. On Thursday, Warner Bros. Discovery announced that Paramount Skydance’s newest offer of $31 a share was a “superior proposal,” giving Netflix four business days to counter. Netflix then said it would not raise its $82.7 billion all-cash bid for the legacy studio, and would walk away from the deal . “The transaction we negotiated would have created shareholder value with a clear path to regulatory approval,” said Netflix co-CEOs Ted Sarandos and Greg Peters in a statement Thursday. “However, we’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.” Per the terms of the original deal, Warner Bros. Discovery will have to pay a $2.8 billion termination fee to Netflix to end the existing agreement. Paramount’s renewed offer — backed by the world’s sixth-richest person, Oracle’s executive chair, and David Ellison’s father, Larry Ellison — includes paying that breakup fee. The new deal will see Paramount, which was bought just last year by Ellison’s Skydance Media with heavy financial backing from his father, acquiring the entirety of Warner Bros. Discovery, including its studios, HBO, its streaming service, its games and entertainment divisions, and linear television networks like CNN, TBS, TNT, Discovery, and HGTV. Ellison, whose Paramount already owns major studios, entertainment, and news businesses, has warned of significant job cuts. His ownership of news network CBS has also attracted controversy and has largely been seen as a sympathetic turn toward the Trump administration, with reporting critical of the administration shelved or facing increased scrutiny by Ellison and CBS’s editor-in-chief, the conservative provocateur Bari Weiss. Larry Ellison is a major donor and supporter of President Trump. Netflix had announced its intent to acquire WBD in December, offering nearly $83 billion for its studios and streaming service alone. Despite several hostile takeover bids by Paramount, Warner Bros. Discovery reaffirmed to shareholders its belief that Netflix’s offer was superior to Paramount’s, which offered $108 billion for the full company including its linear television networks. Paramount’s newest bid, of $31 a share, values WBD at about $111 billion. Techcrunch event Boston, MA | June 9, 2026 Paramount will take on the about $33 billion in debt held by Warner Bros. Discovery, according to the deal. Larry Ellison, whose net worth is $201 billion, according to Bloomberg , has agreed to supply the additional equity to fulfill Paramount’s bid. Paramount’s market cap is about $12 billion. The deal is also being financed by a $57.5 billion debt commitment from Bank of America Merrill Lynch, Citi, and Apollo Global Management. Netflix shares jumped as much as 10% in after-hours trading in New York. Shares in Paramount were up 4.5%.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2025/09/warner-bros.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Jack Dorsey just halved the size of Block's employee base - and he says your company is next",
      "url": "https://techcrunch.com/2026/02/26/jack-dorsey-block-layoffs-4000-halved-employees-your-company-is-next/",
      "published": "2026-02-26T23:43:32+00:00",
      "summary": "Jack Dorsey has long been an open admirer of Elon Musk. Now, it seems, he may have been taking notes.",
      "content_text": "Jack Dorsey has long been an open admirer of Elon Musk. Now, it seems, he may have been taking notes. On Thursday, Dorsey announced that Block, the payments company he founded that operates Square, Cash App, and Tidal, is cutting more than 4,000 employees, nearly half its global workforce, taking it from over 10,000 workers down to just under 6,000. Investors responded enthusiastically, sending the stock up more than 24% in after-hours trading. It isn’t the first time a major tech company has done something of the sort. In November 2022, Musk slashed roughly 50% of Twitter’s staff in a single stroke after taking the company private, a move that rattled many in Silicon Valley and rewrote the unofficial rules for how far a CEO could go in one shot. Dorsey was in an unusual position to watch it unfold. He’d rolled his roughly 2.4% ownership stake in Twitter into Musk’s takeover rather than taking a cash payout, making him one of the largest outside investors in what became X. The two men have had one of tech’s stranger relationships, with warm words giving way to public shots, then back again. Dorsey championed Musk’s Twitter acquisition, then said Musk “should have walked away.” He helped launch Bluesky, the decentralized Twitter alternative, then quit its board and called X “freedom technology.” Both are also vocal Bitcoin advocates — Block and Tesla each carry the cryptocurrency on their balance sheets. Dorsey framed Thursday’s cuts as a proactive, even empathetic, choice, and not a financial emergency. (The 4,000 people losing their jobs may see it differently.) “Repeated rounds of cuts are destructive to morale, to focus, and to the trust that customers and shareholders place in our ability to lead,” he wrote on X. He predicted that within a year, most companies will arrive at the same place. “I’d rather get there honestly and on our own terms than be forced into it reactively,” he said. The cuts are being driven, at least officially, by AI. Block CFO Amrita Ahuja said the cuts will position the company to “move faster with smaller, highly talented teams using AI to automate more work.” Techcrunch event Boston, MA | June 9, 2026 As for severance, Dorsey told U.S. employees who are being cut that they will receive “your salary for 20 weeks + 1 week per year of tenure, equity vested through the end of [M]ay, 6 months of health care, your corporate devices, and $5,000 to put toward whatever you need to help you in this transition.” Employees outside the U.S. will receive “similar support” dependent on their countries’ policies, he added. Salesforce and Amazon are among a growing list of other companies that have made enormous staffing cuts citing the increased gains they are seeing from AI, though a Forrester Research report last month cast some doubt on how real those gains are versus the likelihood that many layoffs are financially driven.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2018/09/GettyImages-1027231340.jpg?w=1024"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Anthropic refuses Pentagon’s new terms, standing firm on lethal autonomous weapons and mass surveillance",
      "url": "https://www.theverge.com/news/885773/anthropic-department-of-defense-dod-pentagon-refusal-terms-hegseth-dario-amodei",
      "published": "2026-02-26T23:22:44+00:00",
      "summary": "Less than 24 hours before the deadline in an ultimatum issued by the Pentagon, Anthropic has refused the Department of Defense's demands for unrestricted access to its AI. It's the culmination of a dramatic exchange of public statements, social media posts, and behind-the-scenes negotiations, coming down to Defense Secretary Pete Hegseth's desire to renegotiate all [&#8230;]",
      "content_text": "Less than 24 hours before the deadline in an ultimatum issued by the Pentagon, Anthropic has refused the Department of Defense’s demands for unrestricted access to its AI. It’s the culmination of a dramatic exchange of public statements, social media posts, and behind-the-scenes negotiations, coming down to Defense Secretary Pete Hegseth’s desire to renegotiate all AI labs’ current contracts with the military. But Anthropic, so far, has refused to back down from its two current red lines: no mass surveillance of Americans, and no lethal autonomous weapons (or weapons with license to kill targets with no human oversight whatsoever). OpenAI and xAI had reportedly already agreed to the new terms, while Anthropic’s refusal had led to CEO Dario Amodei being summoned to the White House this week for a meeting with Hegseth himself, in which the Secretary reportedly issued an ultimatum to the CEO to back down by the end of business day on Friday or else. In a statement late Thursday, Amodei wrote, “I believe deeply in the existential importance of using AI to defend the United States and other democracies, and to defeat our autocratic adversaries. Anthropic has therefore worked proactively to deploy our models to the Department of War and the intelligence community.” He added that the company has “never raised objections to particular military operations nor attempted to limit use of our technology in an ad hoc manner” but that in a “narrow set of cases, we believe AI can undermine, rather than defend, democratic values” — going on to specifically mention mass domestic surveillance and fully autonomous weapons. (Amodei mentioned that “partial autonomous weapons … are vital to the defense of democracy” and that fully autonomous weapons may eventually “prove critical for our national defense,” but that “today, frontier AI systems are simply not reliable enough to power fully autonomous weapons.” He did not rule out Anthropic acquiescing to the military’s use of fully autonomous weapons in the future but mentioned that they were not ready now.) The Pentagon had already reportedly asked major defense contractors to assess their dependence on Anthropic’s Claude, which could be seen as the first step to designating the company a “supply chain risk” – a public threat that the Pentagon had made recently (and a classification usually reserved for threats to national security ). The Pentagon was also reportedly considering invoking the Defense Production Act to make Anthropic comply. Amodei wrote in his statement that the Pentagon’s “threats do not change our position: we cannot in good conscience accede to their request.” He also wrote that “should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider, avoiding any disruption to ongoing military planning, operations, or other critical missions. Our models will be available on the expansive terms we have proposed for as long as required.”",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25469941/STK202_DARIO_AMODEI_CVIRGINIA_D.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "‘Uncanny Valley’: Pentagon vs. ‘Woke’ Anthropic, Agentic vs. Mimetic, and Trump vs. State of the Union",
      "url": "https://www.wired.com/story/uncanny-valley-podcast-pentagon-anthropic-agentic-mimetic-trump-state-of-the-union/",
      "published": "2026-02-26T23:20:36+00:00",
      "summary": "Our hosts unpack the news of the week, starting with the ongoing feud between Anthropic and the Pentagon. Plus: All you need to know about TAT-8 and undersea cables.",
      "content_text": "This week, the Uncanny Valley team dives into the feud that has been brewing between Anthropic and the Pentagon—and what it says about how the government interacts with tech companies. Later, Zoë Schiffer tells us why figuring out whether you are agentic or mimetic has become the new litmus test in Silicon Valley. Plus, we discuss the key takeaways from the State of the Union address and give a farewell to the TAT-8 undersea cables—the ones that made our modern internet possible. Articles mentioned in this episode: You can follow Brian Barrett on Bluesky at @brbarrett , Zoë Schiffer on Bluesky at @zoeschiffer , and Leah Feiger on Bluesky at @leahfeiger . Write to us at uncannyvalley@wired.com . How to Listen You can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how: If you're on an iPhone or iPad, open the app called Podcasts, or just tap this link . You can also download an app like Overcast or Pocket Casts and search for “uncanny valley.” We’re on Spotify too. Transcript Note: This is an automated transcript, which may contain errors. Brian Barrett: Hey, it's Brian. Zoë, Leah, and I have really enjoyed being your new hosts these past few weeks, and we want to hear from you. If you like the show and have a minute, please leave us a review in the podcast or app of your choice. It really helps us reach more people. And for any questions and comments, you can always reach us at uncannyvalley@wired.com . Thank you for listening. On to the show. Leah Feiger: Hey, how's it going? Zoë Schiffer: I feel great. Brian? Brian Barrett: I feel terrific, and I know Leah does too, because Survivor 's back tonight, another thing that we care about and you don't. Zoë Schiffer: How do you know I don't? I mean, I don't. I don't, except for my best friend from childhood tried to go on it and then she didn't get on, so it's irrelevant. Leah Feiger: Famously, one day I'm going to apply, and both Brian and our colleague Tim have assured me that I can leave for a month to the beaches of Fiji and come back and still keep my job. Zoë Schiffer: I think most people would be like, Leah, you're not going to survive out there, but they don't know about your deep-sea-diving prowess. Leah Feiger: I actually think I would be fine. I really, really want to do this. One day, you guys. Brian Barrett: But Leah, it would require you to potentially kill some fish to eat them, which is not normally— Leah Feiger: That's OK. Brian Barrett: Oh, OK. Leah Feiger: No, no, no, no, fishing's fine. Subsistence living, that's very OK. It's, like, the larger institutionalization of the mass murder of our sea that I take a bit of a bigger issue with. Zoë Schiffer: And on that note, welcome to WIRED's Uncanny Valley . I'm Zoë Schiffer, WIRED's director of business and industry. Brian Barrett: I'm Brian Barrett, executive editor. Leah Feiger: And I'm Leah Feiger, senior politics editor.",
      "cover_image_url": "https://media.wired.com/photos/699f61371e8ef8a5fdf2a3b3/191:100/w_1280,c_limit/Uncanny-Valley-Podcast-Anthropic-Pentagon-Politics-2262730524.jpg"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Anthropic CEO stands firm as Pentagon deadline looms",
      "url": "https://techcrunch.com/2026/02/26/anthropic-ceo-stands-firm-as-pentagon-deadline-looms/",
      "published": "2026-02-26T23:19:06+00:00",
      "summary": "Anthropic CEO Dario Amodei said Thursday that he \"cannot in good conscience accede\" to the Pentagon's demands to give the military unrestricted access to its AI systems.",
      "content_text": "Anthropic CEO Dario Amodei said Thursday that he “cannot in good conscience accede to [the Pentagon’s] request” to give the military unrestricted access to its AI systems. “Anthropic understands that the Department of War, not private companies, makes military decisions,” Amodei wrote in a statement. “However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values. Some uses are also simply outside the bounds of what today’s technology can safely and reliably do.” The two cases are: mass surveillance of Americans and fully autonomous weapons with no human in the loop. The Pentagon believes it should be able to use Anthropic’s model for all lawful purposes, and that its uses shouldn’t be dictated by a private company. Amodei’s statement comes less than 24 hours ahead of the Friday 5:01 p.m. deadline Defense Secretary Pete Hegseth has given Anthropic to either acquiesce to his demands, or face the consequences. The Department of Defense has attempted to force Amodei’s hand by either labeling Anthropic a supply chain risk — a designation reserved for foreign adversaries — or invoke the Defense Production Act and effectively force the firm to do its bidding. The DPA gives the president the authority to force companies to prioritize or expand production for national defense. Amodei pointed out the contradiction in those two threats. “One labels us a security risk; the other labels Claude as essential to national security.” He added that it’s the Department’s right to choose contractors most aligned with its vision, “but given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider.” Anthropic is currently the only frontier AI lab that has classified-ready systems for the military, though the DOD is reportedly getting xAI ready for the job. Techcrunch event Boston, MA | June 9, 2026 “Our strong preference is to continue to serve the Department and our warfighters—with our two requested safeguards in place,” Amodei said. “Should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider, avoiding any disruption to ongoing military planning, operations, or other critical missions.” TLDR, he’s saying: “We can just part ways. There’s no need to be nasty about it.”",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2261514463.jpg?w=1024"
    },
    {
      "industry": "technology",
      "source": "Ars Technica",
      "title": "Neanderthals seemed to have a thing for modern human women",
      "url": "https://arstechnica.com/science/2026/02/genomes-chart-the-history-of-neanderthal-modern-human-interactions/",
      "published": "2026-02-26T23:16:46+00:00",
      "summary": "\"Neanderthal deserts\" in our genomes suggest a strong pattern in matings.",
      "content_text": "By now, it’s firmly established that modern humans and their Neanderthal relatives met and mated as our ancestors expanded out of Africa, resulting in a substantial amount of Neanderthal DNA scattered throughout our genome. Less widely recognized is that some of the Neanderthal genomes we’ve seen have pieces of modern human DNA as well. Not every modern human has the same set of Neanderthal DNA, however; different people will, by chance, have inherited different fragments. But there are also some areas, termed “Neanderthal deserts,” where none of the Neanderthal DNA seems to have persisted. Notably, the largest Neanderthal desert is the entire X chromosome, raising questions about whether this reflects the evolutionary fitness of genes there or mating preferences. Now, three researchers at the University of Pennsylvania, Alexander Platt, Daniel N. Harris, and Sarah Tishkoff, have done the converse analysis: examining the X chromosomes of the handful of completed Neanderthal genomes we have. It turns out there’s also a strong bias toward modern human sequences there, as well, and the authors interpret that as selective mating, with Neanderthal males showing a strong preference for modern human females and their descendants. What type of selection are we looking at? Given how long modern humans and Neanderthals had been evolving as separate populations, some degree of genetic incompatibility is definitely possible. Lots of proteins interact in various ways, and the genes behind these interaction networks will evolve together—a change in one gene will often lead to compensatory changes in other genes in the network. Over time, those changes may mean re-introducing the original gene will actually disrupt the network, with a negative impact on fitness. That means the introduction of some Neanderthal genes into the modern human genome (or vice versa) would be disruptive and make carriers of them less fit. So they’d be selected against and lost over the ensuing generations. Of course, some segments would likely be lost at random—the genome’s pretty big, and the modern human population was likely large and growing, allowing its DNA to dilute out the influence of other human populations. Figuring out which influence is dominant can be challenging.",
      "cover_image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1243699616-1024x648.jpg"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Netflix walks away from its deal to buy Warner Bros. after Paramount came back with a better offer",
      "url": "https://www.theverge.com/streaming/885753/netflix-exit-warner-bros-discovery-deal-paramount",
      "published": "2026-02-26T23:10:12+00:00",
      "summary": "Netflix has dropped its $83 billion deal to acquire the Warner Bros. studio, HBO, and its streaming service HBO Max. In an announcement on Thursday, co-CEOs Ted Sarandos and Greg Peters say the streamer is \"declining to match\" the new bid made by Paramount: The transaction we negotiated would have created shareholder value with a [&#8230;]",
      "content_text": "The transaction we negotiated would have created shareholder value with a clear path to regulatory approval. However, we’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid. We believe we would have been strong stewards of Warner Bros.’ iconic brands, and that our deal would have strengthened the entertainment industry and preserved and created more production jobs in the U.S. But this transaction was always a ‘nice to have’ at the right price, not a ‘must have’ at any price.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/STK072_STKB374_NETFLIX_WB_A.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Microsoft’s Copilot Tasks AI uses its own computer to get things done",
      "url": "https://www.theverge.com/tech/885741/microsoft-copilot-tasks-ai",
      "published": "2026-02-26T22:56:09+00:00",
      "summary": "Microsoft is previewing a new AI system, Copilot Tasks, that it says is designed to take care of busywork for you in the background, the company announced on Thursday. The feature takes the load off your device using its own cloud-based computer and browser, allowing it to handle a variety of jobs ranging from scheduling [&#8230;]",
      "content_text": "Microsoft is previewing a new AI system, Copilot Tasks, that it says is designed to take care of busywork for you in the background, the company announced on Thursday . The feature takes the load off your device using its own cloud-based computer and browser, allowing it to handle a variety of jobs ranging from scheduling appointments to generating study plans while you do something else. As noted by Microsoft, you can describe what you need to Copilot Tasks using natural language, and assign Copilot Tasks to complete jobs on a recurring, scheduled, or one-time basis. Copilot Tasks will provide a report once its work is complete. You can call upon Copilot Tasks to do things like organize your subscriptions and cancel the ones you don’t use, as well as turn emails, attachments, and images from your inbox into a slide deck. Some other use cases include having the AI assistant surface urgent emails and draft replies, plan a birthday party from venue to invites; and keep tabs on new apartment listings every Friday, even setting up home tours. Copilot Tasks appears to be Microsoft’s response to the agentic AI capabilities launched in recent months, including Claude Cowork , ChatGPT Agent Mode , Perplexity Computer , and the Gemini-powered “auto-browse” feature in Google Chrome. Microsoft says that Tasks will ask for permission before performing “meaningful actions,” like making a payment or sending a message for you. For now, Copilot Tasks is only available in a research preview with a “small group” of testers. You can join a waitlist for Copilot Tasks from Microsoft’s website .",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25357668/STK259_MICROSOFT_COPILOT_2__C.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Ars Technica",
      "title": "Perplexity announces \"Computer,\" an AI agent that assigns work to other AI agents",
      "url": "https://arstechnica.com/ai/2026/02/perplexity-announces-computer-an-ai-agent-that-assigns-work-to-other-ai-agents/",
      "published": "2026-02-26T22:53:18+00:00",
      "summary": "It's also a buttoned-down, ostensibly safer take on the OpenClaw concept.",
      "content_text": "Perplexity has introduced “Computer,” a new tool that allows users to assign tasks and see them carried out by a system that coordinates multiple agents running various models. The company claims that Computer, currently available to Perplexity Max subscribers, is “a system that creates and executes entire workflows” and “capable of running for hours or even months.” The idea is that the user describes a specific outcome—something like “plan and execute a local digital marketing campaign for my restaurant” or “build me an Android app that helps me do a specific kind of research for my job.” Computer then ideates subtasks and assigns them to multiple agents as needed, running the models Perplexity deems best for those tasks. The core reasoning engine currently runs Anthropic’s Claude Opus 4.6, while Gemini is used for deep research, Nano Banana for image generation, Veo 3.1 for video production, Grok for lightweight tasks where speed is a consideration, and ChatGPT 5.2 for “long-context recall and wide search.” This kind of best-model-for-the-task approach differs from some competing products like Claude Cowork , which only uses Anthropic’s models. All this happens in the cloud, with prebuilt integrations. “Every task runs in an isolated compute environment with access to a real filesystem, a real browser, and real tool integrations,” Perplexity says. The idea is partly that this workflow was what some power users were already doing, and this aims to make that possible for a wider range of people who don’t want to deal with all that setup. People were already using multiple models and tailoring them to specific tasks based on perceived capabilities, while, for example, using MCP (Model Context Protocol) to give those models access to data and applications on their local machines. Perplexity Computer takes a different approach, but the goal is the same: have AI agents running tailor-picked models to perform tasks involving your own files, services, and applications. Then there is OpenClaw, which you could perceive as the immediate predecessor to this concept. The story so far If you haven’t been following the wild OpenClaw craze, here’s the quick summary: originally titled ClawdBot, then Moltbot, OpenClaw was an agentic AI tool that leveraged large language models to independently operate as a sort of background or ambient process on your local machine, performing a wide range of tasks from sorting through your email history to building websites to, well, basically whatever you could imagine.",
      "cover_image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Perplexity-Computer-1152x648.jpg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Statement from Dario Amodei on our discussions with the Department of War",
      "url": "https://www.anthropic.com/news/statement-department-of-war",
      "published": "2026-02-26T22:42:47+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.anthropic.com/news/statement-department-of-war\">https://www.anthropic.com/news/statement-department-of-war</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47173121\">https://news.ycombinator.com/item?id=47173121</a></p> <p>Points: 1264</p> <p># Comments: 691</p>",
      "content_text": "I believe deeply in the existential importance of using AI to defend the United States and other democracies, and to defeat our autocratic adversaries. Anthropic has therefore worked proactively to deploy our models to the Department of War and the intelligence community. We were the first frontier AI company to deploy our models in the US government’s classified networks, the first to deploy them at the National Laboratories , and the first to provide custom models for national security customers. Claude is extensively deployed across the Department of War and other national security agencies for mission-critical applications, such as intelligence analysis, modeling and simulation, operational planning, cyber operations, and more. Anthropic has also acted to defend America’s lead in AI, even when it is against the company’s short-term interest. We chose to forgo several hundred million dollars in revenue to cut off the use of Claude by firms linked to the Chinese Communist Party (some of whom have been designated by the Department of War as Chinese Military Companies), shut down CCP-sponsored cyberattacks that attempted to abuse Claude, and have advocated for strong export controls on chips to ensure a democratic advantage. Anthropic understands that the Department of War, not private companies, makes military decisions. We have never raised objections to particular military operations nor attempted to limit use of our technology in an ad hoc manner. However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values. Some uses are also simply outside the bounds of what today’s technology can safely and reliably do. Two such use cases have never been included in our contracts with the Department of War, and we believe they should not be included now: Mass domestic surveillance. We support the use of AI for lawful foreign intelligence and counterintelligence missions. But using these systems for mass domestic surveillance is incompatible with democratic values. AI-driven mass surveillance presents serious, novel risks to our fundamental liberties . To the extent that such surveillance is currently legal, this is only because the law has not yet caught up with the rapidly growing capabilities of AI. For example, under current law, the government can purchase detailed records of Americans’ movements, web browsing, and associations from public sources without obtaining a warrant, a practice the Intelligence Community has acknowledged raises privacy concerns and that has generated bipartisan opposition in Congress. Powerful AI makes it possible to assemble this scattered, individually innocuous data into a comprehensive picture of any person’s life—automatically and at massive scale. Fully autonomous weapons. Partially autonomous weapons, like those used today in Ukraine, are vital to the defense of democracy. Even fully autonomous weapons (those that take humans out of the loop entirely and automate selecting and engaging targets) may prove critical for our national defense. But today, frontier AI systems are simply not reliable enough to power fully autonomous weapons. We will not knowingly provide a product that puts America’s warfighters and civilians at risk. We have offered to work directly with the Department of War on R&D to improve the reliability of these systems, but they have not accepted this offer. In addition, without proper oversight , fully autonomous weapons cannot be relied upon to exercise the critical judgment that our highly trained, professional troops exhibit every day. They need to be deployed with proper guardrails, which don’t exist today. To our knowledge, these two exceptions have not been a barrier to accelerating the adoption and use of our models within our armed forces to date. The Department of War has stated they will only contract with AI companies who accede to “any lawful use” and remove safeguards in the cases mentioned above. They have threatened to remove us from their systems if we maintain these safeguards; they have also threatened to designate us a “supply chain risk”—a label reserved for US adversaries, never before applied to an American company— and to invoke the Defense Production Act to force the safeguards’ removal. These latter two threats are inherently contradictory : one labels us a security risk; the other labels Claude as essential to national security. Regardless, these threats do not change our position: we cannot in good conscience accede to their request. It is the Department’s prerogative to select contractors most aligned with their vision. But given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider. Our strong preference is to continue to serve the Department and our warfighters—with our two requested safeguards in place. Should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider, avoiding any disruption to ongoing military planning, operations, or other critical missions. Our models will be available on the expansive terms we have proposed for as long as required. We remain ready to continue our work to support the national security of the United States.",
      "cover_image_url": "https://cdn.sanity.io/images/4zrzovbb/website/1864442e2d581ffc8242e7c57e2c4e2309351f49-1200x630.png"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "PayPal might not be looking to sell itself: Report",
      "url": "https://techcrunch.com/2026/02/26/paypal-might-not-be-looking-to-sell-itself-report/",
      "published": "2026-02-26T22:23:42+00:00",
      "summary": "PayPal may not be in talks to be acquired, sources have told Semafor, after a previous news report that Stripe was sniffing around.",
      "content_text": "PayPal may not be pursuing an acquisition, Semafor reported , citing people familiar with the matter. Earlier this week, Bloomberg reported that Stripe expressed interest in buying some or all of PayPal Holdings, which includes the flagship product PayPal and its services, as well as other companies like Venmo. Stripe declined to comment on the news. But unnamed sources tell Semafor that the company has been working with bankers in preparation for a possible activist investor campaign or a hostile takeover. The bankers were working with Alex Chriss , PayPal’s now-ousted CEO, the outlet reported. The company’s new CEO starts next week, PayPal has said. PayPal did not respond to TechCrunch’s request for comment.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-1231192043.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "Ars Technica",
      "title": "xAI spent $7M building wall that barely muffles annoying power plant noise",
      "url": "https://arstechnica.com/tech-policy/2026/02/pops-whines-and-roars-xai-accused-of-torturing-neighbors-of-noisy-power-plant/",
      "published": "2026-02-26T22:19:39+00:00",
      "summary": "“Temu sound wall” not enough to quell fury over xAI’s power plant.",
      "content_text": "“To our understanding, sound barriers can reduce certain frequencies under controlled conditions, but turbine noise involves low-frequency sounds and tonal components that often reach beyond barriers,” the coalition’s spokesperson said. “The most effective method for reducing industrial noise exposure is typically distance from residential areas, which is not a mitigation option in this scenario given the facility’s proximity to homes.” The coalition urged xAI to be transparent and to share data backing mitigation claims if it wants the community to believe that the second sound barrier will make any difference. “Without transparent modeling, validated field measurements, and independent verification, it is difficult to assess whether the barrier will meaningfully address the ongoing nuisance experienced by nearby residents,” the coalition’s spokesperson said. “Mitigation claims are only meaningful if they are supported by transparent data.” Mayor labels protestors Musk haters At least one city official, Mayor Darren Musselwhite, has suggested that community backlash is “political.” Although he acknowledged that the noise was a “legitimate concern,” he also claimed on Facebook that some people protesting xAI’s facility were simply Elon Musk haters, NBC News reported. “Southaven is now under attack by all who choose to oppose Elon Musk because of his high-profile political stances,” Musselwhite wrote. However, residents told NBC News that “their concerns have nothing to do with politics.” One person interviewed even praised Musk’s work with the Department of Government Efficiency . Instead, they’re worried that local officials seeing dollar signs have potentially let xAI exploit loopholes to pollute communities without any warning. The community flyer from the Safe and Sound Coalition criticized what they viewed as shady behavior from local officials: “This project was started behind our backs, with zero community input. Local officials have repeatedly downplayed concerns, spun the facts, and misled residents about the true impacts and the deals made with xAI. Many people only found out after the turbines were up and running.” The coalition’s spokesperson told Ars that a health impact analysis published on behalf of the SELC provides “meaningful insight” into the biggest health risks. That concluded that using the EPA’s COBRA health impact model, emissions from running 41 permanent turbines at the Southaven plant “are estimated to result in $30–$44 million per year in health-related damages, including costs from premature deaths, hospital visits, and lost productivity. Over a typical 30-year operating life, these impacts would amount to approximately $588–$862 million in cumulative discounted public-health costs, borne largely by residents of Tennessee and Mississippi.”",
      "cover_image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1768218692.jpg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Hydroph0bia (CVE-2025-4275) - a fixed SecureBoot bypass for UEFI-compatible firmware based on Insyde H2O, part 3",
      "url": "https://coderush.me/hydroph0bia-part3/",
      "published": "2026-02-26T22:14:11+00:00",
      "summary": "<p>Article URL: <a href=\"https://coderush.me/hydroph0bia-part3/\">https://coderush.me/hydroph0bia-part3/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47172730\">https://news.ycombinator.com/item?id=47172730</a></p> <p>Points: 43</p> <p># Comments: 1</p>",
      "content_text": "This post is likely the final one about a vulnerability I dubbed Hydroph0bia (as a pun on Insyde H2O) aka CVE-2025-4275 or INSYDE-SA-2025002. This part is about checking how Insyde fixed the vulnerability and if it's possible to bypass their fixes. Intro It is always interesting to see how a vulnerability with a massive supply chain impact gets fixed by different OEMs, and how fast they could distribute the fix across their fleets. There been 10 days since the embargo end, and so far the only OEM who successfully delivered BIOS updates with fixes for Hydroph0bia is Dell . Lenovo confirmed they are vulnerable, but will deliver the fixes not earlier than 2025-07-30 (later for some models). Framework confirmed they are vulnerable, but provided no time estimates. All other affected vendors (Acer, Fujitsu, HP, etc.) haven't published anything relevant yet, neither a security advisory, nor fixed BIOS updates. Let's do some more reverse engineering and see how Insyde fixed the issue on their side. We can do so by comparing two BIOS updates released by Dell, one right before the fix , and the other right after . Unwrapping the update images Before we can compare the images, we need to unwrap them, i.e. remove the data that will not be flashed onto the SPI chip, and is only required for the FW updater application. This can be done using the InsydeImageExtractor tool I wrote 11 years ago (props to Insyde for not updating the file format, once again the motto is \"do not fix what is not broken\"). Diffing the update images There are several ways to find a difference between UEFI images, I prefer to start with generating UEFITool reports for them, then comparing the reports with a UI text diffing tool ( Beyond Compare is a good one). Looks like we have a fair amount of changes here, but it's certain that not all of them are related to Hydroph0bia. What we are interested in changes to drivers related to the firmware update process, i.e. BdsDxe , SecurityStubDxe , SecureFlashDxe and alike. Source code updates, especially addions of new code, often make the PE image size bigger, so we expect a fixed driver to be slightly bigger than a vulnerable one. To compare the PE files, we can use one of the two popular solutions, both natively supported by IDA 9.1: bindiff or diaphora . I'll be using the second one just because I already have it installed and ready. The comparison results we have here are as follows: BdsDxe has the same size (and same base address of 0, so changes could not be explained by relocations alone), likely having minor changes. SecurityStubDxe got a minor size reduction (32 bytes), likely having minor changes. SecureFlashDxe got a decent size increase (704 bytes), likely containing the main fix. After disassembling both copies of BdsDxe the only relevant change is a replacement on a \"naked\" gRT->SetVariable call (that could not remove special Insyde variables with AW attribute) with a LibSetSecureVariable call (that uses SMM communication service if available, and will remove such kind of variables). SecurityStubDxe got a minor fix for its handler of ExitBootServices event, the new version still flips a global, but doesn't call gBS->CloseEvent on itself. This changes is not related to Hydroph0bia at all, and the driver as it is will still trust a \"shadowed\" version of SecureFlashCertData if an attacker will be able to set it somehow. SecureFlashDxe got a fair amount of changes: the same replacement of \"naked\" SetVariable call with a LibSetSecureVariable call for setting the Insyde special variables, that BdsDxe has. the same ExitBootServices event that SecurityStubDxe has. additional countermeasure against variable shadowing was added to the entry point: This additional calls attempt to remove SecureFlashSetupMode and SecureFlashCertData variable, if they are set, and guarantee that even if they are set as a special Insyde variable with AW attribute, they will still be removed. The driver also now registers a VariablePolicy for both variables mentioned above, so that they could not be set from the OS. It is a newer mechanism that was previously used to protect SecureFlashInfo variable, but its default EDK2 implementation also looks vulnerable to the same \"flip a global variable to disable the whole thing\" approach we used to defeat InsydeVariableLock in part 2 . As I do not have any formally-affected-now-fixed HW to actually test that assertion, let's believe it actually does something, for now. Does this fix look sound? A short answer is \"yes, conditionally\" . The condition here is that an attacker will not find a way to set SecureFlashCertData variable in a way that will bypass both the VariablePolicy and the LibSetSecureVariable . It could be possible by manual NVRAM editing using SPI programming HW or a flash write protection bypass, and I expect this kind of attack to still work after the fix. Physical attacks are of course out of scope for UEFI SecureBoot bypasses (because all the TA variables that SB trusts are stored in the same physical storage), but it still leaves the FW updater vulnerable to certificate hijacking (although it doesn't actually give an attacker any further capabilities if arbitrary flash write has already been achieved). I do still believe that there's a much better way to fix the issue: STOP USING NVRAM FOR ANY SECURITY-SENSITIVE APPLICATIONS . There's no need for SecureFlashCertData to be loaded in BdsDxe / CapsuleRuntimeDxe / WhateverElseDxe and then consumed by SecurityStubDxe . The latter might as well react to the presence of SecureFlashSetupMode trigger, then load the certs into memory using the very same LoadCertificateToVariable function once, then use it directly from memory to perform Authenticode verification for any amount of input files. The only possible regression I'd see with this approach is the case where downstream OEMs blindly copypasted the mechanism into their custom drivers, and it will end up broken for them when Insyde applies the update on their side. It is normal for security updates though, so \"backwards compat\" is a poor reason for not doing the fix properly. I wrote to Tim Lewis (Insyde CTO) about the fix being somewhat weaker than I expected it to be, and got a reply from Kevin Devis (Insyde Security Strategist) saying that they did try to fix it \"the right way\" , encountered regressions, then had to do it the way it's currently done. Hi Nikolaj, I dug into this a bit. We started on a fix based on your feedback. Unfortunately we ran into some regression issues and decided to fix “the easy way” for now. In addition, we are creating an ECR for an engineer to investigate a solution that will not use variables. This way we mitigate the issue for now and improve the codebase even more later. I’ll add a note to the task to circle back to you with the details of the change when it happens. It might take 6 months or so. Thanks, Kevin It is nice to see an IBV actually replying to emails, participating in responsible disclosure and coordination, releasing the advisories in time, etc. Way to go, Insyde folks! Outro I've recently bought an Acer Swift Go 16 to be my personal device-under-test for further investigations into the Insyde H2O platform. The FW for it doesn't have Hydroph0bia fix yet, but it's properly set up to protect DXE volume using FlashDeviceMap , which in turn is properly protected by Intel BootGuard . I hope Acer didn't make any additional messes or add any vulnerabilities of their own, but now I can verify most of the assertions that EDK2, Insyde and Acer could make about security of that FW. Stay tuned. Acknowledgements I want to thank the Dell security team for releasing the fix sooner than everybody else, could not write this post without them. I also want to thank Tim Lewis, Kevin Devis, and the whole Insyde security team for successful collaboration. Links Unwrapped Dell G15 5535 FW images ( older 0.13.0 , newer 0.14.0 ), UEFITool-generated reports for them ( older , newer ), extracted BdsDxe ( older , newer ), SecurityStubDxe ( older , newer ) and SecureFlashDxe ( older , newer ) are on GitHub.",
      "cover_image_url": "../hydroph0bia-part3/hp3_logo.png"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Jack Dorsey’s Block cuts nearly half of its staff in AI gamble",
      "url": "https://www.theverge.com/tech/885710/jack-dorsey-block-layoffs-job-cuts-ai",
      "published": "2026-02-26T22:11:13+00:00",
      "summary": "Jack Dorsey's Block, the financial tech company that runs Square and the Cash app, is cutting its workforce by \"nearly half\" and axing more than 4,000 jobs. The company will shrink from more than 10,000 people to less than 6,000, Dorsey says in a post on X. And the reason why? AI. \"We're not making [&#8230;]",
      "content_text": "Jack Dorsey’s Block, the financial tech company that runs Square and the Cash app, is cutting its workforce by “nearly half” and axing more than 4,000 jobs. The company will shrink from more than 10,000 people to less than 6,000, Dorsey says in a post on X . And the reason why? AI. “We’re not making this decision because we’re in trouble,” Dorsey says. “Our business is strong. Gross profit continues to grow, we continue to serve more and more customers, and profitability is improving. But something has changed. We’re already seeing that the intelligence tools we’re creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company. And that’s accelerating rapidly.” Dorsey opted to do a big layoff instead of gradual cuts because “I’d rather take a hard, clear action now and build from a position we believe in than manage a slow reduction of people toward the same outcome.” The layoffs were announced on Thursday as part of the company’s Q4 2025 earnings. In a shareholder letter, Dorsey says that “We believe Block will be significantly more valuable as a smaller, faster, intelligence-native company. Everything we do from here is in service of that.”",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/gettyimages-1233275044.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Worldwide Smartphone Market to Decline 13% in 2026, Marking the Largest Drop Ever Due to the Memory Shortage Crisis, according to IDC",
      "url": "https://www.idc.com/resource-center/press-releases/wwsmartphoneforecast4q25/",
      "published": "2026-02-26T22:09:45+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.idc.com/resource-center/press-releases/wwsmartphoneforecast4q25/\">https://www.idc.com/resource-center/press-releases/wwsmartphoneforecast4q25/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=47172664\">https://news.ycombinator.com/item?id=47172664</a></p> <p>Points: 196</p> <p># Comments: 191</p>",
      "content_text": "Skip to main Skip to search Skip to footer Worldwide Smartphone Market to Decline 13% in 2026, Marking the Largest Drop Ever Due to the Memory Shortage Crisis, according to IDC Share BOSTON, February 26, 2026 – Worldwide smartphone shipments are forecast to decline 12.9% year-on-year (YoY) in 2026 to 1.1 billion units, according to the International Data Corporation ( IDC ) Worldwide Quarterly Mobile Phone Tracker . This decline will bring the smartphone market to its lowest annual shipment volume in more than a decade. The current forecast represents a sharp decline from our November forecast amid the intensifying memory shortage crisis. “What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain, with ripple effects spreading across the entire consumer electronics industry,” said Francisco Jeronimo , vice president for Worldwide Client Devices, IDC. “The global smartphone market, particularly Android manufacturers, faces a significant threat. Vendors whose business is mainly at the low end of the market are likely to suffer the most. Rising component costs will hit their margins, and they will have no choice but to pass the costs on to end users. By contrast, Apple and Samsung are better positioned to navigate this crisis. As smaller and low-end-positioned Android vendors struggle with rising costs, Apple and Samsung could not only weather the storm but potentially expand market share as the competitive landscape tightens.” “The memory crisis will cause more than a temporary decline; it marks a structural reset of the entire market, fundamentally reshaping long‑term TAM (Total Addressable Market), the vendor landscape, and the product mix,” said Nabila Popal , senior research director with IDC’s Worldwide Quarterly Mobile Phone Tracker . “We expect consolidation as smaller players exit, and low-end vendors face sharp shipment declines amid supply constraints and lower demand at higher price points. Although shipments will witness a record drop, Smartphone ASP is projected to rise 14% to a record $523 this year. While memory prices are projected to stabilize by mid-2027, they are unlikely to return to previous level — making the sub-$100 segment (171 million devices) permanently uneconomical. In short, there is no return to business as usual for vendors and consumers.” Regionally, markets with a high concentration of low-end smartphones are forecast to decline the most. Middle East & Africa will face the steepest drop at 20.6% YoY, while the world’s largest two markets, China and Asia Pacific (excluding Japan and China), are expected to decline 10.5% and 13.1%, respectively. As the crisis begins to stabilize by mid-2027, IDC forecasts a modest recovery of 2% that year, followed by a stronger rebound of 5.2% YoY in 2028. Worldwide Smartphone Forecast, 4Q25 Release IDC Tracker products provide accurate and timely market size, vendor share, and forecasts for hundreds of technology markets from more than 100 countries around the globe. Using proprietary tools and research processes, IDC’s Trackers are updated on a semiannual, quarterly, and monthly basis. Tracker results are delivered to clients in user-friendly Excel deliverables and on-line query tools. For more information about IDC’s Worldwide Quarterly Mobile Phone Tracker, please contact Jackie Kliem at 508-988-7984 and jkliem@idc.com . Click here to learn about IDC’s full suite of data products and how you can leverage them to grow your business. International Data Corporation (IDC) is the premier global provider of trusted technology intelligence, advisory services, and events. With more than 1,000 analysts worldwide, IDC offers global, regional, and local expertise on technology, IT benchmarking and sourcing, and industry opportunities and trends in over 100 countries. IDC’s analysis and insights help IT professionals, business executives, and the investment community to make fact-based technology decisions and to achieve their key business objectives. To learn more about IDC, please visit www.idc.com . Follow IDC on X at @IDC and LinkedIn . Subscribe to the IDC Blog for industry news and insights. All product and company names may be trademarks or registered trademarks of their respective holders. Key Categories Subscribe to our newsletter Get notified when we publish new press releases and market research Contact Our Press Team Please direct all media and press-related inquiries to the IDC press team via email. Email us IDC Environmental Policy International Data Group is committed to protecting the environment, the health and safety of our employees, and the community in which we conduct our business. It is our policy to seek continual improvement throughout our business operations to lessen our impact on the local and global environment. We are committed to environmental excellence, pollution prevention and to purchasing products that reduce the use of natural resources. We fulfill this mission by a commitment to: Encouraging all partners to share in our mission Understanding environmental issues and sharing information with our partners Recognizing that fiscal responsibility is essential to our environmental future Instilling environmental responsibility as a corporate value Developing innovative and flexible solutions to bring about change Using our platforms and position in the IT industry to promote sustainability Minimize air travel to help reduce our impact on the environment Minimize use of materials and energy consumption in our offices Create a working environment that efficiently uses our office space Develop and maintain a hybrid working model that benefits both our employees and business partners Encourage employees to measure, minimize and collaborate on reducing energy consumption at home and in the office Engaging employees and promoting active participation in environmental and sustainability initiatives × Leaving? You are about to leave this section. Do you wish to continue? Cancel Continue ×",
      "cover_image_url": "https://www.idc.com/wp-content/uploads/2026/02/Chart-for-WW_Forecast_PR_4Q25-1.png"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Lenovo leak reveals a foldable gaming handheld that’s also a Windows laptop",
      "url": "https://www.theverge.com/tech/885656/lenovo-legion-go-fold-concept-leak",
      "published": "2026-02-26T22:08:15+00:00",
      "summary": "Lenovo's next gaming laptop could be a shapeshifting foldable called the Legion Go Fold, which can be used as a laptop or a handheld gaming PC with two different display sizes, as WindowsLatest reports. Leaked images of the device show it attached to both a keyboard and controllers, with a hinge in the middle of [&#8230;]",
      "content_text": "Lenovo’s next gaming laptop could be a shapeshifting foldable called the Legion Go Fold, which can be used as a laptop or a handheld gaming PC with two different display sizes, as WindowsLatest reports. Leaked images of the device show it attached to both a keyboard and controllers, with a hinge in the middle of the POLED display, allowing it to unfold from 7.7 inches to 11.6 inches. Users can attach the controllers with the display folded or unfolded, use the display in a vertical split screen mode, or attach it to the keyboard for laptop mode, for a total of four different form factors rolled into one device. Even the controllers are convertible: the right side controller can be used as a vertical mouse in “FPS Mode,” similar to the mouse mode on the Legion Go 2 or the Nintendo Switch 2 . The right-side controller also has a built-in display that shows performance metrics and settings and doubles as a touchpad. The Legion Go Fold is rumored to include an Intel Core Ultra 7 258V CPU, 32GB of RAM, and a 48 Whr battery. According to WindowsLatest , Lenovo plans to announce it as a concept device at Mobile World Congress (MWC) in Barcelona next week, although it likely wouldn’t be commercially available right away, if ever.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/lenovo-legion-go-fold-handheld-mode-windows-latest.jpg?quality=90&strip=all&crop=0,15.095986038394,100,69.808027923211"
    }
  ]
}