{
  "industry": "technology",
  "collected_at": "2026-02-10T11:22:10.900865+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "technology",
      "source": "Wired",
      "title": "The Best Streaming Bundles and Streaming Deals of January 2026",
      "url": "https://www.wired.com/story/best-streaming-deals-and-streaming-bundles/",
      "published": "2026-02-10T11:01:00+00:00",
      "summary": "Here are the current best bundles from the most popular services.",
      "content_text": "The first Streaming deals of 2026 are already rolling in, and they're needed. A number of streaming services, most notably Paramount and Disney, increased their prices at the end of last year and the beginning of this one. The best January streaming deals are mostly bundles and annual price cuts. It's not an eye-poppingly low number, but you can get a 4K-streaming, ad-free bundle of HBO Max, Disney+, and Hulu for $33. That's more than 40 percent off—or $23 less than list price. But most important: no ads. Disney is newly offering a minimal $3 incentive for those who want to try an ad-supported Disney/Hulu bundle. But my biggest revelation, after the Black Friday deals blitz, has been that deals with ads are often no deal at all. It turns out I don't like ads. No ads means no regret when the climactic scene in an old Homeland episode is abducted by a discount car insurance company instead of whoever else was supposed to do the abducting. This said, the ad-supported HBO/Disney bundle is also on a 40-percent-off deal. And so are a number of other bundles—so many bundles, including an Apple TV/Peacock bundle that'll let you stream the last NFC playoff games and the Super Bowl for barely more than the price of Apple TV on its own. Here's a quick guide to the best streaming deals and streaming bundles in January 2026. Note that we're not including every TV streaming offer on the planet, just the ones that are actually good deals at the moment. Updated January 2026: I've updated Disney bundles and Paramount deals and added annual deals for HBO and ESPN, as well as media bundles for Netflix. I also updated prices and descriptions throughout. Still from Tron: ARES. Courtesy of Disney Regular ad-free bundle: $13 a month Deal: $10 a month for 1 month Bundle with no ads: $20 a month Disney and Hulu fundamentally don't exist separately anymore as streaming entities. It's technically possible to get a stand-alone Hulu account , but it costs only a buck less than getting Hulu with Disney. And for the moment, until the deal ends February 17, it actually is cheaper to bundle Hulu and Disney than to get Hulu alone, at least for a month. Disney/Hulu is offering $3 off the first (but only the first) month's subscription, a deal that's notable only because it's the first new Disney bundle deal of 2026.",
      "cover_image_url": "https://media.wired.com/photos/6940951c5ef9ba38705f23ee/191:100/w_1280,c_limit/The%20Best%20Streaming%20Deals%20top%20art%20122025%20SOURCE%20HBO%20Max.jpg"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "These Hackers Are Turning Dead Vapes Into Musical Synthesizers",
      "url": "https://www.wired.com/story/hackers-turning-dead-vapes-into-musical-synthesizers/",
      "published": "2026-02-10T11:00:00+00:00",
      "summary": "Instead of throwing that spent Elf Bar nicotine vape into the trash, you can pull most of the guts out, plug in a circuit board and some controls, then suck on the mouthpiece to play digital sounds.",
      "content_text": "Vapes are bad for your body and definitely bad for the planet; the world’s landfills are stuffed with disposable vape cartridges. But now there’s a way to give all that e-waste a more pleasant tune. The Vape Synth is a project created by a group of makers in New York City who break apart spent Elf Bar nicotine vaporizers and hack them into digital musical instruments. The resulting device still looks like a vape cartridge, but with a small speaker nestled amid an array of lights and buttons. To play it, you put your mouth on it and draw your breath inward, like you would on a vape. Think of it like a digital ocarina . The Vape Synth repurposes the vaporizer's existing low-pressure sensor. By sucking wind through the sensor—maybe it's a reverse digital ocarina—you trigger an oscillator circuit and generate an audio signal. Pressing the buttons triggers different tones. The noises that come out are, frankly, screechy and chaotic. ( This is what it sounds like .) The people who made the Vape Synth know it sounds goofy. That’s the point. “We started from a very silly place,” says Kari Love, one of Vape Synth’s creators. “We have to use the low pressure sensor. Which means to play it, you must suck.” Love and David Rios are professors at New York University’s Interactive Telecommunications Program. Shuang Cai is a PhD student at Cornell University and teaches at NYU and Cornell. They are all self-described salvage hoarders and makers who work on the Vape Synth project under the moniker Paper Bag Team. (None of them vape nicotine.) The three have presented the Vape Synth in talks like the Open Hardware Summit and run workshops to build them at events like the 2025 Low Tech Electronics Faire . Another workshop was held this past weekend at the hacker collective NYC Resistor in Brooklyn. The team also just released a thorough guide via Instructables on how to hack your very own vapes into synths. “They're this huge e-waste product,” Love says of spent vapes. “You see them everywhere. They have the lithium ion batteries, which makes them particularly insidious in the disposable tech world.” Handmade Vape Synths with speakers, buttons, and photoresistors on top. There's a circuit board inside each, and the design utilizes the vape's existing battery and low pressure sensor. Photograph: Calvin Leon When Juul, once the king of vapes, was ordered by the FDA to pull its product from US markets, it cleared the way for other—entirely disposable—vape devices to flood the shelves. The already multi-billion-dollar vape business exploded, with devices pouring in from countries like China and birthing dozens of brands with names like SoundCloud rap song titles. (Pillow Talk, Hyppe Bar, PolkaDot, Puff Bar.)",
      "cover_image_url": "https://media.wired.com/photos/698a3eae492be1db63068444/191:100/w_1280,c_limit/Vape-Musical-Synthesizer-Gear-Screenshot-2026-02-05%20at%205.08.47%E2%80%AFPM.png"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "The Best Walking Pads for Working From Home (2026)",
      "url": "https://www.wired.com/story/best-walking-pads/",
      "published": "2026-02-10T10:30:00+00:00",
      "summary": "Our remote team clocked serious hours walking, working, and sometimes jogging to find the best under-desk treadmills for home offices and small spaces.",
      "content_text": "Updated February 2026: I've added Urevo SpaceWalk 5L Smart Walking Pad and Lifesmart TM2202 3-in-1 Treadmill to our Honorable Mentions. I've added a product comparison chart and an FAQ section that includes our testing methodology. I've added more specs, pros and cons to all products and updated prices and links. Best Overall AccordionItemContainerButton WIRED Impressive 14 percent incline capability Easy to set up, control, and track steps Durable and stable feel TIRED Limited speed range Could be quieter Too tall to store under furniture Most walking pads feel the same and have similar capabilities, but the Urevo CyberPad stands out. It offers a 14-percent incline, which is the highest I’ve seen on a walking pad. With the ability to tackle steeper walks, I felt like I could actually get a major sweat going without sacrificing my focus on work, unlike when I try to push the pace, which makes it harder to type. It was ready to use right out of the box and easy to set up (a huge win in my book—I do not dream of fitness-equipment assembly). It’s a bit heavier than some other options on this list, so moving it around isn’t as easy, but the wheels help. The speed tops out at 4 mph, and the incline stops at level nine, which can be either a 9- or 14-percent incline, depending on how you position the machine’s feet. The CyberPad has a Bluetooth remote and app that are easy to connect to the machine, allowing you to control it. The app also offers workouts, if you want to virtually walk in some pretty scenery. As long as you open the app at some point during your walk, it’ll log your workout data from the machine, so you can keep track of daily step counts over time. You can also view your current workout metrics on a screen at the front of the machine. With a solid feel underfoot and a comfortable belt, I’m confident in this pad’s durability. One thing to note: The incline capability makes it taller and harder to store. It also has fun lights along the side rails (think car underglow). You can turn them on in the app and set the color and patterns to whatever inspires you to get on and walk. It’s the little things. — Kristin Canning Best Budget AccordionItemContainerButton WIRED More affordable than its competitors Lightweight and easy to store under furniture Includes a built-in vibration mode TIRED Can be noisy despite company's claims The companion app doesn't add much value No auto-shutoff function This little guy is a top pick on Reddit and a bestseller on Amazon. Weighing just 27 pounds, it's incredibly lightweight and durable, with a maximum weight capacity of 350 pounds. It's easy to carry and assemble. Reviewer Kristin Canning said she had it out of the box and running in just minutes. Because it's only 3.5 inches tall, she was able to slide it under her couch or prop it against a wall when not in use.",
      "cover_image_url": "https://media.wired.com/photos/698a2d1c96a5f6f94a9077c0/191:100/w_1280,c_limit/Update-%20Best%20Walking%20Pads.png"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "The Epstein Network Visualizer",
      "url": "https://epsteinvisualizer.com/",
      "published": "2026-02-10T10:06:34+00:00",
      "summary": "<p>Article URL: <a href=\"https://epsteinvisualizer.com/\">https://epsteinvisualizer.com/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46957584\">https://news.ycombinator.com/item?id=46957584</a></p> <p>Points: 27</p> <p># Comments: 0</p>",
      "content_text": "<p>Article URL: <a href=\"https://epsteinvisualizer.com/\">https://epsteinvisualizer.com/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46957584\">https://news.ycombinator.com/item?id=46957584</a></p> <p>Points: 27</p> <p># Comments: 0</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "The Best Smart Sleep Pads for Your Most Efficient Sleep (2026)",
      "url": "https://www.wired.com/story/best-smart-sleep-pads/",
      "published": "2026-02-10T10:02:00+00:00",
      "summary": "Get tracking, temperature regulation, and other smart features without the hassle or investment of a smart bed.",
      "content_text": "Sleep tech only seems to be getting more pervasive, permanent, and pricey. One day, you start checking your sleep rings on your Apple Watch , the next, you find yourself shopping for smart mattresses that require you to rethink your entire bed, fans that blow cool air under your duvet , and subscription apps that promise sleep coaching with hyper-granular data. Smart sleep pads are a good middle ground. They don’t require you to replace your bed and frame , strap anything to your body, or radically change your routine. They just sit on or underneath your mattress or pillow , and quietly do their thing—from tracking to temperature regulation—while you sleep. Some smart sleep pads adjust temperature, while others monitor movement or ever-so-slightly influence your sleep patterns. Either way, they’re easy to live with, which feels closer to how we think tech should behave at night. I tested several sleep pads on the same bed, during a Midwestern winter, to see which ones truly felt like they made a difference, and which felt more like experiments than solutions. All testing was done on a king-size Purple Restore Cool Touch mattress with a standard fitted cotton sheet and my beloved Mellow comforter . Using the same bed, bedding, and sleep routine throughout helped isolate what each pad actually changed (or didn’t) about my sleep. As a way to measure and mildly improve sleep without rethinking your entire routine, they were surprisingly effective. Be sure to check out our other sleep-related guides, including the Best Mattresses , Best Mattress Toppers , Best Sheets , and Best Sleep Trackers . Jump to Section AccordionItemContainerButton Best for Temperature Regulation Photograph: Nicole Kinning Perfectly Snug The Smart Topper Every night, what excites me most about crawling into bed (other than catching up on a few episodes of Below Deck ), is knowing that I’m about to settle into a warm one. The Smart Topper from Perfectly Snug is a temperature-regulating mesh pad that fits on top of your mattress underneath your fitted sheet, actively warming and cooling you while you sleep. I was hesitant at first: I’m extremely loyal to my Purple mattress and didn’t want to give up its pillowy surface. Perfectly Snug’s airy pad was surprisingly supportive and comfortable, landing somewhere around a medium-firm feel. Setup is straightforward: Plug it in, lay it on the bed, put fresh sheets over it, and connect to Wi-Fi via Perfectly Snug’s app. From there, you enter your weekly bedtime and wake-up schedule and adjust settings such as foot-heater strength and the aggressiveness of cool bursts. Once programmed, the pad starts warming up an hour before your set bedtime. If you have the Dual Zone option, each side of the bed can be adjusted independently, which spared my husband from my preference for warmth. The app’s interface does feel a little beta, like it belongs on an old iPod Touch next to Temple Run , but it works. From there, your night’s temperature is (mostly) in the Smart Topper’s hands. Cooling happens through the nearly silent fans that kick on when sensors detect rising body heat, and it’ll warm you when it senses you’re getting cold. If you want to override the automation, physical buttons on the side of the topper let you adjust cooling or heating without having to squint at your phone in the middle of the night. For anyone who runs hot at night, the Smart Topper’s an effective, fuss-free way to stay comfortable. Value: 9/10: The Perfectly Snug smart topper is pricey up front, but it delivers something that would otherwise require a new mattress or higher power bills. For hot sleepers especially, the cooling feature can replace multiple workarounds (fans, AC toggles, frequent sheet changes). Comfort: 8/10: The pad is noticeable, but not bothersome. It does slightly change the feel of your mattress, but the mesh construction is breathable and supportive. And once you’re used to it, the real comfort payoff is exactly what the pad’s for: consistent temperature regulation.",
      "cover_image_url": "https://media.wired.com/photos/698a4225292b44e9587a91c4/191:100/w_1280,c_limit/The%20Best%20Smart%20Sleep%20Pads%20to%20Boost%20Your%20Sleep%20Quality.png"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Grindr trials premium $500 per month plan to become 'AI-first' app",
      "url": "https://www.thepinknews.com/2026/02/09/grindr-trials-premium-500-per-month-plan-to-become-ai-first-app/",
      "published": "2026-02-10T09:39:00+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.thepinknews.com/2026/02/09/grindr-trials-premium-500-per-month-plan-to-become-ai-first-app/\">https://www.thepinknews.com/2026/02/09/grindr-trials-premium-500-per-month-plan-to-become-ai-first-app/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46957360\">https://news.ycombinator.com/item?id=46957360</a></p> <p>Points: 16</p> <p># Comments: 29</p>",
      "content_text": "Grindr. (Leon Neal/Getty Images) Gay hook-up app Grindr is currently trialing a new ultra-premium subscription plan – that uses artificial intelligence and costs members $500 per month. The plan, called EDGE, is being tested with a selection of users in the US, Canada, Australia and New Zealand, with prices ranging from $349.99 to $499.99. Grindr has confirmed that EDGE will not replace the current Grindr Unlimited subscription service, but rather sit above it. READ MORE: Grindr announced extra safety measures for LGBTQ+ athletes at Winter Olympics In a post shared to the app’s website , Grindr announced that it would become an AI-first company, which it says means “a faster, smarter, more personalised app that helps you connect with less effort and makes every conversation count”. Powered by gAI™, Grindr’s own AI stack, EDGE is embedded across the entire user journey of the app. New AI features include recaps of previous conversations with other users, daily personalised profile recommendations and profile insights to help users identify who they are more likely to be compatible with. The high price point has been met with scepticism from many users online. “$500 a month? At that point just hire a matchmaker and a therapist,” wrote one person. “You can spend as much money as you want on Grindr to increase your presence on the grid, expand your reach, and whatever else, but if you’re chopped, you’re chopped,” said another. Share your thoughts! Let us know in the comments below, and remember to keep the conversation respectful. Please login or register to comment on this story.",
      "cover_image_url": "https://www.thepinknews.com/wp-content/uploads/2025/06/Grindr-.jpeg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Qwen",
      "url": "https://qwen.ai/blog?id=qwen-image-2.0",
      "published": "2026-02-10T09:19:00+00:00",
      "summary": "<p>Article URL: <a href=\"https://qwen.ai/blog?id=qwen-image-2.0\">https://qwen.ai/blog?id=qwen-image-2.0</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46957198\">https://news.ycombinator.com/item?id=46957198</a></p> <p>Points: 89</p> <p># Comments: 50</p>",
      "content_text": "",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "The first signs of burnout are coming from the people who embrace AI the most",
      "url": "https://techcrunch.com/2026/02/09/the-first-signs-of-burnout-are-coming-from-the-people-who-embrace-ai-the-most/",
      "published": "2026-02-10T06:46:55+00:00",
      "summary": "Because employees could do more, work began bleeding into lunch breaks and late evenings. The employees' to-do lists expanded to fill every hour that AI freed up, and then kept going.",
      "content_text": "The most seductive narrative in American work culture right now isn’t that AI will take your job. It’s that AI will save you from it. That’s the version the industry has spent the last three years selling to millions of nervous people who are eager to buy it. Yes, some white-collar jobs will disappear. But for most other roles, the argument goes, AI is a force multiplier. You become a more capable, more indispensable lawyer, consultant, writer, coder, financial analyst — and so on. The tools work for you, you work less hard, everybody wins. But a new study published in Harvard Business Review follows that premise to its actual conclusion, and what it finds there isn’t a productivity revolution. It finds companies are at risk of becoming burnout machines. As part of what they describe as “in-progress research,” UC Berkeley researchers spent eight months inside a 200-person tech company watching what happened when workers genuinely embraced AI. What they found across more than 40 “in-depth” interviews was that nobody was pressured at this company. Nobody was told to hit new targets. People just started doing more because the tools made more feel doable. But because they could do these things, work began bleeding into lunch breaks and late evenings. The employees’ to-do lists expanded to fill every hour that AI freed up, and then kept going. As one engineer told them, “You had thought that maybe, oh, because you could be more productive with AI, then you save some time, you can work less. But then really, you don’t work less. You just work the same amount or even more.” Over on the tech industry forum Hacker News, one commenter had the same reaction , writing, “I feel this. Since my team has jumped into an AI everything working style, expectations have tripled, stress has tripled and actual productivity has only gone up by maybe 10%. It feels like leadership is putting immense pressure on everyone to prove their investment in AI is worth it and we all feel the pressure to try to show them it is while actually having to work longer hours to do so.” It’s fascinating and also alarming. The argument about AI and work has always stalled on the same question — are the gains real? But too few have stopped to ask what happens when they are. Techcrunch event Boston, MA | June 23, 2026 The researchers’ new findings aren’t entirely novel. A separate trial last summer found experienced developers using AI tools took 19% longer on tasks while believing they were 20% faster. Around the same time, a National Bureau of Economic Research study tracking AI adoption across thousands of workplaces found that productivity gains amounted to just 3% in time savings , with no significant impact on earnings or hours worked in any occupation. Both studies have gotten picked apart. This one may be harder to dismiss because it doesn’t challenge the premise that AI can augment what employees can do on their own. It confirms it, then shows where all that augmentation actually leads, which is “fatigue, burnout, and a growing sense that work is harder to step away from, especially as organizational expectations for speed and responsiveness rise,” according to the researchers. The industry bet that helping people do more would be the answer to everything, but it may turn out to be the beginning of a different problem entirely. The research is worth reading, here .",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2022/10/GettyImages-1158287360-e1665956231123.jpg?resize=1200,676"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "KitchenAid Promo Codes and Discounts: Save Up to $500",
      "url": "https://www.wired.com/story/exclusive-kitchenaid-promo-code/",
      "published": "2026-02-10T06:10:00+00:00",
      "summary": "Save on every purchase with top KitchenAid coupons from WIRED, including up to $500 off select major appliances.",
      "content_text": "KitchenAid’s strategy is one that maybe we should all live by—if it ain’t broke, don’t fix it. Remaining nearly unchanged since its introduction in 1914, KitchenAid’s stand mixer has become such a legendary kitchen staple that we called the KitchenAid Artisan 7-Quart Lift Stand Mixer an “everlasting” kitchen must-have and put it on our Buy It For Life guide. KitchenAid’s heralded and beloved kitchen appliances luckily run regular sales so that you can get these great, but pricey, essentials for less. Save up to $500 With KitchenAid Promo Codes and Deals One of the best perks of shopping online at KitchenAid are the rotating deals and discounts on some of their best-selling appliances. If you really want to level up this spring, consider these sleek, lifetime-lasting appliances from KitchenAid. You can save big for a limited time with the KitchenAid Presidents' Day Sale where you can buy more to save more. When you buy 2, you can save $100; when you buy 3, you’ll save $300; when you buy 4 or more, you’ll save $500 on select major appliances, through February 25. Other awesome deals include free delivery and haul away on major appliances over $399 when signed in to your KitchenAid account, through February 25. You can also save up to $170 on select stand mixers, up to $250 off select espresso machines, and up to 50% off on select refurbished stand mixers, all through February 21. Plus, you can save 50% on the 5 Quart Horizontal Stripes Ceramic Bowl through February 16. Save 15% With These KitchenAid Promo Codes and Deals One of the best perks of shopping online at KitchenAid are the rotating deals and discounts on some of their best-selling appliances. If you really want to level up this Valentine's Day, consider the gift of a sleek, lifetime-lasting appliance from KitchenAid. You can save big for a limited time with the KitchenAid Savings event, where you can save an extra $10 when you spend $100; get $20 off $200; and $30 off $300 with KitchenAid promo code VALENTINE (through February 7). Are you hosting a SuperBowl party? Don’t get bogged down with cumbersome appliances and messy hand mixers. Level up your countertop appliances with 15% off, and be ready to cook up your fan favorites with KitchenAid promo code GAMEDAY (through February 7). Score 15% Off With a KitchenAid Professional Discount Speaking of great offers, there are other KitchenAid promo codes specifically for essential workers , like teachers, students, healthcare workers, military, first responders - and those over 50. If you are a member of one of those groups, all you need to do is verify your account with SheerID to receive the extra discounts (on top of any other accounts if you are an account holder). The verification form is in the “Profile Information” tab under “My Account” on KitchenAid’s site . Don’t fall into one of these categories? No worries! Those who have recently moved can also save 15% . Enjoy Year-Round Savings at KitchenAid Even without a discount code on hand, you can still save with regular deals, like great savings on refurbished items and free delivery on all appliances sitewide. Account holders also get access to exclusive perks and discounts sitewide—all you have to do is create an account. Be on the lookout for other great savings events from KitchenAid (like a discount on that mixer you’ve been eyeing all year long). How to Redeem a KitchenAid Promo Code Whether you’re shopping for a highly-rated cold brew coffee maker, a 5-speed hand mixer that's great for saving countertop space, or a quiet electric kettle, we have the best KitchenAid promo codes to help you save on all your for-life kitchen products. When you’ve found a deal you want to use, like one of our promo codes listed above, simply paste the code in the box at checkout to save (remember to double-check whether you need to sign up for an account first). If the deal doesn’t require a special coupon, just put it in your cart, and the sale will be automatically applied—easy as pie.",
      "cover_image_url": "https://media.wired.com/photos/66ea076ea6cbbaa16c12af30/191:100/w_1280,c_limit/WIRED-Coupons-12.jpg"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "20% Off LG Promo Code & Coupons",
      "url": "https://www.wired.com/story/lg-promo-code/",
      "published": "2026-02-10T06:07:00+00:00",
      "summary": "Save 20% with an LG promo code today, plus up to $1,000 off appliances, 40% off bestselling TVs and monitors.",
      "content_text": "LG makes some of the best TVs you can buy. Its OLED TVs in particular are perennial favorites at WIRED, with C-series models like the C4 ( 9/10, WIRED Recommends ) providing among the best performance for your dollars on the market. LG is about way more than TVs of course. The Korean brand offers multiple products across the A/V landscape, from soundbars to Bluetooth speakers , along with a host of other products to upgrade your home setup. Save over 40% with LG promo codes and online exclusive discounts on home appliances, gaming monitors, and more tech. Save 20% With Today’s LG Promo Codes If you’re looking to save on LG gear today, you can get up to 20% back on your first order with select eligible products when you sign up for LG rewards with your email address. Simply go to the My LG Membership rewards page , follow the instructions to sign up and save. If you’re ready to check out one of those TVs mentioned above, LG’s C4 and the ultra-bright step-up model G4 are both eligible right now in 77-inch sizes. Otherwise, there are plenty of other products to shop currently on sale that you stack with MyLG Rewards for 5% back and points on every purchase. Watch for LG Fridge Deals and Price Drops One of the most sought after appliances from the brand is the LG fridge . While we don’t have any set LG promo codes and discounts for refrigerators now, be sure to check back often and track price changes on these sought-after powerhouse appliances. The Counter-Depth French Door Refrigerator is a sleek, three-door stainless steel machine with a fancy ice maker and luxe mirror design. The Side-By-Side InstaView Refrigerator is the fridge of the future, with a translucent door to easily see what’s inside the fridge without having to open the door. The simple Single Door Refrigerator features a clean, compact design and easy-to-reach organization. Students, Teachers, and First Responders Get a 10% Off LG Promo Code Looking for further discounts? If you’re a teacher, student, or first responder, you could receive an additional LG Promo Code for more savings. To see if you’re eligible, simply click on the LG Appreciation Program link and follow the info to register your account. Exclusive discounts include free installation on refrigerators, cooking ranges, and washer/dryers, including select LG Studio and LG Signature appliances. You could also get year-round savings on LG products with a minimum guaranteed discount of 10% compared to sale prices you’ll find on their website. Get up to 20% Back With MyLG Rewards or 5% Off Referral Code With MyLG Rewards, you can get up to 20% back in rewards , as well as exclusive deals, extended warranties, and free installation. Eligible rewards members can get an additional 5% off LG products if you refer a friend or loved one with the LG Referral program when they make an eligible purchase of $200 or more. They’ll get 5% off, and you’ll earn 5,000 MyLG Rewards points, so it’s a win-win. This coupon is stackable with other promotions too, so you can still take advantage of the many other featured discounts. Save $1,000 on Appliances With Winter Bundle Offers During LG’s Presidents’ Day Sale, taking place now through February 25, you’ll save (a lot) more. Some of LG’s most advanced appliances are over 30% off, like smart refrigerators, washer and dryers, oven ranges, and more. Plus up to $1,000 in savings is up for grabs. This includes buy one get one free bundle offers , where you’ll get a free single-door fridge when you purchase a French Door model. That doesn’t just mean extra storage for overflow; you’ll save up to $515. Plus, when you bundle 2 or more eligible appliances, you’ll get up to $800 off, through April 8. You can also get a free vacuum when you purchase a single unit LG WashTower. To sweeten the pot further, most major appliances come with free delivery to your room of choice and free installation.",
      "cover_image_url": "https://media.wired.com/photos/67b63b985a505b018b67ed90/191:100/w_1280,c_limit/WIRED-Coupons-R2_17.png"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "H&R Block Coupons and Deals: 20% Off Tax Prep in 2026",
      "url": "https://www.wired.com/story/hr-block-coupon/",
      "published": "2026-02-10T06:05:00+00:00",
      "summary": "Save up to 20% and get up to $4,000 with a Refund Advance Loan at H&amp;R Block this tax season.",
      "content_text": "As they say, the only things you can't escape in life are death and taxes. Doing your own taxes has only gotten easier over the years but it’s still plenty confusing, especially with both federal and state rules and rates always in flux. To help you figure out this confusing process, I’ve written a guide on How to Pay Your Taxes Online , and included H&R Block and other competitors to give you more information as you navigate between the seemingly endless options available for your specific tax needs. Tax day may not be until April 15 but as we all know too well, that date comes around quickly each year. With that in mind, now’s a great time to start getting your affairs in order. For 70 years, H&R Block has stepped in to help with tax preparation services that aim to make things as painless as possible. H&R Block has its classic in-person help from a tax expert along with easy-to-use online tax services that you can complete online while in your pajamas. We here at WIRED love to help you save money too, and that’s why we have rotating deals and H&R Block coupons to help ease the pain of tax season a little more. Can I File My Taxes for Free at H&R Block? H&R Block knows taxes are confusing, and the process is one that no filer looks forward to. That’s why H&R Block eases some of the tax filing woes by offering H&R Block Online Free Edition . Over half (around 55% of filers) qualify; this service is for simple taxes only, meaning Form 1040s and no schedules except Earned Income Tax Credit, Child Tax Credit, Student Loan Interest, and Retirement Plan Distributions. File your simple state return for free on H&R Block today. Don’t Go at it Alone With H&R Block Assistance Options Tax assist options are available, whatever your need. Not a CPA or DIY-er? No problem. H&R Block’s tax experts are trained and ready to help with big and small tax questions. There are tons of choices, no matter your need, like a one-on-one meeting in an office where you can make an appointment ahead of time, or just walk in; from home where you can work with your Tax Pro online; and you can even drop off files at an H&R Block office. Plus, you can even get a free Second Look Review of past returns to see if there was money left on the table. Get Up to $4,000 With a Refund Advance Loan at H&R Block If you can’t wait on your refund (no judgement; I get it), you can get up to $4,000 in refunds immediately after filing, without waiting for the slow-moving federal and state processes. If eligible, you can get a Refund Advance loan within minutes of filing when you complete the process with an H&R Block Tax Pro. With this loan advance, there’s no loan fees or interest. Act sooner rather than later, as this deal is only available through March 15. How Much Does H&R Block Charge? H&R Block has different tiers depending on tax filing needs, so you can pick the online filing option that works best for you. The free online is best for simple returns, with $0 per state filed; deluxe starts at $28 for federal and $37 per state filed, which includes itemized deductions and free tax Pro review. Premium is now only $56 and $37 per state filed, and also includes investments and free tax Pro review. Plus, they have an option for self-employed folks and business owners, whose taxes can be complicated and costly. That service includes 1099 forms with expenses and includes free tax Pro reviews, and costs $68 right now with $37 per state filed. How Do I Get an H&R Block Key Code? An H&R Block Activation Code is a unique ten-character code that’s attached to your personal H&R Block Tax Software. It’ll be a long string of uppercase letters and numbers. This activation code registers your software and is used to unlock your five free federal e-files. Once opened, you’ll need to enter it to activate the software. More in-depth directions and troubleshooting can be found here . Other Deals for New and Existing H&R Block Customers To find which service best fits your needs, select all that apply to you—like if you have kids, own a home, or are a freelancer—to find your best personal filing experience. H&R Block has four different packages, including federal and state. Best of all, you can save 20% on H&R Block tax software products without an H&R Block promo code (until April 15). H&R Block has tons of incentives and perks, including a free 3-year Second Look. That means H&R Block will review your last three tax returns to find errors, mistakes, or money others may have missed. Get your taxes done and spend the rest of the spring chilling; DIY online file, or get an in-store assisted file for less—no H&R Block coupon needed.",
      "cover_image_url": "https://media.wired.com/photos/66ea077015aa1d8092e99428/191:100/w_1280,c_limit/WIRED-Coupons-6.jpg"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "TurboTax Service Codes: Up to 20% Off",
      "url": "https://www.wired.com/story/turbotax-coupon/",
      "published": "2026-02-10T06:00:00+00:00",
      "summary": "Tax season doesn’t have to be stressful. Save up to 20% on federal tax filings, $40 off Expert Assist, and more exclusive TurboTax discount codes on WIRED.",
      "content_text": "TurboTax has been my go-to for self-filing taxes for years. It’s good enough for me—and literally millions of other users. TurboTax has quickly become a favorite among users for its easy-to-use self-filing services, along with easy access to assistance from tax professionals. TurboTax has free self-service for qualifying people, and TurboTax Live Assisted, where you file online with tax expert help if needed, and TurboTax Full Service, where a tax expert will do your taxes and review them with you before filing. To help you figure out the often confusing process of filing taxes, I’ve written a guide on How to Pay Your Taxes Online , and The Best Tax Services . In both, I included TurboTax and similar services to help navigate between the options available for your specific tax needs. WIRED also has TurboTax coupons to save money while you begin the always-annoying task of filing your taxes this year. Canadian customers click here , these coupons are not for you. Save 20% With TurboTax Service Codes and 2026 Early Filing Offers Right now, you can get an extra 20% off Federal online tax filings with today’s TurboTax coupons. And best of all, these savings are in addition to the already-applied early-season discount: up to $40 off if you file by February 28th. You can use this TurboTax coupon, for 10% off their most popular online tax products like TurboTax Full Service. This price includes W-2 and 1040, with state returns for an additional fee. With ExpertFull Service, a tax professional will do your taxes for you, which costs a bit more than DIY-ing it, but can save you headaches and messes when it comes to what you owe. Things only get more expensive as tax season approaches, so file now to get the best price of the season. If a TurboTax expert didn’t file for you last year, you’ll get even more in savings if you choose Expert Full Service. This service is now a simple flat fee of $150 for new customers, with Federal and State services included. Act soon, because those switching to TurboTax need to file by February 28 for this special discount. If your taxes are a bit more straightforward, but you still have some questions, TurboTax Expert Assist (Live) offers the best of both worlds, where you file online yourself with tax expert help nearby if you end up needing it. With these TurboTax deals, you’ll get a 20% off TurboTax Live Assisted, with options starting at only $79, Deluxe from $129, and Premium Live Assisted services for $209. (Like the above service, this discount is for Federal tax products and filing early is the best way to ensure you’re getting the lowest price of the season). *Price estimates are provided prior to a tax expert starting work on your taxes. Estimates are based on initial information you provide about your tax situation, including forms you upload to assist your expert in preparing your tax return and forms or schedules we think you’ll need to file based on what you tell us about your tax situation. Final price is determined at the time of print or electronic filing and may vary based on your actual tax situation, forms used to prepare your return, and forms or schedules included in your individual return. Prices are subject to change without notice and may impact your final price. Give a 20% Off TurboTax Discount Code, Get up to $500 To save even more, get a TurboTax referral link , and when your friends use your link, they can get 20% off TurboTax federal products if they’re new customers of the service. As an added bonus, for each friend who files using your link, you’ll get a $25 gift card—you can earn up to a whopping $500 in gift cards (at this point, you’re basically getting another refund in gift cards). Here’s the nitty gritty: friends can receive 20% off the preparation and filing of federal tax return or business federal tax return through a TurboTax Online or TurboTax Live product, through October 31. You’ll get an email with the gift card or charitable donation within 45 days of your friend’s purchase. (Restrictions apply on TurboTax Free Edition, Intuit TurboTax Verified Pro, TurboTax State returns, TurboTax CD/Download products, and other add-on offerings.) Save up to 20% on TurboTax Business Services If you’re a small business owner , Expert Assist is probably the best service for you, with qualified tax experts at the ready to help you with any of those tricky filing questions. Right now, if you file your business tax returns with TurboTax, you’ll get 20% off one 2025 personal federal tax return. This type of service is best for those with S-corps and partnerships, and TurboTax will match you with a small business tax expert who knows your industry to maximize your deductions. In addition to 20% off one personal tax filing offer for business customers , you can also get 10% off Business Expert Full Service and Expert Assist for small business owners. This discount applies to TurboTax federal products only (meaning no state products are included). These massive savings are in addition to early-season discounts. New Customers Can File For Free in the App If you’re unhappy with your old service, or just want to switch to TurboTax, you’ll be able to file your own taxes for free if you do it in the TurboTax app by February 28. If you have simple taxes, filing through your phone app is a great way to save big on usual filing fees. And best of all, this applies to Federal and State taxes, including all tax situations. You’ll just need to make sure you didn’t file with TurboTax last year, and this offer only applies to Do It Yourself, not TurboTax Experts, products. To save big and file for free as a new TurboTax customer, you’ll need to make sure you redeem this offer before midnight on February 28. File for $0 With TurboTax Free Edition As mentioned above, users can file for free with TurboTax free edition . Around 37% of taxpayers qualify. Simple Form 1040 returns only (no schedules except for Earned Income Tax Credit, Child Tax Credit, Student Loan Interest, and Schedule 1-A). While this may not be the blanket service for every type of tax filer, this works for those with simple finances, so do a little research and see if TurboTax free edition may be right for you to save big instead of spending big. TurboTax free edition includes $0 to file for Federal taxes and $0 for State taxes. This service is ideal for simple uploads, like W-2’s, where all you’ll need to do is import, upload, or snap a photo of your W–2 and TurboTax will autofill your info for you, saving you time and potential headaches. There are other ways to save too, with TurboTax discount codes for military members . As a thank you, military members can file their own taxes and get both their federal and state taxes done for free returns only (no schedules, except for EITC, CTC, student loan interest, and Schedule 1-A). Other Free TurboTax Tools for Tax Season In addition to the differing plans for individuals’ needs, TurboTax also has other helpful resources for this tax season, including a Tax Refund Calculator, where you can estimate your 2026 return by answering questions about your life and income. Similarly, TurboTax also offers a Tax Bracket Calculator to help you estimate your 2025 taxable income. All you need to do is enter your tax year filing status and taxable income to calculate your estimated tax rate. With TurboTax, you start for free and pay only when you file—plus you get 100% accurate calculations, guaranteed. That’s not all with the guarantees either. TurboTax ensures a “Maximum Refund Guarantee,” meaning if you get a larger refund or less taxes due from another tax preparation method, they’ll refund the applicable TurboTax federal and/or state purchase price paid. You can also get quick answers for any tax questions from AI-Powered Intuit Assist, and for the lazy filers among us (myself included), you can upload or snap a photo of your W-2 and the info will be autofilled for you. Is There a Service Code for TurboTax? TurboTax service codes are unique codes, usually issued by customer support for specific situations; these will require you to input the code into the \"I have a service code\" field before payment. These single-use codes are for any technical or billing issues you may have during the tax filing process. Even if you don’t have a service code, don’t fret—there are still tons of ways to get TurboTax coupons, including a discount of 10% when you file before Tax Day (April 15). Plus, you can get 20% off TurboTax referral codes if you use a friend’s invite link, and if you send your link to a friend and they purchase an online TurboTax product, you’ll receive e-gift cards of up to $500 as a reward from TurboTax. Save on federal and business tax filings by following here for limited-time offers throughout the 2026 tax season.",
      "cover_image_url": "https://media.wired.com/photos/66ea076fca863bb4c1028b64/191:100/w_1280,c_limit/WIRED-Coupons-11.jpg"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "OpenAI Abandons ‘io’ Branding for Its AI Hardware",
      "url": "https://www.wired.com/story/openai-drops-io-branding-hardware-devices/",
      "published": "2026-02-10T05:45:16+00:00",
      "summary": "A court filing in a trademark lawsuit reveals OpenAI won't use the name “io” for its AI hardware device, which isn't expected to ship until 2027.",
      "content_text": "OpenAI will not use the name “ io ” for its forthcoming line of AI hardware devices, according to a Monday court filing. The motion is part of a trademark infringement lawsuit filed last year by audio device startup iyO, which sued OpenAI after it acquired famed Apple designer Jony Ive’s startup io. Peter Welinder, OpenAI’s vice president and general manager, said in the filing that OpenAI had reviewed its product-naming strategy and “decided not to use the name ‘io’ (or ‘IYO,’ or any capitalization of either) in connection with the naming, advertising, marketing, or sale of any artificial intelligence-enabled hardware products.” Welinder also said that OpenAI now has a better understanding of the timeline for getting its devices to market. In the filing, the company said its first hardware device won’t ship to customers before the end of February 2027. Previously, OpenAI has said that it is planning to unveil its AI device in the second half of 2026 . The company’s first prototype is reportedly a screenless device that can sit on a user’s desk, and accompany a phone and laptop. Welinder also said that OpenAI has yet to create packaging or marketing materials for its first hardware device, according to the filing. OpenAI did not immediately respond to WIRED’s request for comment. The news comes as wild rumors continue to spread about OpenAI’s hardware efforts. A now debunked Reddit thread went viral over the weekend, claiming that OpenAI had pulled a Super Bowl ad unveiling its forthcoming device. Someone posted the alleged ad, which featured the actor Alexander Skarsgård wearing a pair of silver headphones and tapping a reflective puck. The video was shared widely on social media, including by Reddit cofounder Alexis Ohanian . OpenAI spokesperson Lindsay McCallum confirmed to WIRED that the ChatGPT-maker had nothing to do with the ad in question. OpenAI announced back in May 2025 that it would acquire Jony Ive’s secretive consumer hardware subsidiary for $6.5 billion, marking the company’s largest acquisition ever. At the time, io was marketed as a new company that would merge with OpenAI to create a family of AI devices. Since then, the company has been embroiled in a messy trademark infringement lawsuit that’s likely revealed more than OpenAI would have liked about its devices. iyO claims that OpenAI and io executives met with iyO leaders and tested the company’s AI audio technology before the acquisition was announced. OpenAI leaders previously revealed in filings related to this lawsuit that the prototype CEO Sam Altman mentioned in io’s launch video was “ not an in-ear device, nor a wearable device. ”",
      "cover_image_url": "https://media.wired.com/photos/698ac130a90ddd1ac11ec534/191:100/w_1280,c_limit/2224155524"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "AI Doesn’t Reduce Work-It Intensifies It",
      "url": "https://simonwillison.net/2026/Feb/9/ai-intensifies-work/",
      "published": "2026-02-10T05:19:00+00:00",
      "summary": "<p>Original article: <a href=\"https://hbr.org/2026/02/ai-doesnt-reduce-work-it-intensifies-it\" rel=\"nofollow\">https://hbr.org/2026/02/ai-doesnt-reduce-work-it-intensifies...</a></p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46955703\">https://news.ycombinator.com/item?id=46955703</a></p> <p>Points: 90</p> <p># Comments: 47</p>",
      "content_text": "AI Doesn’t Reduce Work—It Intensifies It ( via ) Aruna Ranganathan and Xingqi Maggie Ye from Berkeley Haas School of Business report initial findings in the HBR from their April to December 2025 study of 200 employees at a \"U.S.-based technology company\". This captures an effect I've been observing in my own work with LLMs: the productivity boost these things can provide is exhausting . AI introduced a new rhythm in which workers managed several active threads at once: manually writing code while AI generated an alternative version, running multiple agents in parallel, or reviving long-deferred tasks because AI could “handle them” in the background. They did this, in part, because they felt they had a “partner” that could help them move through their workload. While this sense of having a “partner” enabled a feeling of momentum, the reality was a continual switching of attention, frequent checking of AI outputs, and a growing number of open tasks. This created cognitive load and a sense of always juggling, even as the work felt productive. I'm frequently finding myself with work on two or three projects running parallel. I can get so much done , but after just an hour or two my mental energy for the day feels almost entirely depleted. I've had conversations with people recently who are losing sleep because they're finding building yet another feature with \"just one more prompt\" irresistible. The HBR piece calls for organizations to build an \"AI practice\" that structures how AI is used to help avoid burnout and counter effects that \"make it harder for organizations to distinguish genuine productivity gains from unsustainable intensity\". I think we've just disrupted decades of existing intuition about sustainable working practices. It's going to take a while and some discipline to find a good new balance.",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "[2512.20798] A Benchmark for Evaluating Outcome-Driven Constraint Violations in Autonomous AI Agents",
      "url": "https://arxiv.org/abs/2512.20798",
      "published": "2026-02-10T03:17:17+00:00",
      "summary": "<p>Article URL: <a href=\"https://arxiv.org/abs/2512.20798\">https://arxiv.org/abs/2512.20798</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46954920\">https://news.ycombinator.com/item?id=46954920</a></p> <p>Points: 308</p> <p># Comments: 194</p>",
      "content_text": "[Submitted on 23 Dec 2025 ( v1 ), last revised 1 Feb 2026 (this version, v2)] Title: A Benchmark for Evaluating Outcome-Driven Constraint Violations in Autonomous AI Agents View a PDF of the paper titled A Benchmark for Evaluating Outcome-Driven Constraint Violations in Autonomous AI Agents, by Miles Q. Li and 5 other authors View PDF HTML (experimental) Abstract: As autonomous AI agents are increasingly deployed in high-stakes environments, ensuring their safety and alignment with human values has become a paramount concern. Current safety benchmarks primarily evaluate whether agents refuse explicitly harmful instructions or whether they can maintain procedural compliance in complex tasks. However, there is a lack of benchmarks designed to capture emergent forms of outcome-driven constraint violations, which arise when agents pursue goal optimization under strong performance incentives while deprioritizing ethical, legal, or safety constraints over multiple steps in realistic production settings. To address this gap, we introduce a new benchmark comprising 40 distinct scenarios. Each scenario presents a task that requires multi-step actions, and the agent's performance is tied to a specific Key Performance Indicator (KPI). Each scenario features Mandated (instruction-commanded) and Incentivized (KPI-pressure-driven) variations to distinguish between obedience and emergent misalignment. Across 12 state-of-the-art large language models, we observe outcome-driven constraint violations ranging from 1.3% to 71.4%, with 9 of the 12 evaluated models exhibiting misalignment rates between 30% and 50%. Strikingly, we find that superior reasoning capability does not inherently ensure safety; for instance, Gemini-3-Pro-Preview, one of the most capable models evaluated, exhibits the highest violation rate at 71.4%, frequently escalating to severe misconduct to satisfy KPIs. Furthermore, we observe significant \"deliberative misalignment\", where the models that power the agents recognize their actions as unethical during separate evaluation. These results emphasize the critical need for more realistic agentic-safety training before deployment to mitigate their risks in the real world. Submission history From: Miles Q. Li [ view email ] [v1] Tue, 23 Dec 2025 21:52:53 UTC (51 KB) [v2] Sun, 1 Feb 2026 00:23:19 UTC (52 KB)",
      "cover_image_url": "/static/browse/0.3.4/images/arxiv-logo-fb.png"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Tem raises $75M to remake electricity markets using AI",
      "url": "https://techcrunch.com/2026/02/09/tem-raises-75m-to-remake-electricity-markets-using-ai/",
      "published": "2026-02-10T03:01:00+00:00",
      "summary": "Tem has built a transaction engine that relies on AI to cut costs. Lightspeed led the round to help the startup expand to the U.S. and Australia.",
      "content_text": "As AI data centers drive up electricity prices , London-based startup Tem thinks AI might be able to help solve it, too. Tem has built an energy transaction engine that relies on AI to cut prices relative to other energy traders. The company has signed up more than 2,600 business customers throughout the U.K. on the promise that buying energy from its utility division can save them up to 30% on their energy bills. The startup recently closed an oversubscribed $75 million Series B led by Lightspeed Venture Partners with participation from AlbionVC, Allianz, Atomico, Hitachi Ventures, Revent, Schroders Capital, and Voyager Ventures, TechCrunch has exclusively learned. The round values Tem at more than $300 million, a source familiar with the deal told TechCrunch. The startup plans to use the funding to help expand to Australia and the U.S., starting with Texas. “We’re in a nice position where we kind of have control over our own profitability. So I could have chosen not to raise at all and had a lovely, nice bootstrap business in some ways,” Joe McDonald, co-founder and CEO of Tem, told TechCrunch. “Well, we’re not that kind of business. We know what we want to achieve as someone who wants to go public over the years.” Tem is a classic marketplace play, matching electricity generators with consumers. The company intentionally started by focusing almost exclusively on renewable energy generators and small businesses to fill both sides of the ledger. “The more decentralized and the more distributed, the better it is for the algorithms,” McDonald said. “But this works all the way up to enterprise.” The company’s customers include fast-fashion retailer Boohoo Group, soft drink company Fever-Tree, and Newcastle United FC. Techcrunch event Boston, MA | June 23, 2026 Currently, Tem is running what amounts to two different businesses. One, called Rosso, is the transaction engine that matches suppliers with buyers. Here, machine learning algorithms and LLMs help predict supply and demand. The goal with Rosso, McDonald said, is to cut costs by eliminating several layers that are present in current energy markets. “In each of them, you’ve got different teams doing different jobs, taking different levels of profit from back office to trading, trading desks to other trading desks, and probably five to six intermediaries in total that enable the flow of money to move from one side to the other,” he said. With AI, he said, “you now have an opportunity to replace the humans, the labor costs, and the disparate systems into one single transaction infrastructure.” The goal is to make the price that customers pay for electricity closer to the wholesale cost. The other part of Tem, called RED, is a “neo-utility” built to prove the value of Rosso. “When we first started, we tried to sell our infrastructure to the energy companies, and we got nowhere,” he said. RED is currently the only utility using Rosso, and McDonald said its growth has pushed the company to prioritize it over opening Rosso to others. At some point, though, Tem plans to allow other utilities in. “In reality, it doesn’t matter how good [RED] is; it’s not going to get above a 40% market share. And it shouldn’t, because that becomes a monopoly in itself. So, me, I’d much rather go to get access to all the transaction flow,” McDonald said. “Long term, we really don’t mind who owns the customer, who owns the generation as long as our infrastructure is being used,” he said. “This is just an infrastructure play in the same way AWS was, or Stripe was.”",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2014/04/shutterstock_103274513.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "India makes Aadhaar more ubiquitous, but critics say security and privacy concerns remain",
      "url": "https://techcrunch.com/2026/02/09/india-makes-aadhaar-more-ubiquitous-but-critics-say-privacy-concerns-remain/",
      "published": "2026-02-10T03:00:00+00:00",
      "summary": "India's Aadhaar is moving into wallets, hotels and policing through a new app. Critics say that amid the broader Aadhaar rollout, it's unclear how data shared through the new app would prevent breaches or leaks.",
      "content_text": "India is pushing Aadhaar, the world’s largest digital identity system, deeper into everyday private life through a new app and offline verification support, a move that raises new questions about security, consent, and the broader use of the massive database. Announced in late January by the Indian government-backed Unique Identification Authority of India (UIDAI), the changes introduce a new Aadhaar app alongside an offline verification framework that allows individuals to prove their identity without real-time checks against the central Aadhaar database. The app allows users to share a limited amount of information, such as confirming that they are over a certain age rather than revealing their full date of birth, with a range of services, like hotels and housing societies to workplaces, platforms, and payment devices, while the existing mAadhaar app continues to operate in parallel for now. Alongside the new app, UIDAI is also expanding Aadhaar’s footprint in mobile wallets, with upcoming integration with Google Wallet and discussions underway to enable similar functionality in Apple Wallet, in addition to existing support on Samsung Wallet. The new Aadhaar app with selective data sharing Image Credits: Google Play The Indian authority is also promoting the app’s use in policing and hospitality. The Ahmedabad City Crime Branch has become the first police unit in India to integrate Aadhaar-based offline verification with PATHIK, a guest-monitoring platform launched by the police department, aimed at hotels and guest accommodations to record visitors’ information. UIDAI has also positioned the new Aadhaar app as a digital visiting card for meetings and networking, allowing users to share selected personal details via a QR code. Officials at the launch in New Delhi said these latest efforts are part of a broader effort to replace photocopies and manual ID checks with consent-based, offline verification. The approach, they argued, is meant to give users more control over which specific identity information they want to share, while enabling verification at scale without having to query Aadhaar’s central database. Techcrunch event Boston, MA | June 23, 2026 Early uptake on top of massive scale While UIDAI formally launched the new Aadhaar app last month, it had been in testing since earlier in 2025. Estimates from Appfigures show that the app, which appeared in app stores toward the end of 2025, quickly overtook the older mAadhaar app in monthly downloads. Combined monthly installs of Aadhaar-related apps rose from close to 2 million in October to nearly 9 million in December. The new app is being layered onto an identity system that already operates at enormous scale considering India’s population. Figures published on UIDAI’s public dashboard show that Aadhaar has issued more than 1.4 billion identity numbers and handles roughly 2.5 billion authentication transactions each month, alongside tens of billions of electronic “know your customer” checks since its launch. The shift toward offline verification does not replace this infrastructure so much as extending it, moving Aadhaar from a largely backend verification tool into a more visible and everyday interface. At the app’s launch, UIDAI officials said the move toward offline verification was intended to address long-standing risks associated with physical photocopies and screenshots of Aadhaar documents , which have often been collected, stored, and circulated with little oversight. The expansion comes at a time of regulatory changes, easing restrictions , and a new framework (PDF), with UIDAI now allowing some public and private organizations to verify Aadhaar credentials without querying the central database. Consent, accountability, and unresolved risks Civil liberties and digital rights groups say those legal changes do not resolve Aadhaar’s deeper structural risks. Raman Jit Singh Chima, senior international counsel and Asia Pacific policy director at Access Now, said the expansion of Aadhaar into offline and private-sector settings introduces new threats, particularly at a time when India’s data protection framework is still being put in place. Chima questioned the timing of the rollout, arguing that the federal government should have waited for India’s Data Protection Board to be established first, and allow for independent review and wider consultation with affected communities. “The fact that this has gone ahead at this point of time seems to indicate a preference to continue the expansion of the use of Aadhaar, even if it is unclear in terms of the further risks that it might pose to the system, as well as to the data of Indians,” Chima told TechCrunch. Indian legal advocacy groups also point to unresolved implementation failures. Prasanth Sugathan, legal director at New Delhi-based digital rights group SFLC.in, said that while UIDAI has framed the app as a tool for citizen empowerment, it does little to address persistent problems, such as inaccuracies in the Aadhaar database, security lapses , and poor mechanisms for redress, which have disproportionately affect vulnerable populations. He also cited a 2022 report by India’s Comptroller and Auditor General, which found UIDAI had failed to meet certain compliance standards. “Such issues can often result in disenfranchisement of people, especially those who were meant to be benefited by such systems,” Sugathan told TechCrunch, adding that it remains unclear how data shared through the new app would prevent breaches or leaks . Campaigners associated with Rethink Aadhaar, a civil society campaign focused on Aadhaar-related rights and accountability, argue that the offline verification system risks reintroducing private-sector use of Aadhaar in ways the Supreme Court has already explicitly barred. Shruti Narayan and John Simte of the group said enabling private entities to routinely rely on Aadhaar for verification amounts to “Aadhaar creep”, normalizing its use across social and economic life despite a 2018 judgment that struck down provisions allowing private actors to use Aadhaar to verify people’s information. They warned that consent in such contexts is often illusory, particularly in situations involving hotels, housing societies, or delivery workers, while India’s data protection law remains largely untested . Together, the new app, regulatory changes, and expanding ecosystem are shifting Aadhaar from a background identity utility into a visible layer of daily life that is increasingly hard to avoid. As India doubles down on Aadhaar, governments and tech companies are watching closely, attracted by the promise of population-scale identity checks. The Indian IT ministry and UIDAI CEO did not respond to requests for comments.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/new-aadhaar-app-jagmeet-singh-techcrunch.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "GitHub - TrevorS/voxtral-mini-realtime-rs",
      "url": "https://github.com/TrevorS/voxtral-mini-realtime-rs",
      "published": "2026-02-10T01:26:42+00:00",
      "summary": "<p>Article URL: <a href=\"https://github.com/TrevorS/voxtral-mini-realtime-rs\">https://github.com/TrevorS/voxtral-mini-realtime-rs</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46954136\">https://news.ycombinator.com/item?id=46954136</a></p> <p>Points: 248</p> <p># Comments: 26</p>",
      "content_text": "TrevorS/voxtral-mini-realtime-rs You can’t perform that action at this time.",
      "cover_image_url": "https://opengraph.githubassets.com/d78befc1421802da72ea57e845ea2d451a4f098e066463a7660670e0c5fdc3f7/TrevorS/voxtral-mini-realtime-rs"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "antirez/voxtral.c: Pure C inference of Mistral Voxtral Realtime 4B speech to text model",
      "url": "https://github.com/antirez/voxtral.c",
      "published": "2026-02-10T01:17:35+00:00",
      "summary": "<p>Article URL: <a href=\"https://github.com/antirez/voxtral.c\">https://github.com/antirez/voxtral.c</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46954049\">https://news.ycombinator.com/item?id=46954049</a></p> <p>Points: 164</p> <p># Comments: 13</p>",
      "content_text": "You can’t perform that action at this time.",
      "cover_image_url": "https://opengraph.githubassets.com/fb864e43f0b4b6dbd7bd73f1048a7a3677ccdcb49604b48cd0718c780bff4532/antirez/voxtral.c"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "New Mexico goes to trial to accuse Meta of facilitating child predators",
      "url": "https://www.theverge.com/policy/876168/new-mexico-attorney-general-meta-child-predator-social-media-addiction-trial",
      "published": "2026-02-10T01:03:49+00:00",
      "summary": "At the center of a consequential case about social media liability is a key question: did Meta lie or mislead the public about the safety of its platform, while knowing something very different? The state of New Mexico opened its case Monday arguing that public statements by Meta's top executives regularly contradicted its own internal [&#8230;]",
      "content_text": "At the center of a consequential case about social media liability is a key question: did Meta lie or mislead the public about the safety of its platform, while knowing something very different? The state of New Mexico opened its case Monday arguing that public statements by Meta’s top executives regularly contradicted its own internal discussions and research about the harm Facebook and Instagram posed to teens. According to Don Migliori, an attorney for the state, Meta prioritized profits and its stated commitment to free expression over the safety of young users on Facebook and Instagram. Meanwhile, Meta attorney Kevin Huff told the New Mexico jury that Meta hadn’t deceived anyone, and that the company actually regularly discloses potential risks on its services. These disclosures happen, Huff said, because the company can’t always catch violations of its terms of service right away. “This case is not about whether there is bad content on Facebook and Instagram,” Huff told the jury. Though horrible things can sometimes make it past the platform’s guardrails, he said, “the evidence will show that Meta told the truth.” “This case is not about whether there is bad content on Facebook and Instagram” The case is one of two high profile trials over social media liability that commenced with opening arguments on Monday. The other is taking place in a state courthouse in Los Angeles, where attorneys for a young plaintiff identified by the initials K.G.M. are alleging that Meta and YouTube designed their products in ways that led to compulsive use, harming the mental health of their users. The LA trial is the first bellwether for several lawsuits against social media companies set to take place in the same courthouse, alleging similar harms to users. The case in New Mexico, brought by the state’s attorney general Raúl Torrez, also argues that Meta designed its products in addictive ways. But this case additionally involved an investigation using decoy accounts that allegedly lured suspected child predators on Meta’s services. According to the opening statement, three suspected child predators were arrested as a result of that sting. The jury will have to decide whether Meta made false statements or deceived consumers about the potential harms of using Instagram or Facebook. In his opening statement to the jurors, Migliori repeatedly juxtaposed slides that showed “what Meta said” and “what Meta knew.” On the slides detailing what Meta said, he showed statements by company executives, including CEO Mark Zuckerberg, saying things like that kids under 13 were not allowed on its platforms, or that users over 19 weren’t allowed to send private messages to teen accounts that don’t follow them. Then, Migliori would display slides that he said showed Meta knew the reality was different — for instance, executives estimated 4 million accounts under 13 years of age were on Instagram. In one 2018 email from Zuckerberg to top executives, the CEO wrote that he found it “untenable to subordinate free expression in the way that communicating the idea of ‘Safety First’ suggests,” and added, “Keeping people safe is the counterbalance and not the main point.” After Migliori finished his opening statement, Huff urged jurors to give Meta a chance to make its case and not to get “distracted by the disturbing pictures.” Huff didn’t deny that there’s some bad stuff on Facebook and Instagram, but said the company is upfront about that, and works on ways to mitigate it. “We wish the state would partner with us, rather than sue us.” “No one is going to overdose on Facebook” The state plans to call several former Meta employees, who will — according to the state — describe the company’s inadequate response to harmful behavior on its platforms. At least two of the former employees have previously testified before Congress: former Facebook engineering director and Instagram consultant Arturo Bejar and former Meta researcher Jason Sattizahn . Huff specifically urged the jurors to give Meta a chance to question Sattizahn before they reach any conclusions about his credibility. He also previewed Meta’s argument that what people might colloquially call social media addiction is misnamed. Addictions to substances like fentanyl can cause physical effects like withdrawal; presumably Meta will argue that social media does not create physical dependency. “Facebook is not like fentanyl,” Huff said. “No one is going to overdose on Facebook. Scientific studies say that people don’t get withdrawal symptoms when they stop using Facebook like you would if you stopped using fentanyl.” The first witness to take the stand was an assistant principal who dealt with behavioral issues in students allegedly related to social media use. Even before the trial began, Meta and the AG’s office were sparring in public. Meta spokesperson Andy Stone recently posted a lengthy thread on X accusing Torrez of using the case for his own political gain, and called the investigation into the company “ethically compromised.” While Torrez accuses Meta of putting profits over kids safety, Stone accuses Torrez of opting “for a self-promotional political victory over child safety.” Stone wrote that Torrez’s office used images of real kids without consent for the fake profiles they created as “bait” for child predators on Meta’s platforms. The AG’s office used “aged” accounts that Stone said are “often hacked accounts resold on illicit markets,” which he said would taint any evidence “because these are real accounts with real histories that behave in particular ways.” “Instead of making its products safer, Meta is spending its time and resources falsely smearing law enforcement officials who put child predators behind bars,” deputy communications director at the New Mexico Department of Justice Chelsea Pitvorec said in a statement responding to Stone’s thread. “The company is deflecting attention from New Mexico’s undercover investigation because even Meta’s highest-paid PR flacks cannot defend why Meta’s platforms expose children to criminals. Our lawsuit alleges that Meta has misled the public about the dangers of its platforms for years, and we are not surprised to see the company continue to make blatantly false statements while our trial is underway. We look forward to presenting the jury with the evidence we’ve obtained in over two years of litigation.” Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Lauren Feiner Meta News Policy Social Media Tech",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/STKS507_FTCxMETA_ANTITRUST_CVIRGINIA_2_D.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Zulip project values",
      "url": "https://zulip.com/values/",
      "published": "2026-02-10T00:46:14+00:00",
      "summary": "<p>Article URL: <a href=\"https://zulip.com/values/\">https://zulip.com/values/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46953815\">https://news.ycombinator.com/item?id=46953815</a></p> <p>Points: 83</p> <p># Comments: 14</p>",
      "content_text": "Building software that will always be there for our users When choosing software that will be core to how one’s organization operates, such as a team chat platform, there is an important question: “Will this product still exist and be responsibly maintained in a few years?” We have designed our company, community, and technology with the explicit goal of Zulip being actively developed for many years to come. This theme cuts across many of the decisions described below. It is also reflected in our history : Zulip's earliest customers have enjoyed uninterrupted service since 2013. Keeping Zulip 100% open source Many modern “open-source” companies use a version of their product with some basic functionality intentionally removed as a demo for their non-open-source paid product. In contrast, we are committed to keeping Zulip 100% open source . When you self-host Zulip , you get all the features of our cloud offering. We work hard to make it easy to set up and run a self-hosted Zulip installation without paying us a dime, which is why thousands of organizations do so. Investing in community and mentorship Zulip is developed by a vibrant open-source community , and we are fully committed to helping bring up the next generation of open-source contributors from a wide range of backgrounds. We have invested into making Zulip’s code uniquely readable, well tested, and easy to modify. Beyond that, we have written an extraordinary 185K words of documentation on how to contribute to Zulip , with topics ranging from practical Git tips to essays on important architectural decisions . We also welcome and support contributors via formal internship programs , with over 100 participants since 2016. Because of the thousands of hours our more senior contributors (including alumni of these programs!) have dedicated to mentorship, many of these participants have told us that they learned more contributing to Zulip than in their 4-year formal computer science education. Building a sustainable business aligned with our values Guiding the Zulip community in developing a world-class organized team chat product with apps for every major desktop and mobile platform requires leadership from a talented, dedicated team. We believe that the only sustainable model is for our core team to be compensated fairly for their time. We have thus founded a company (Kandra Labs) to steward and financially support Zulip’s development . We are growing our business sustainably , without venture capital funding. VCs are incentivized to push companies to gamble for explosive growth. Often, the result is that a company with a useful product burns rapidly through its resources and goes out of business. We have built Zulip as a sustainable business (also supported by SBIR grants from the US National Science Foundation), and are being thoughtful about our pace of spending. Funding our company without venture capital also allows us to live by our values , without investor pressure to compromise them when doing so might be “good business” or “what everyone does”. Finally, we’re building software that is easy to maintain, so it does not require a large team to keep the lights on. We have consistently emphasized high standards for codebase readability, code review, commit discipline, debuggability, automated testing, tooling, documentation, and all the other subtle details that together determine whether software is easy to understand, operate, and modify. Supporting other worthy organizations An important part of Zulip’s mission is ensuring that worthy organizations, from programming-language developers to research communities , are able to use Zulip whether or not they have funding. We sponsor Zulip Cloud Standard hosting for open-source projects , research groups , education , non-profits and other communities . This program has grown exponentially since its inception; today we are proud to fully sponsor Zulip hosting for hundreds of organizations.",
      "cover_image_url": "https://static.zulipchat.com/static/images/logo/zulip-icon-128x128.png"
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "Meta Goes to Trial in a New Mexico Child Safety Case. Here’s What’s at Stake",
      "url": "https://www.wired.com/story/meta-child-safety-trial-new-mexico-attorney-general/",
      "published": "2026-02-09T23:54:47+00:00",
      "summary": "Attorney general Raúl Torrez is accusing the tech giant of failing to protect minors on Facebook and Instagram.",
      "content_text": "Today, Meta went to trial in the state of New Mexico for allegedly failing to protect minors from sexual exploitation on its apps, including Facebook and Instagram . The state claims that Meta violated New Mexico’s Unfair Practices Act by implementing design features and algorithms that created dangerous conditions for users. Now, more than two years after the case was filed, opening arguments have begun in Santa Fe. It’s a big week for Meta in court: A landmark social media trial kicks off in California today as well, the nation’s first legal test of social media addiction . That case is part of a “JCCP,” or judicial council coordinated proceedings, that brings together many civil suits that focus on similar issues. The plaintiffs in that case allege that social media companies designed their products in a negligent manner and caused various harms to minors using their apps. Snap, TikTok, and Google were named as defendants alongside Meta; Snap and TikTok have already settled . The fact that Meta has not means that some of the company’s top executives may be called to the witness stand in the coming weeks. Meta executives, including Mark Zuckerberg, are not likely to testify live in the New Mexico trial. But the proceedings may still be noteworthy for a few reasons. It’s the first stand-alone, state-led case against Meta that has actually gone to trial in the US. It’s also a highly charged case alleging child sexual exploitation that will ultimately lean on very technical arguments, including what it means to “mislead” the public, how algorithmic amplification works on social media, and what protections Meta and other social media platforms have through Section 230. And, while Meta’s top brass might not be required to appear in person, executive depositions and testimonies from other witnesses could still offer an interesting look at the inner workings of the company as it established policies around underage users and responded to complaints that claim it wasn’t doing enough to protect them. Meta has so far given no indication that it plans to settle. The company has denied the allegations, and Meta spokesperson Aaron Simpson told WIRED previously, “While New Mexico makes sensationalist, irrelevant, and distracting arguments, we're focused on demonstrating our long-standing commitment to supporting young people … We’re proud of the progress we’ve made, and we’re always working to do better.” Sacha Haworth, executive director of the Tech Oversight Project, a tech industry watchdog, said in an emailed statement that these two trials represent “the split screen of Mark Zuckerberg’s nightmares: a landmark trial in Los Angeles over addicting children to Facebook and Instagram, and a trial in New Mexico exposing how Meta enabled predators to use social media to exploit and abuse kids.” “These are the trials of a generation,” Haworth added. “Just as the world watched courtrooms hold Big Tobacco and Big Pharma accountable, we will, for the first time, see Big Tech CEOs like Zuckerberg take the stand.” The Cost of Doing Business New Mexico attorney general Raúl Torrez filed his complaint against Meta in December 2023. In it, he alleged that Meta proactively served underage users explicit content, enabled adults to exploit children on the platform, allowed Facebook and Instagram users to easily find child pornography, and allowed an investigator on the case, purporting to be a mother, to offer her underage daughter to sex traffickers. The trial is expected to take place over seven weeks. Last week jurors were selected, a panel of 10 women and eight men (12 jurors and six alternates). New Mexico First Judicial District judge Bryan Biedscheid is presiding over the case.",
      "cover_image_url": "https://media.wired.com/photos/698a33745d41364caf4502da/191:100/w_1280,c_limit/Whats-At-Stake-Meta-Trial-Business-2243569637.jpg"
    },
    {
      "industry": "technology",
      "source": "VentureBeat",
      "title": "OpenAI's new Codex app hits 1M+ downloads in first week — but limits may be coming to free and Go users",
      "url": "https://venturebeat.com/technology/openais-new-codex-app-hits-1m-downloads-in-first-week-but-limits-may-be",
      "published": "2026-02-09T23:45:00+00:00",
      "summary": "<p>In a major milestone for the &quot;AI coding wars,&quot; OpenAI CEO Sam Altman <a href=\"https://x.com/sama/status/2020977975081177343\">confirmed on X</a> that the company&#x27;s <a href=\"https://venturebeat.com/orchestration/openai-launches-a-codex-desktop-app-for-macos-to-run-multiple-ai-coding\">standalone Codex application </a>(currently only for Mac computers) surpassed 1 million downloads in its first week of availability, echoing the <a href=\"https://www.entrepreneur.com/en-in/news-and-trends/internet-sensation-chatgpt-crosses-1-million-users-in-5-days/440390\">explosive growth of OpenAI&#x27;s hit chatbot ChatGPT</a> after it first launched in late 2022.</p><p>The surge reflects a 60% week-over-week growth in overall Codex users, following the <a href=\"https://openai.com/index/introducing-the-codex-app/\">February 2 launch</a> of the app and the subsequent <a href=\"https://venturebeat.com/technology/openais-gpt-5-3-codex-drops-as-anthropic-upgrades-claude-ai-coding-wars-heat\">release of the underlying GPT-5.3-Codex model.</a></p><p>While OpenAI is currently celebrating this rapid adoption, the company is signaling that the era of unlimited free access to its most powerful agentic tools is transitioning toward a more restricted model.</p><h2><b>The agentic coding command center</b></h2><p>Unlike traditional auto-complete plugins, the Codex app is positioned as a &quot;command center&quot; for agentic coding. It utilizes GPT-5.3-Codex, a model OpenAI <a href=\"https://openai.com/index/gpt-5-3-codex-system-card/\">describes</a> as its most capable agentic model to date. </p><p>Notably, Altman <a href=\"https://x.com/sama\">claimed</a> that the model was instrumental in its own creation, with early versions used to debug the very training runs that produced the final release.</p><p>The app&#x27;s primary innovation is its ability to orchestrate multiple AI agents simultaneously. According to <a href=\"https://help.openai.com/en/articles/9624314-model-release-notes\">OpenAI&#x27;s release notes</a>, the app allows users to:</p><ul><li><p><b>Run Parallel Worktrees:</b> Deploy independent agents to explore different code paths simultaneously without branch conflicts.</p></li><li><p><b>Delegate Long-Running Tasks:</b> Offload routine maintenance, such as dependency updates and test runs, to background automations.</p></li><li><p><b>Supervise Coordinated Teams:</b> Move between agents in a unified desktop interface while maintaining full context of a complex project.</p></li></ul><h2><b>Limits coming to low-cost and free users</b></h2><p>The 1 million download milestone was catalyzed by OpenAI’s decision to offer Codex access to ChatGPT Free and &quot;Go&quot; tier users for a limited promotional period. </p><p>However, Altman has warned that this high-compute &quot;free lunch&quot; is not permanent.</p><blockquote><p><i>&quot;We’ll keep Codex available to Free/Go users after this promotion; we may have to reduce limits there but we want everyone to be able to try Codex and start building,&quot;</i> Altman <a href=\"https://x.com/sama\">shared on X</a>.</p></blockquote><p>This shift aligns with OpenAI&#x27;s broader strategy to manage the immense costs of its &quot;High capability&quot; models and applications.</p><p>While paid OpenAI ChatGPT subscribers (Plus, Pro, Team, and Enterprise) currently enjoy <a href=\"https://help.openai.com/en/articles/9624314-model-release-notes\">doubled rate limits</a>, the $8/month &quot;Go&quot; tier and Free tiers are likely to see stricter throttling as the promotion ends.</p><h2><b>The AI coding wars are in full swing</b></h2><p>OpenAI’s push comes as competitors gain significant ground. <a href=\"https://cybernews.com/ai-news/openai-launches-codex-desktop-app-to-manage-multiple-ai-agents\">Anthropic’s Claude Code recently reported</a> reaching $1 billion in annualized revenue within six months of launch.</p><p>Simultaneously, the &quot;vibe coding&quot; movement has seen the rise of model-agnostic tool",
      "content_text": "<p>In a major milestone for the &quot;AI coding wars,&quot; OpenAI CEO Sam Altman <a href=\"https://x.com/sama/status/2020977975081177343\">confirmed on X</a> that the company&#x27;s <a href=\"https://venturebeat.com/orchestration/openai-launches-a-codex-desktop-app-for-macos-to-run-multiple-ai-coding\">standalone Codex application </a>(currently only for Mac computers) surpassed 1 million downloads in its first week of availability, echoing the <a href=\"https://www.entrepreneur.com/en-in/news-and-trends/internet-sensation-chatgpt-crosses-1-million-users-in-5-days/440390\">explosive growth of OpenAI&#x27;s hit chatbot ChatGPT</a> after it first launched in late 2022.</p><p>The surge reflects a 60% week-over-week growth in overall Codex users, following the <a href=\"https://openai.com/index/introducing-the-codex-app/\">February 2 launch</a> of the app and the subsequent <a href=\"https://venturebeat.com/technology/openais-gpt-5-3-codex-drops-as-anthropic-upgrades-claude-ai-coding-wars-heat\">release of the underlying GPT-5.3-Codex model.</a></p><p>While OpenAI is currently celebrating this rapid adoption, the company is signaling that the era of unlimited free access to its most powerful agentic tools is transitioning toward a more restricted model.</p><h2><b>The agentic coding command center</b></h2><p>Unlike traditional auto-complete plugins, the Codex app is positioned as a &quot;command center&quot; for agentic coding. It utilizes GPT-5.3-Codex, a model OpenAI <a href=\"https://openai.com/index/gpt-5-3-codex-system-card/\">describes</a> as its most capable agentic model to date. </p><p>Notably, Altman <a href=\"https://x.com/sama\">claimed</a> that the model was instrumental in its own creation, with early versions used to debug the very training runs that produced the final release.</p><p>The app&#x27;s primary innovation is its ability to orchestrate multiple AI agents simultaneously. According to <a href=\"https://help.openai.com/en/articles/9624314-model-release-notes\">OpenAI&#x27;s release notes</a>, the app allows users to:</p><ul><li><p><b>Run Parallel Worktrees:</b> Deploy independent agents to explore different code paths simultaneously without branch conflicts.</p></li><li><p><b>Delegate Long-Running Tasks:</b> Offload routine maintenance, such as dependency updates and test runs, to background automations.</p></li><li><p><b>Supervise Coordinated Teams:</b> Move between agents in a unified desktop interface while maintaining full context of a complex project.</p></li></ul><h2><b>Limits coming to low-cost and free users</b></h2><p>The 1 million download milestone was catalyzed by OpenAI’s decision to offer Codex access to ChatGPT Free and &quot;Go&quot; tier users for a limited promotional period. </p><p>However, Altman has warned that this high-compute &quot;free lunch&quot; is not permanent.</p><blockquote><p><i>&quot;We’ll keep Codex available to Free/Go users after this promotion; we may have to reduce limits there but we want everyone to be able to try Codex and start building,&quot;</i> Altman <a href=\"https://x.com/sama\">shared on X</a>.</p></blockquote><p>This shift aligns with OpenAI&#x27;s broader strategy to manage the immense costs of its &quot;High capability&quot; models and applications.</p><p>While paid OpenAI ChatGPT subscribers (Plus, Pro, Team, and Enterprise) currently enjoy <a href=\"https://help.openai.com/en/articles/9624314-model-release-notes\">doubled rate limits</a>, the $8/month &quot;Go&quot; tier and Free tiers are likely to see stricter throttling as the promotion ends.</p><h2><b>The AI coding wars are in full swing</b></h2><p>OpenAI’s push comes as competitors gain significant ground. <a href=\"https://cybernews.com/ai-news/openai-launches-codex-desktop-app-to-manage-multiple-ai-agents\">Anthropic’s Claude Code recently reported</a> reaching $1 billion in annualized revenue within six months of launch.</p><p>Simultaneously, the &quot;vibe coding&quot; movement has seen the rise of model-agnostic tools like Kilo CLI 1.0. </p><p>Backed by GitLab co-founder Sid Sijbrandij, Kilo <a href=\"https://www.dera.ai/en/news/1a3acd7c-caab-866c-2dba-824236608971\">unveiled</a> a rebuilt interface on February 4 that supports over 500 models, including rivals like Alibaba&#x27;s Qwen and Google Gemini. </p><p>Kilo&#x27;s strategy of &quot;Agentic Anywhere&quot;—shipping code via terminal, Slack, or IDE—contrasts with the ecosystem-locked nature of OpenAI&#x27;s Codex app.</p><p>For enterprise decision-makers, especially AI engineers and orchestrators, the rapid-fire releases of GPT-5.3-Codex and Kilo CLI 1.0 signal a transition from AI as a &quot;copilot&quot; to AI as an &quot;operator.&quot; </p><h2><b>What 1 million downloads means for enterprise decision-makers</b></h2><p>The milestone of 1 million downloads for the Codex app is not merely a figure of consumer interest; it is a validation of the demand for agentic systems that can autonomously manage debugging, deployment, and cross-platform orchestration. </p><p>To move forward confidently, leaders must shift their focus from single-shot prompts to the management of agentic workflows, ensuring these tools are integrated into governed repositories and that their &quot;self-improving&quot; cycles are subjected to rigorous human-in-the-loop oversight.</p><p>To ensure business success in this evolving landscape, decision-makers should adopt a platform-agnostic and governance-first strategy.</p><p>While the raw power of GPT-5.3-Codex is undeniable—demonstrated by its record 77.3% result on the Terminal-Bench 2.0 benchmark measuring agentic performance in the terminal environment, <a href=\"https://openai.com/index/introducing-gpt-5-3-codex/\">according to OpenAI</a> —the rise of open-source, model-flexible alternatives like Kilo CLI suggests that maintaining optionality is critical to avoiding vendor lock-in and opaque subscription costs. </p><p>Leaders must prioritize building a &quot;governed agent layer&quot; that standardizes identity, permissions, and audit logs across all tools, whether they are proprietary ecosystems or open-core terminal interfaces. </p><p>By treating these agents as a digital workforce to be orchestrated rather than just a set of tools to be used, enterprises can safely scale their development velocity without sacrificing architectural integrity or security.</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Wired",
      "title": "Need a Splashy Last Minute Valentine’s Day Gift? Try This Dessert Box",
      "url": "https://www.wired.com/story/valentines-day-boarderie-dessert-board/",
      "published": "2026-02-09T23:38:59+00:00",
      "summary": "I tried Boarderie’s new sweets-only board, which ships overnight, to see if it’s impressive enough for your valentine.",
      "content_text": "Unless you’re a celebrity with a spare $8 million or personal access to Kenny G , pulling off a last-minute Valentine’s gift with wow factor takes some doing. Maybe your own valentine is fine with grocery-store flowers or a flower-themed Lego set via Amazon overnight delivery ( which honestly isn't a bad idea ), but if you want something really ostentatious and over the top, your options as a civilian are limited. If your love is a lover of sweets, however, Boarderie’s brand-new XL Dessert Board might do the trick. Layered with 47 different artisanal treats, from miniature cakes and truffles to macarons and maple smoked chili caramels, this gift is a nuclear bomb to the waistline, but most of the items on it last up to 30 days in the fridge, so the recipient will be reminded of your generosity all month long. Does it live up to the hype? I put on my fat pants in the name of journalism and requested one to try out. Boarderie Valentine's Dessert Board I’ve tested and loved Boarderie’s elaborate charcuterie boards in the past (if your valentine is more of a cheese-and-crackers person, there are Valentine’s Day versions of those as well , plus an “I love you”–themed Baked Brie Board ), but a 21-pound tray of nothing but desserts is a different beast. Supposedly it serves 10 to 12, which I think is accurate so long as you're not making it an entire meal, but note that there are also smaller Medium (serves 5 to 7) and Classic (serves 4 to 5) sizes. Those may be less impressive but potentially more manageable—I can report that the Large arrives in a box the size of a 32-inch TV, with a plastic lid, bubble-wrap casing, and two large reusable ice packs, which in my box’s case were still frozen solid. (The delivery time between placing an order with the company's Florida office and its arrival on my doorstep in Washington state took roughly 17 hours.)",
      "cover_image_url": "https://media.wired.com/photos/698a6ba7972bf41b68e7f14b/191:100/w_1280,c_limit/Nothing%20Says%20%E2%80%98Happy%20Valentine%E2%80%99s%20Day%E2%80%99%20Like%2021%20Pounds%20of%20Dessert.png"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Is Particle Physics Dead, Dying, or Just Hard?",
      "url": "https://www.quantamagazine.org/is-particle-physics-dead-dying-or-just-hard-20260126/",
      "published": "2026-02-09T23:31:15+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.quantamagazine.org/is-particle-physics-dead-dying-or-just-hard-20260126/\">https://www.quantamagazine.org/is-particle-physics-dead-dying-or-just-hard-20260126/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46953136\">https://news.ycombinator.com/item?id=46953136</a></p> <p>Points: 128</p> <p># Comments: 206</p>",
      "content_text": "This brain drain appears to be real. I spoke to Jared Kaplan, co-founder of Anthropic, the company behind the chatbot Claude. He was a physicist the last time we spoke. As a grad student at Harvard in the 2000s, he worked with the renowned theorist Nima Arkani-Hamed to open up the new directions in amplitude research that are being actively pursued today. But Kaplan left the field in 2019. “I started working on AI because it seemed plausible to me that … AI was going to make progress faster than almost any field in science historically,” he said. AI would be “the most important thing to happen while we’re alive, maybe one of the most important things to happen in the history of science. And so it seemed obvious that I should work on it.” As for the future of particle physics, AI makes worrying about it now rather pointless, in Kaplan’s view. “I think that it’s kind of irrelevant what we plan on a 10-year timescale, because if we’re building a collider in 10 years, AI will be building the collider; humans won’t be building it. I would give like a 50% chance that in two or three years, theoretical physicists will mostly be replaced with AI. Brilliant people like Nima Arkani-Hamed or Ed Witten, AI will be generating papers that are as good as their papers pretty autonomously. … So planning beyond this couple-year timescale isn’t really something I think about very much.” Cari Cesarotti, a postdoctoral fellow in the theory group at CERN, is skeptical about that future. She notices chatbots’ mistakes, and how they’ve become too much of a crutch for physics students. “AI is making people worse at physics,” she said. “What we need is humans to read textbooks and sit down and think of new solutions to the hierarchy problem.” Cesarotti was a high school junior when the Higgs boson was discovered. She grew up near Fermilab, the U.S. national lab in Illinois that houses the Tevatron, which was the world’s highest-energy particle collider before the LHC. (The top quark was discovered there in 1995.) This proximity taught her that a particle physicist was a thing you could be. Later, it turned out to be her thing. “What are the fundamental building blocks of the universe — those were the questions that I was most interested in knowing the answer to,” she told me. “But what people said was, ‘Particle physics is dead. Don’t do this.’” It may have been a fair warning; Cesarotti has yet to land a permanent job as a rising particle physicist. The subfield has continued to shrink, she and others said, as faculty hiring committees and grad students go in other directions. “Definitely all this rhetoric that there was nothing to be found and you should give up on it — people listened,” she said. “And of course that means there are fewer people. It becomes a self-fulfilling prophecy. If you’re pushing all these talented people out of trying to solve these problems into a field that it’s easier to make an impact on, then you’re setting yourself up for failure.” Cesarotti echoed a sentiment I’d heard from others, which sounds correct to me as well: “Particle physics isn’t dead; it’s just hard.” It’s hard to know what to think about or look for. But the most devoted particle physicists are thinking and looking all the same. “It was easy for 125 years,” Strassler said. “One thing led to the next. That lucky century has, for now, at least in the medium term, come to an end. That could change tomorrow, or next century, or who knows.” A hint of a new lightweight particle could, in theory, show up at the LHC, or in some other experiment. Strassler is particularly excited about the study of radioactive thorium-229 decay , which could reveal variations in the fundamental constants. I’m slightly partial to experiments looking for “axions,” dark matter candidates that are so lightweight that they can act a little like light itself. On the theory side, an obvious solution to the hierarchy problem could drop naturally out of the geometry behind scattering amplitudes. Or, if Kaplan is right, AI systems might someday suggest powerful new ideas for how the 25 particles of the Standard Model fit into a more comprehensive pattern — a possibility I didn’t foresee back when the crisis began. Clearly, further progress toward the truth remains possible in particle physics. But there’s no discovery guarantee. I’ve had more than 13 years to think about it, and it remains a disturbing prospect: All the empirical clues we can glean about nature’s fundamental laws and building blocks might already be in hand. The universe may plan on keeping the rest of its secrets.",
      "cover_image_url": "https://www.quantamagazine.org/wp-content/uploads/2026/01/Qualia_ParticlePhysics-crKristinaArmitage-Social.jpg"
    }
  ]
}