{
  "industry": "scientific_instruments",
  "collected_at": "2026-02-10T16:23:15.298918+00:00",
  "hours": 24,
  "limit": 25,
  "count": 1,
  "items": [
    {
      "industry": "scientific_instruments",
      "source": "ScienceDaily - Materials",
      "title": "Physicists discover what controls the speed of quantum time",
      "url": "https://www.sciencedaily.com/releases/2026/02/260209221713.htm",
      "published": "2026-02-10T03:21:59+00:00",
      "summary": "Time may feel smooth and continuous, but at the quantum level it behaves very differently. Physicists have now found a way to measure how long ultrafast quantum events actually last, without relying on any external clock. By tracking subtle changes in electrons as they absorb light and escape a material, researchers discovered that these transitions are not instantaneous and that their duration depends strongly on the atomic structure of the material involved.",
      "content_text": "\"The concept of time has troubled philosophers and physicists for thousands of years, and the advent of quantum mechanics has not simplified the problem,\" says Professor Hugo Dil, a physicist at EPFL. \"The central problem is the general role of time in quantum mechanics, and especially the timescale associated with a quantum transition.\" At the smallest scales, physical processes unfold at astonishing speeds. Events such as tunneling or an electron shifting to a new energy state after absorbing light can happen in just a few tens of attoseconds (10-18 seconds). That interval is so brief that even light would not travel across the width of a small virus during that time. Why Measuring Quantum Time Is So Difficult Tracking such tiny slices of time has proven extremely challenging. Any external timing device risks interfering with the fragile quantum process being studied and changing its behavior. \"Although the 2023 Nobel prize in physics shows we can access such short times, the use of such an external time scale risks to induce artifacts,\" Dil says. \"This challenge can be resolved by using quantum interference methods, based on the link between accumulated phase and time.\" A New Way to Measure Time Without a Clock Dil and his team have now developed a method that avoids external clocks altogether. When electrons absorb a photon and are emitted from a material, they carry information encoded in their spin. That spin changes depending on how the quantum transition unfolds. By carefully analyzing these changes, the researchers were able to determine how long the transition lasts. As first author of the study Fei Guo explains, \"These experiments do not require an external reference, or clock, and yield the time scale required for the wavefunction of the electron to evolve from an initial to a final state at a higher energy upon photon absorption.\" How Quantum Interference Reveals Duration When light excites an electron, the process does not follow a single path. Multiple quantum pathways are possible at the same time, and they interfere with one another. This interference leaves a clear signature in the spin of the emitted electron. By examining how this spin pattern changes as the electron's energy varies, the team could calculate how long the transition took. To carry out these measurements, the researchers used a method known as \"spin- and angle-resolved photoemission spectroscopy\" (SARPES). In this technique, intense synchrotron light strikes a material, boosting its electrons to higher energy and forcing them to escape the material's structure. Scientists then measure the energy, direction, and spin of the emitted electrons. How Atomic Structure Affects Quantum Timing The team tested materials with very different atomic arrangements. Some were fully three dimensional, such as ordinary copper. Others, including titanium diselenide (TiSe₂) and titanium ditelluride (TiTe₂), are made of weakly connected layers that behave more like flat sheets. Copper telluride (CuTe) has an even simpler, chain-like atomic structure. These contrasts made the materials ideal for studying how geometry influences timing. The results revealed a consistent pattern. The simpler and more reduced the atomic structure of a material, the longer the quantum transition lasted. In three dimensional copper, the transition was extremely fast, taking about 26 attoseconds. In the layered materials TiSe₂ and TiTe₂, the same process slowed to between 140 and 175 attoseconds. In CuTe, with its chain-like structure, the transition exceeded 200 attoseconds. These findings show that the atomic scale shape of a material strongly affects how quickly a quantum event unfolds, with lower symmetry structures leading to longer transition times. What This Means for Understanding Quantum Time \"Besides yielding fundamental information for understanding what determines the time delay in photoemission, our experimental results provide further insight into what factors influence time on the quantum level, to what extent quantum transitions can be considered instantaneous, and might pave the way to finally understand the role of time in quantum mechanics,\" Dil explains. Beyond deepening our understanding of time in quantum physics, the work offers a new tool for studying how electrons behave in complex materials. Knowing how long a quantum transition lasts could help scientists design materials with tailored quantum properties and support future technologies that depend on precise control of quantum states. Other contributors Lausanne Centre for Ultrafast Science (LACUS) Paul Scherrer Institut CY Cergy Paris Université Université Paris-Saclay University of West Bohemia The University of Tokyo",
      "cover_image_url": "https://www.sciencedaily.com/images/1920/physics-flow-of-time.webp"
    }
  ]
}