{
  "industry": "technology",
  "collected_at": "2026-02-09T16:31:37.284407+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Google‚Äôs Pixel 9A is back down to $349, its cheapest price so far",
      "url": "https://www.theverge.com/gadgets/875742/google-pixel9a-switch-2-case-netgear-gigabit-deal-sale",
      "published": "2026-02-09T16:24:56+00:00",
      "summary": "The Pixel 9A is an incredible phone that’s worth hopping on while it’s $349 for the 128GB version in blue, black, or pink at Amazon and Best Buy. It’s discounted ahead of the new Pixel 10A, for which Google will open pre-orders on February 18. That’s also when the company will share more details regarding [&#8230;]",
      "content_text": "The Pixel 9A is an incredible phone that‚Äôs worth hopping on while it‚Äôs $349 for the 128GB version in blue, black, or pink at Amazon and Best Buy . It‚Äôs discounted ahead of the new Pixel 10A, for which Google will open pre-orders on February 18 . That‚Äôs also when the company will share more details regarding specs and price for the midrange phone. Even at its original $499 price, our reviewer Allison Johnson felt that what you got for the money was just right. The Pixel 9A is an especially great value at this sale price. It has an IP68 rating, seven years of software updates, a larger, brighter screen than the Pixel 8A, plus wireless charging and a 120Hz refresh rate. Other great Verge-approved deals",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/pixel9amdeal.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Hacktivist scrapes over 500,000 stalkerware customers' payment records",
      "url": "https://techcrunch.com/2026/02/09/hacktivist-scrapes-over-500000-stalkerware-customers-payment-records/",
      "published": "2026-02-09T16:20:12+00:00",
      "summary": "More than half-a-million people who bought access to phone surveillance and social media snooping apps had their email address and partial payment card numbers published online.",
      "content_text": "A hacktivist has scraped more than half-a-million payment records from a provider of consumer-grade “stalkerware” phone surveillance apps, exposing the email addresses and partial payment information of customers who paid to spy on others. The transactions contain records of payments for phone tracking services like Geofinder and uMobix, as well as services like Peekviewer (formerly Glassagram), which purport to allow access to private Instagram accounts, among several other monitoring and tracking apps provided by the same vendor, a Ukrainian company called Struktura. The customer data also includes transaction records from Xnspy , a known phone surveillance app, which in 2022 spilled the private data from tens of thousands of unsuspecting people’s Android devices and iPhones. This is the latest example of a surveillance vendor exposing the information of its customers due to security flaws. Over the past few years, dozens of stalkerware apps have been hacked, or have managed to lose, spill, or expose people’s private data — often the victims themselves — thanks to shoddy cybersecurity by the stalkerware operators. Contact Us To contact Zack Whittaker securely, reach out via Signal username zackwhittaker.1337. Contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, or email . Stalkerware apps like uMobix and Xnspy, once planted on someone’s phone, upload the victim’s private data, including their call records, text messages, photos, browsing history, and precise location data, which is then shared with the person who planted the app. Apps like UMobix and Xnspy have explicitly marketed their services for people to spy on their spouses and domestic partners, which is illegal . The data, seen by TechCrunch, included about 536,000 lines of customer email addresses, which app or brand the customer paid for, how much they paid, the payment card type (such as Visa or Mastercard), and the last four-digits on the card. The customer records did not include dates of payments. TechCrunch verified the data was authentic by taking several transaction records containing disposable email addresses with public inboxes, such as Mailinator, and running them through the various password reset portals provided by the various surveillance apps. By resetting the passwords on accounts associated with public email addresses, we determined that these were real accounts. We also verified the data by matching each transaction’s unique invoice number from the leaked dataset with the surveillance vendor’s checkout pages. We could do this because the checkout page allowed us to retrieve the same customer and transaction data from the server without needing a password. The hacktivist, who goes by the moniker “wikkid,” told TechCrunch they scraped the data from the stalkerware vendor thanks to a “trivial” bug in its website. The hacktivist said they “have fun targeting apps that are used to spy on people,” and subsequently published the scraped data on a known hacking forum. The hacking forum listing lists the surveillance vendor as Ersten Group, which presents itself as a U.K.-presenting software development startup. TechCrunch found several email addresses in the dataset used for testing and customer support instead reference Struktura, a Ukrainian company that has an identical website to Ersten Group. The earliest record in the dataset contained the email address for Struktura’s chief executive, Viktoriia Zosim, for a transaction of $1. Representatives for Ersten Group did not respond to our requests for comment. Struktura’s Zosim did not return a request for comment.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2020/02/GettyImages-1128003505.jpg?resize=1200,818"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "GitHub Is Down",
      "url": "https://github.com/",
      "published": "2026-02-09T16:15:16+00:00",
      "summary": "<p>Article URL: <a href=\"https://github.com/\">https://github.com/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946872\">https://news.ycombinator.com/item?id=46946872</a></p> <p>Points: 116</p> <p># Comments: 38</p>",
      "content_text": "<p>Article URL: <a href=\"https://github.com/\">https://github.com/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946872\">https://news.ycombinator.com/item?id=46946872</a></p> <p>Points: 116</p> <p># Comments: 38</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Notifications are delayed",
      "url": "https://www.githubstatus.com/incidents/54hndjxft5bx",
      "published": "2026-02-09T16:12:19+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.githubstatus.com/incidents/54hndjxft5bx\">https://www.githubstatus.com/incidents/54hndjxft5bx</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946827\">https://news.ycombinator.com/item?id=46946827</a></p> <p>Points: 48</p> <p># Comments: 21</p>",
      "content_text": "Subscribe to updates for Notifications are delayed via email and/or text message. You'll receive email notifications when incidents are updated, and text message notifications whenever GitHub creates or resolves an incident. VIA SMS: Afghanistan (+93) Albania (+355) Algeria (+213) American Samoa (+1) Andorra (+376) Angola (+244) Anguilla (+1) Antigua and Barbuda (+1) Argentina (+54) Armenia (+374) Aruba (+297) Australia/Cocos/Christmas Island (+61) Austria (+43) Azerbaijan (+994) Bahamas (+1) Bahrain (+973) Bangladesh (+880) Barbados (+1) Belarus (+375) Belgium (+32) Belize (+501) Benin (+229) Bermuda (+1) Bolivia (+591) Bosnia and Herzegovina (+387) Botswana (+267) Brazil (+55) Brunei (+673) Bulgaria (+359) Burkina Faso (+226) Burundi (+257) Cambodia (+855) Cameroon (+237) Canada (+1) Cape Verde (+238) Cayman Islands (+1) Central Africa (+236) Chad (+235) Chile (+56) China (+86) Colombia (+57) Comoros (+269) Congo (+242) Congo, Dem Rep (+243) Costa Rica (+506) Croatia (+385) Cyprus (+357) Czech Republic (+420) Denmark (+45) Djibouti (+253) Dominica (+1) Dominican Republic (+1) Egypt (+20) El Salvador (+503) Equatorial Guinea (+240) Estonia (+372) Ethiopia (+251) Faroe Islands (+298) Fiji (+679) Finland/Aland Islands (+358) France (+33) French Guiana (+594) French Polynesia (+689) Gabon (+241) Gambia (+220) Georgia (+995) Germany (+49) Ghana (+233) Gibraltar (+350) Greece (+30) Greenland (+299) Grenada (+1) Guadeloupe (+590) Guam (+1) Guatemala (+502) Guinea (+224) Guyana (+592) Haiti (+509) Honduras (+504) Hong Kong (+852) Hungary (+36) Iceland (+354) India (+91) Indonesia (+62) Iraq (+964) Ireland (+353) Israel (+972) Italy (+39) Jamaica (+1) Japan (+81) Jordan (+962) Kenya (+254) Korea, Republic of (+82) Kosovo (+383) Kuwait (+965) Kyrgyzstan (+996) Laos (+856) Latvia (+371) Lebanon (+961) Lesotho (+266) Liberia (+231) Libya (+218) Liechtenstein (+423) Lithuania (+370) Luxembourg (+352) Macao (+853) Macedonia (+389) Madagascar (+261) Malawi (+265) Malaysia (+60) Maldives (+960) Mali (+223) Malta (+356) Martinique (+596) Mauritania (+222) Mauritius (+230) Mexico (+52) Monaco (+377) Mongolia (+976) Montenegro (+382) Montserrat (+1) Morocco/Western Sahara (+212) Mozambique (+258) Namibia (+264) Nepal (+977) Netherlands (+31) New Zealand (+64) Nicaragua (+505) Niger (+227) Nigeria (+234) Norway (+47) Oman (+968) Pakistan (+92) Palestinian Territory (+970) Panama (+507) Paraguay (+595) Peru (+51) Philippines (+63) Poland (+48) Portugal (+351) Puerto Rico (+1) Qatar (+974) Reunion/Mayotte (+262) Romania (+40) Russia/Kazakhstan (+7) Rwanda (+250) Samoa (+685) San Marino (+378) Saudi Arabia (+966) Senegal (+221) Serbia (+381) Seychelles (+248) Sierra Leone (+232) Singapore (+65) Slovakia (+421) Slovenia (+386) South Africa (+27) Spain (+34) Sri Lanka (+94) St Kitts and Nevis (+1) St Lucia (+1) St Vincent Grenadines (+1) Sudan (+249) Suriname (+597) Swaziland (+268) Sweden (+46) Switzerland (+41) Taiwan (+886) Tajikistan (+992) Tanzania (+255) Thailand (+66) Togo (+228) Tonga (+676) Trinidad and Tobago (+1) Tunisia (+216) Turkey (+90) Turks and Caicos Islands (+1) Uganda (+256) Ukraine (+380) United Arab Emirates (+971) United Kingdom (+44) United States (+1) Uruguay (+598) Uzbekistan (+998) Venezuela (+58) Vietnam (+84) Virgin Islands, British (+1) Virgin Islands, U.S. (+1) Yemen (+967) Zambia (+260) Zimbabwe (+263) Enter mobile number Enter the OTP sent To receive SMS updates, please verify your number. To proceed with just email click ‘Subscribe’",
      "cover_image_url": "https://dka575ofm4ao0.cloudfront.net/pages-twitter_logos/original/36420/GitHub-Mark-120px-plus.png"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Leaked specs for Sony‚Äôs next flagship wireless earbuds reveal ANC upgrades",
      "url": "https://www.theverge.com/tech/875782/sony-wf-1000xm6-earbuds-spec-leak",
      "published": "2026-02-09T16:05:03+00:00",
      "summary": "Following images of Sony's new WF-1000XM6 earbuds shared by a retailer last week ahead of an official announcement, reliable leaker billbil-kun has revealed what they're claiming are the full specs and new features of the company's next flagship buds. The WF-1000XM6 will be powered by a new QN3e processor that's \"three times faster\" than what's [&#8230;]",
      "content_text": "Following images of Sony‚Äôs new WF-1000XM6 earbuds shared by a retailer last week ahead of an official announcement, reliable leaker billbil-kun has revealed what they‚Äôre claiming are the full specs and new features of the company‚Äôs next flagship buds. The WF-1000XM6 will be powered by a new QN3e processor that‚Äôs ‚Äúthree times faster‚Äù than what‚Äôs inside the Sony WF-1000XM5 earbuds that debuted over two-and-a-half years ago. The upgraded processor will provide improved ANC performance alongside the addition of two more microphones, giving the WF-1000XM6 eight in total. The new earbuds will also feature a ‚Äúnew speaker, an improved DAC, and an enhanced amplifier,‚Äù according to billbil-kun. Battery life for the buds themselves will still be up to eight hours with ANC turned on, which can be extended by an extra 16 hours using their charging case, matching both the WF-1000XM5 and 2021‚Äôs WF-1000XM4 . As revealed last week through the early photos, Sony is also further refining the size, shape, and ergonomics of the WF-1000XM6 so they‚Äôre more comfortable to wear with ‚Äúinsulated tips‚Äù that could provide an improved fit. When connected to the Sony | Sound Connect app, you‚Äôll also have more control over how music sounds using an equalizer that‚Äôs being upgraded from five adjustable bands to 10.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/sony_earbuds_fd6cec.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Linux 6.19 arrives with a teaser for Linux 7.0",
      "url": "https://www.theverge.com/tech/875784/linux-kernel-7-0-announced",
      "published": "2026-02-09T15:58:43+00:00",
      "summary": "On Sunday, Linux developer Linus Torvalds announced the release of Linux 6.19, which will be the last update in this kernel cycle, as previously reported by Phoronix. It adds support for the modern AMDGPU driver for older AMD GCN 1.0 and 1.1 graphics cards, like Radeon HD 7000 series GPUs, along with Vulkan support through [&#8230;]",
      "content_text": "On Sunday, Linux developer Linus Torvalds announced the release of Linux 6.19 , which will be the last update in this kernel cycle, as previously reported by Phoronix . It adds support for the modern AMDGPU driver for older AMD GCN 1.0 and 1.1 graphics cards, like Radeon HD 7000 series GPUs, along with Vulkan support through the RADV driver, and improved power management. Linux 6.19 also includes improved HDR support with the addition of the DRM Color Pipeline, an updated Asus Armoury driver, expanded support for newer Intel Wildcat Lake and Nova Lake chips, PCIe link encryption and device authentication, and more. Along with the launch of Linux 6.19, Torvalds also teased the start of a new kernel cycle with the next update. ‚ÄúAs people have mostly figured out, I‚Äôm getting to the point where I‚Äôm being confused by large numbers (almost running out of fingers and toes again), so the next kernel is going to be called 7.0,‚Äù writes Linus in the update note. The next update could include even more improvements for AMD GPUs, display support for Intel Nova Lake and Qualcomm Snapdragon 8 Elite Gen 5 chips, and expanded sensor monitoring support for Asus motherboards, among other changes. Users on rolling release or semi-rolling release Linux distributions like Fedora and Arch can expect to get the most recent kernel update soon through their regular system updates. Distros that aren‚Äôt rolling release may take longer to get kernel updates.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/one-year-on-linux-mac-style-homescreen.png?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "AirPods Pro 4 Could Feature Cameras to 'See Around You'",
      "url": "https://www.macrumors.com/2026/02/09/airpods-pro-4-could-feature-cameras-to-see-around-you/",
      "published": "2026-02-09T15:56:16+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.macrumors.com/2026/02/09/airpods-pro-4-could-feature-cameras-to-see-around-you/\">https://www.macrumors.com/2026/02/09/airpods-pro-4-could-feature-cameras-to-see-around-you/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946617\">https://news.ycombinator.com/item?id=46946617</a></p> <p>Points: 11</p> <p># Comments: 13</p>",
      "content_text": "Apple's next-generation AirPods Pro will feature cameras to see around a user, according to the leaker and prototype collector known as \" Kosutami .\" In a new post on X, Kosutami said that the next AirPods Pro will be able to see around the wearer, presumably via cameras in each earbud. Supply chain analyst Ming-Chi Kuo said that the 2026 AirPods Pro will feature a \"more significant\" hardware upgrade in the form at least one tiny infrared camera . He previously said AirPods with infrared cameras could recognize hand gestures and provide an enhanced spatial audio experience with Apple's Vision Pro headset. Kosutami added that the new AirPods Pro will be available at the same $249 price as the current model. This contrasts with previous rumors suggesting that the next AirPods Pro would be a secondary version of AirPods Pro 3 this year, sitting in the lineup alongside the current model. The Chinese leaker known as \" Instant Digital \" corroborated the rumors about new AirPods Pro featuring infrared cameras for gesture controls, with some additional details and clarifications. Rather than being a new generation, the 2026 AirPods Pro will apparently be a pricier, high-end variant of the ‌AirPods Pro 3‌ introduced in 2025, suggesting that both models will ultimately be on sale alongside each other. It is worth noting that Apple offers two version of the AirPods 4 at $129 and $179 price points, so this is a highly plausible move. The current AirPods lineup has offerings priced at $129, $179, $249, and $549. An additional product between the $249 ‌AirPods Pro 3‌ and $549 AirPods Max seems possible, especially given the rise of higher end Bluetooth earbuds from the likes of Bang Olufsen, Bowers & Wilkins, and Bose. Regardless, back in September 2025, Kuo reported that Apple is planning to introduce a successor to the ‌AirPods Pro 3‌ in 2026. This would be somewhat unusual since Apple normally waits around three years to make major changes to the AirPods' hardware. AirPods Pro 2 debuted at the iPhone 14 event in September 2022, and they were updated with a USB-C charging case and a few other tweaks in September 2023. Otherwise, Apple has waited about three years to update all of its AirPods models. Whether they are a new, high-end version of the ‌AirPods Pro 3‌ or full-fledged AirPods Pro 4, launch timing is currently unclear, but Apple typically announces new AirPods in the second half of the year. The original AirPods, AirPods Pro 2 and their subsequent USB-C revision, ‌AirPods 4‌, and ‌AirPods Pro 3‌ were all announced at Apple's annual ‌iPhone‌ event in September.",
      "cover_image_url": "https://images.macrumors.com/t/8wP0Zh_srVooBagLxCHrfzrXWhE=/2000x/article-new/2019/10/airpods-pro-3-hearing-health.jpg"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "YouTube TV introduces cheaper bundles, including a $65/month sports package",
      "url": "https://techcrunch.com/2026/02/09/youtube-tv-introduces-cheaper-bundles-including-a-65-month-sports-package/",
      "published": "2026-02-09T15:47:08+00:00",
      "summary": "YouTube TV is offering new, less expensive plans that can be customized around topics like sports, news and entertainment.",
      "content_text": "YouTube on Monday introduced lower-priced YouTube TV plans that that will allow subscribers to better tailor their plans to their own interests in areas like sports, news, and entertainment. The company said that it will offer more than 10 different plans to choose from, all priced below the $82.99 per month main YouTube TV plan that has access to more than 100 networks. The new plans will start rolling out this week. While that main plan will not go away, the new plans will allow customers to pick what matters most and what they could do without in return for cost savings. YouTube Among the new plans are a $64.99 per month Sports plan, a Sports + News plan for $71.99 per month, a less expensive Entertainment plan for $54.99 per month, and a $69.99 per month News + Entertainment + Family plan, which includes kids’ content. The Sports plans include all major broadcasters, plus networks like FS1, NBC Sports Network, all of the ESPN networks, and ESPN Unlimited. This plan is $18 cheaper per month than the main plan. YouTube TV’s news channels include CNBC, Fox News, CNN, MS NOW, and Bloomberg, along with other national news channels. Combined with Sports, the package is priced $11 lower per month than the main YouTube TV plan. The entertainment only plan is $28 cheaper per month than the main plan, and includes major broadcasters as well as FX, Hallmark, Comedy Central, Bravo, Paramount, Food Network, and HGTV. Families with small kids can add on other channels like Disney Channel, Nickelodeon, National Geographic, Cartoon Network, and PBS Kids for a bit more. The company is also offering discounts for new subscribers, which could lower the price of certain plans further for either the first few months or the first year. Subscribers will continue to have access to YouTube TV’s unlimited DVR, support for up to six family members on one account, multiview, and more. Other add-ons like NFL Sunday Ticket + RedZone, HBO Max, and 4K Plus can also be purchased to customize plans further. The company says all the new plans will roll out over the next several weeks. Customized packages are now not a new idea in streaming — a la carte options were a key part of the early streaming pioneer Sling TV’s initial offering, for instance. This element of personalization was also one of the factors that was meant to make streaming a better alternative to traditional pay TV, where consumers often ended up paying for channels they didn’t want. But as streamers added more content, networks, and, in particular, sports programming, the cost of streaming inched back up to compete with cable and linear television. Live TV streamers like YouTube TV may have offered convenience and some savings over still more expensive cable , but it wasn’t exactly affordable anymore. These new packages hit the market at a time when consumer confidence is at its lowest in more than 11 years, due to fears about the labor market and higher prices, which have made consumers more cautious about their spending.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2020/06/youtube-tv.png?resize=1200,723"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Ask HN: Do provisional patents matter for early-stage startups?",
      "url": "https://news.ycombinator.com/item?id=46946464",
      "published": "2026-02-09T15:45:24+00:00",
      "summary": "<p>I am a solo founder building in AI B2B infra.<p>I am filing provisional patents on some core technical approaches so I can share more openly with early design partners and investors.<p>Curious from folks who have raised Pre-Seed/Seed or worked with early-stage companies: - Do provisionals meaningfully help in fundraising or partnerships? - Or were they mostly noise until later rounds / real traction?<p>I am trying to calibrate how much time/energy to put into IP vs just shipping + user traction at this stage.<p>Would love to hear real world experiences.</p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946464\">https://news.ycombinator.com/item?id=46946464</a></p> <p>Points: 5</p> <p># Comments: 2</p>",
      "content_text": "I am a solo founder building in AI B2B infra. I am filing provisional patents on some core technical approaches so I can share more openly with early design partners and investors. Curious from folks who have raised Pre-Seed/Seed or worked with early-stage companies: - Do provisionals meaningfully help in fundraising or partnerships? - Or were they mostly noise until later rounds / real traction? I am trying to calibrate how much time/energy to put into IP vs just shipping + user traction at this stage. Would love to hear real world experiences.",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Why is the sky blue?",
      "url": "https://explainers.blog/posts/why-is-the-sky-blue/",
      "published": "2026-02-09T15:39:51+00:00",
      "summary": "<p>Article URL: <a href=\"https://explainers.blog/posts/why-is-the-sky-blue/\">https://explainers.blog/posts/why-is-the-sky-blue/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946401\">https://news.ycombinator.com/item?id=46946401</a></p> <p>Points: 3</p> <p># Comments: 0</p>",
      "content_text": "Let‚Äôs start by asking ourselves: what color SHOULD the sky be ? Or, one step further back, what color should anything be? And the answer is: the color of anything is due to the wavelength of photons coming from that thing and hitting your eye. Well ackshually‚Ä¶ üßê These sidenotes are optional to read, but I‚Äôll use them for giving the fuller technical details when I‚Äôve abbreviated things in the main body of the text. In this case, the color you see is determined by the wavelengths of light entering your eye since (1) you may be seeing a pure frequency, but in almost all cases, (2) you‚Äôre seeing many frequencies, which your brain interprets as a single color. For instance, the sensation of turquoise at a specific point can be caused by (a) photons of wavelength 500nm emanating from that point, (b) a specific combo of photons of wavelengths 470nm and 540nm, or (c) (mostly realistically) photons of a huge number of wavelengths, probably peaking somewhere around 500nm. In the text, I am a bit fast and loose with the difference. When sunlight hits Earth‚Äôs atmosphere, most colors of photons pass through unencumbered. But blue photons have a tendency to ricochet around a lot. This causes them to disperse all throughout the atmosphere. They disperse so far and wide, and are so numerous, that you can look at any part of the sky on a clear afternoon and, at that moment, blue photons will be shooting from that point straight to your eyes. Therefore the sky is blue. Most colors of light pass through the atmosphere relatively unencumbered. You only see them when you look at the sun, where they contribute to the whiteness of the sun‚Äôs light. Blue, however, bounces around a lot, getting spread all over the sky. Because blue photons hit our eyeballs from every angle of the sky, the whole sky appears blue. What‚Äôs so special about blue? This is true and all, but it kicks the can down the road. Why blue ? Why not red? In short, it‚Äôs because blue and violet have the closest frequencies to a ‚Äúresonant frequency‚Äù of nitrogen and oxygen molecules‚Äôs electron clouds. There's a lot there, so we'll unpack it below. But first, here's an (interactive) demo. When a photon passes through/near a small molecule (like N 2 or O 2 , which make up 99% of our atmosphere), it causes the electron cloud around the molecules to ‚Äújiggle‚Äù. This jiggling is at the same frequency as the photon itself ‚Äì meaning violet photons cause faster jiggling than red photons. In any case, for reasons due the internal structure of the molecule, there are certain resonant frequencies of each molecule‚Äôs electron cloud. As the electron clouds vibrate closer and closer to these resonant frequencies, the vibrations get larger and larger. (This is completely analogous to pushing a child on a swing at the ‚Äúright‚Äù frequency so that they swing higher and higher) The stronger the electron cloud‚Äôs oscillations, the more likely a passing photon (a) is deflected in a new direction rather than (b) passes straight through. For both N 2 and O 2 , the lowest resonant frequency is in the ultraviolet range. So as the visible colors increase in frequency towards ultraviolet, we see more and more deflection, or ‚Äúscattering‚Äù. ‚ÄúScattering‚Äù is the scientific term of art for molecules deflecting photons. Linguistically, it‚Äôs used somewhat inconsistently. You‚Äôll hear both ‚Äúblue light scatters more‚Äù (the subject is the light ) and ‚Äúatmospheric molecules scatter blue light more‚Äù (the subject is the molecule ). In any case, they means the same thing ü§∑‚Äç‚ôÇÔ∏è In fact, violet is 10x more likely to scatter than red. Math talk: scattering increases proportional to the FOURTH power of the frequency. So higher frequency light means WAY more scattering. So why isn't the sky violet? Great question ‚Äì we'll cover that in a sec . I just want to point out two other things that (a) you can see in the demo above, and (b) are useful for later in this article. First, when light gets really close to ‚Äì and eventually exactly at ‚Äì the resonant frequency of the molecule‚Äôs electron cloud, it gets absorbed far more than scattered ! The photon simply disappears into the electron cloud (and the electron cloud bumps up one energy level). This isn‚Äôt important for understanding the color of Earth's sky‚Ä¶ but there are other skies out there üòâ Second, did you notice that even red scatters some ? Like, yes, blue scatters 10x more . But the sky is actually every color, just mostly blue/violet. This is why the sky is light blue. If white light is all visible colors of light mixed together equally, light blue is all visible colors mixed together ‚Äì but biased towards blue. What would the sky look like if it was only blue? Check it out. I'll just end by saying, this dynamic (where scattering increases sharply with the frequency of light) applies to far more than just N 2 and O 2 . In fact, any small gaseous molecule ‚Äì carbon dioxide, hydrogen, helium, etc. ‚Äì would preferentially scatter blue, yielding a blue sky at day. Why isn‚Äôt the sky violet? As you saw above, violet scatters more than blue. So why isn‚Äôt the sky purple? The dumb but true answer is: our eyes are just worse at seeing violet . It‚Äôs the very highest frequency of light we can see; it‚Äôs riiight on the edge of our perception. But! ‚Äì if we could see violet as well as blue, the sky would appear violet. We might as well tackle the elephant in the room: if we could see ultraviolet (which is the next higher frequency after violet), would the sky actually be ultraviolet? And the answer is not really . If we could see UV, the sky would be a UV-tinted violet, but it wouldn‚Äôt be overwhelmingly ultraviolet. First, because the sun emits less UV light than visible light. And second, some of that UV light is absorbed by the ozone layer, so it never ever reaches Earth‚Äôs surface. You can see both of those effects in the solar radiation spectrum chart: The sun emits the most visible light, with UV frequencies falling off very steeply. Augmenting this effect is that the ozone layer in particular absorbs a lot of UV before it can reach Earth‚Äôs surface. Why is the sunset red? So the obvious next question is why is the sky red at dusk and dawn? It‚Äôs because the sunlight has to travel through way more atmosphere when you‚Äôre viewing it at a low angle, and this extended jaunt through the atmosphere gives ample opportunity for allll the blue to scatter away ‚Äì and even a good deal of the green too! Simply put, the blue photons (and to a lesser degree, the green) have either (a) gone off into space or (b) hit the earth somewhere else before they reach your eyes. When the sun is on the horizon (e.g. sunrise or sunset), the photons it emits travel through 40x as much atmosphere to reach your eyes as they would at midday. So blue‚Äôs 10x propensity to scatter means it‚Äôs simply gone by the time it would‚Äôve reached your eyes. Even green is significantly dampened. Red light, which hardly scatters at all, just cruises on through. Again, you can play with this and see for yourself üòé Why are clouds white? The answer to this question is the second of three ‚Äúdomains‚Äù you should understand in order to have a working model of atmosphere color. The physics are different from the small-molecule scattering above. Clouds are made up of a huge number of tiny water droplets. These droplets are so small (around .02 millimeters in diameter) that they remain floating in the air. But compared to small gas molecules like N 2 and O 2 , these droplets are enormous . A single water droplet may be 100 trillion H 2 O molecules! A small cloud may be a quadrillion droplets. So, it‚Äôs not as simple as ‚Äúthe photons cause the hundreds of trillions of electrons to jiggle‚Äù. Instead, it‚Äôs more like the light has entered a very tiny prism or glass bead. In a prism, white light can reflect around, bounce off exterior or interior surfaces, and even reflect differently depending on frequency ‚Äì creating a rainbow effect. The droplet is just as complex. Some of the photons hitting the droplet bounce off the surface. Some enter it, bounce around inside once, twice, etc. ‚Äì and leave again. Perhaps a few are absorbed. As with a prism, different wavelengths of light will reflect at different angles. The specifics aren‚Äôt important ‚Äì you should just get the general gist. So whatever white (or slightly yellowish) light that came from the direction of the sun is leaving in many random directions. Think of every color, shooting off in different directions! And then multiply that by a quadrillion droplets! In sum, you just see every frequency of photon coming from every part of the cloud. And that means the cloud is white! This idea that the tiny droplets that comprise clouds scales up. Anything larger that light can enter ‚Äì drizzle, raindrops, hail ‚Äì will also tend towards white. But that raises the question ‚Äì what about things in between tiny molecules (N 2 , O 2 ) and the relatively enormous prism-like droplets? How do those things act? Well, the dust in the sky of Mars is a great example üòâ Why is the sky on Mars red? The answer to this question is the third of three ‚Äúdomains‚Äù you should understand in order to have a working model of atmosphere color. The physics are different from both the small-molecule scattering and large-droplet prism-dynamics above. The Martian sky is red because it‚Äôs full of tiny, iron-rich dust particles that absorb blue ‚Äì leaving only red to scatter. Yeah, yeah, I hear you. This answer is can-kicking! ‚ÄúDust, schmust. Why does it absorb blue ?‚Äù, you demand. OK, so the answer is actually fairly straightforward. And it generalizes. Here‚Äôs the rule: whenever you have solid particles in the atmosphere (very small ones, approximately the size of the wavelength of visible light), they generally tend to turn the air warm colors ‚Äì red, orange, yellow. If you live in an area with wildfires, you‚Äôve probably seen this effect here on Earth! An orangish-brown smoke-filled sky above Palo Alto. To really understand the reason, let‚Äôs back up and talk about some chemistry. Compared to tiny gas molecules, solid particles tend to have a much wider range of light frequencies that they absorb. For instance, we discussed how N 2 and O 2 have specific resonant frequencies at which they hungrily absorb UV photons. Move slightly away from those frequencies, and absorption drops off a cliff. But even for a tiny dust nanoparticle, there are many constituent molecules, each in slightly different configurations, each being jostled slightly differently by its neighbors. Consequently, the constituent molecules all have slightly different preferences of which frequency to absorb. Because the ‚Äúpeak‚Äù absorption of the molecules is usually violet or ultraviolet (as it is with small gases), blues/violets will make it to the surface much less than oranges/reds. Approximate light absorption from Martian dust as a function of wavelength Of course, a reasonable question is why are blue and violet absorbed so strongly by these dust particles? Well, those are the only photons with enough energy to bump the dust molecules‚Äôs electrons up to a new energy state. (Reminder: a photon‚Äôs energy is proportional to its frequency. Higher frequency ‚Äì e.g. violet ‚Äì means higher energy, and lower frequency ‚Äì e.g. red ‚Äì means lower energy) So, the exact specifics depend on the molecules in question, but generally , the level of energy needed to bump up the electron energy state in a dust or smog particle‚Äôs molecules corresponds to violet or UV photons. This is actually true of solids in general, not just atmospheric dust or aerosols. If you‚Äôve ever heard that purple was ‚Äúthe color of kings‚Äù or that the purple dye of antiquity was worth its weight in gold, it‚Äôs true! To get something purple, you‚Äôd need to find a material whose electrons were excited by low-energy red photons, but had no use for higher-energy violet photons. A Tyrian purple shroud of Charlemagne So this is why the Martian sky is red ‚Äì and why reds and browns are more common in nature (for solid things, at least) than purple and blue. Why is the Martian sunset blue? It‚Äôs less famous than the red daytime sky of Mars, but the Martian sunset is blue! Martian sunset photo taken by the Spirit rover. Photo by NASA/JPL/Texas A&M/Cornell. In the last section, we talked about Martian dust absorbing violet/blue. But the dust also scatters light ‚Äì which it can do totally unrelated to how it absorbs (remember, since photons can ‚Äì and usually do ‚Äì cruise straight through a molecule, scattering and absorbing can have their own interesting frequency-dependent characteristics. They don‚Äôt simply sum to 100%) Small atmospheric particles, like dust and smog, are equal-opportunity scatterers. The absolute probability they‚Äôll scatter a photon does not change significantly with the photon‚Äôs wavelength. However , different-frequency photons can be more or less likely to scatter in different directions . For our purposes, it suffices to know that Martian dust ‚Äì like many atmospheric particles of similar size ‚Äì generally scatters blue light closer to the direction it was already going . Red light has a higher probability of deflecting at a greater angle. Because red light deflects MORE and blue light LESS when scattering off dust particles, the area directly around the sun will be blue ‚Äì even though more blue is absorbed en route. When molecules deflect photons only a tiny angle, it‚Äôs called ‚Äúforward scattering‚Äù. Forward scattering is the most pronounced for larger particles, like dust or smog aerosols. It‚Äôs actually so strong on Mars that even at midday, red light doesn‚Äôt fill the sky evenly ‚Äì the sky opposite the sun is noticeably darker! But blue‚Äôs tendency to forward-scatter more directly against Martian dust means the Martian sunset has a blue halo. Building a model At the beginning of this article, I said being able to predict something is a good measure of how well you understand it. Let‚Äôs do that now. Let‚Äôs build a model for predicting the sky color on new planets/moons, or during different scenarios on our own planet. (Not the most practical thing, but a good nerdsnipe üôÇ) Here are the three general rules of thumb we‚Äôve already talked about. Small gas molecules = blue/green atmosphere Atmospheric gases tend to be much, much smaller than the wavelengths of visible light. In these cases, they tend to preferentially scatter blue/violet/UV. This means that gaseous atmospheres are usually blue or blue-green . Earth: atmosphere is 99% nitrogen and oxygen. Uranus: upper atmosphere is 98% hydrogen and helium. We don‚Äôt have pictures from the surface. Patrick Irwin, University of Oxford. Neptune: upper atmosphere is 99% hydrogen and helium. We don‚Äôt have pictures from the surface. Patrick Irwin, University of Oxford. This is pleasingly true for Earth, Uranus, and Neptune. You may recall Neptune as looking like a much darker, richer blue. However, more recent analysis by Patrick Irwin shows the true color is very likely closer to what‚Äôs shown here. It's also worth noting that Neptune and Uranus's blue color is made noticeably richer by the red-absorbing methane in their atmospheres. Dust or haze = red/orange/yellow atmospheres When visible light hits particles that are in the ballpark of its own wavelength, things get more complicated and can differ on a case-by-case basis. These particles are typically either: Dust: solid particles kicked up by mechanical means (wind, volcanos, meteorites) Haze: solid particles formed by chemical reactions in the atmosphere Dust and haze generally makes atmospheres appear warmer colors ‚Äì e.g. red, orange, yellow. Mars: iron oxide dust. NASA/JPL-Caltech/ASU/MSSS Titan (a moon of Saturn): haze of organic molecules. ESA/NASA/JPL/University Of Arizona ",
      "cover_image_url": "/assets/img/meta/sky.png"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Discord to roll out age verification next month for full access to its platform",
      "url": "https://techcrunch.com/2026/02/09/discord-to-roll-out-age-verification-next-month-for-full-access-to-its-platform/",
      "published": "2026-02-09T15:39:02+00:00",
      "summary": "All users will be put into a \"teen-appropriate experience\" by default unless they prove that they are adults.",
      "content_text": "Discord is rolling out age verification globally starting next month, the company announced on Monday. All users will be put into a “teen-appropriate experience” by default unless they prove they’re adults. Age verification will be required to change certain settings and access age-restricted content. Discord users will need to be confirmed as adults in order to unblur sensitive content or turn off the setting, and only adults can access age-restricted channels, servers, and app commands. Additionally, messages from people a user may not know are routed to a separate inbox by default, and only verified adults can modify this setting. People will receive warning prompts for friend requests from users they may not know, and only adults will be able speak on stage in servers. To complete age verification, users need to either complete a facial age estimation or submit an ID to Discord’s vendor partners. The platform plans to add more options in the future. Discord notes that some users may be asked to use multiple methods when additional information is needed to assign an age group. The facial age estimation requires video selfies, which Discord says never leave your device. Additionally, the company says IDs submitted to its vendor partners are deleted quickly, and in most cases, immediately after age confirmation. It’s worth noting that Discord disclosed last October that around 70,000 users may have had sensitive data, such as their government ID photos, exposed after hackers breached a third-party vendor that the platform uses for age-related appeals. The breach reflected digital rights activists’ concerns over the use of age checks as a way to make the internet “safer.” Discord’s global launch of age verification follows the company’s decision to establish age checks for users in the U.K. and Australia last year. Techcrunch event Boston, MA | June 23, 2026 “Rolling out teen-by-default settings globally builds on Discord’s existing safety architecture, giving teens strong protections while allowing verified adults flexibility,” said Savannah Badalich, head of product policy at Discord, in a press release. “We design our products with teen safety principles at the core and will continue working with safety experts, policymakers, and Discord users to support meaningful, long term wellbeing for teens on the platform.” The announcement mirrors similar moves made by other online platforms, reflecting growing international efforts to strengthen child safety. Most recently, Roblox introduced mandatory facial verification for access to chats on its platform. Last July, YouTube launched its age-estimation technology in the U.S. to identify teen users in order to provide a more age-appropriate experience. Discord’s age-verification changes will begin in early March, and both new and existing users will need to verify their age to access age-restricted content.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2024/09/discord-app-logo.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "Ars Technica",
      "title": "Report: Imminent Apple hardware updates include MacBook Pro, iPads, and iPhone 17e",
      "url": "https://arstechnica.com/gadgets/2026/02/report-imminent-apple-hardware-updates-include-macbook-pro-ipads-and-iphone-17e/",
      "published": "2026-02-09T15:28:40+00:00",
      "summary": "High-end Macs and less-expensive iPhones and iPads are all on the docket.",
      "content_text": "Apple’s 2026 has already brought us the AirTag 2 and a new Creator Studio app subscription aimed at independent content creators, but nothing so far for the company’s main product families. That could change soon, according to reporting from Bloomberg’s Mark Gurman. New versions of Apple’s low-end iPhone, the basic iPad and iPad Air, and the higher-end MacBook Pros are said to be coming “imminently,” “soon,” and “shortly,” respectively, ahead of planned updates later in the year for the iPad mini, Studio Display, and other Mac models. Here’s what we think we know about the hardware that’s coming. iPhone 17e Apple is apparently planning to launch an updated iPhone 17e, a new version of its basic iPhone. The phone is said to include an A19 chip similar to the one in the regular iPhone 17, and it will also add MagSafe charging. Though the iPhone 17e will likely stick to the basic one-lens camera system and the notched, Dynamic Island-less screen, it will also launch at the same $599 price as the current 16e, which counts as good news given current AI-driven RAM and storage shortages. This would be a change in how Apple approaches its lower-end iPhone. The old iPhone SE was updated pretty sporadically, with at least a couple of years between each of its updates. The iPhone 16e was introduced just last year . The biggest question is whether the 17e will continue to exist alongside the older but arguably superior iPhone 16 and 16 Plus, which start at just $100 more than the current iPhone 16e and include a dual-lens camera system and the Dynamic Island. Having four different iPhone models available in the same $600-to-$800 price range is confusing at best.",
      "cover_image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/iPhone-16e-Action-button-1152x648.jpg"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "YouTube TV reveals pricing for its sports, news, and entertainment packages",
      "url": "https://www.theverge.com/news/875751/youtube-tv-custom-channel-packages-pricing",
      "published": "2026-02-09T15:27:56+00:00",
      "summary": "YouTube TV has shared more details about the custom channel packages it will start rolling out this week. The new packages are cheaper than YouTube TV's standard $82.99 / month plan, and will span sports, entertainment, and news. Here's a breakdown of each package: YouTube TV says people who sign up for one of these [&#8230;]",
      "content_text": "YouTube TV has shared more details about the custom channel packages it will start rolling out this week. The new packages are cheaper than YouTube TV‚Äôs standard $82.99 / month plan, and will span sports, entertainment, and news. Here‚Äôs a breakdown of each package: YouTube TV says people who sign up for one of these packages can still add up to six people to one account, as well as access features like unlimited DVR, multiview, and key plays. These aren‚Äôt the only packages that YouTube TV plans on rolling out, however, as the company says it plans to launch more than 10 bundles. The platform is also getting ready to launch custom multiview , which will allow subscribers to watch more types of channels side by side.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/acastro_STK092_02.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Hong Kong pro-democracy tycoon gets 20 years' jail under national security law",
      "url": "https://www.bbc.com/news/articles/c8d5pl34vv0o",
      "published": "2026-02-09T15:25:07+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.bbc.com/news/articles/c8d5pl34vv0o\">https://www.bbc.com/news/articles/c8d5pl34vv0o</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946248\">https://news.ycombinator.com/item?id=46946248</a></p> <p>Points: 92</p> <p># Comments: 52</p>",
      "content_text": "Lai, a British citizen, is the most prominent of the hundreds arrested under the law. A fierce critic of China, he often wielded his paper, Apple Daily, as a tool of protest.",
      "cover_image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/92d6/live/cb1d3dc0-0580-11f1-a753-9525d46c4e23.jpg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Sleeper Shells: How Attackers Are Planting Dormant Backdoors in Ivanti EPMM",
      "url": "https://defusedcyber.com/ivanti-epmm-sleeper-shells-403jsp",
      "published": "2026-02-09T15:11:07+00:00",
      "summary": "<p>Article URL: <a href=\"https://defusedcyber.com/ivanti-epmm-sleeper-shells-403jsp\">https://defusedcyber.com/ivanti-epmm-sleeper-shells-403jsp</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46946062\">https://news.ycombinator.com/item?id=46946062</a></p> <p>Points: 44</p> <p># Comments: 10</p>",
      "content_text": "Exploitation of Ivanti Endpoint Manager Mobile (EPMM) has been relentless since vulnerability disclosure. Thatâ€™s not necessarily news. Major institutions - governments included - have already been compromised through this vector, and weâ€™re tracking another exploitation wave as it develops. On February 4th, 2026 , a coordinated campaign started across our telemetry with a differing pattern to previous mass exploitation. Rather than the smash-and-grab post-exploitation youâ€™d expect - dropping traditional webshells, running recon and enumeration commands - this operator did something more deliberate, uploading a payload, confirming it landed, and leaving. No commands were executed, the implant was simply left in place. Key Takeaway: This campaign deployed a dormant in-memory Java class loader to /mifs/403.jsp - a somewhat lesser common webshell path. The implant can only be activated with a specific trigger parameter, and no follow-on exploitation has yet been observed. This is suggstive of initial access broker (IAB) tradecraft: gain a foothold, then sell or hand off access later. # The Vulnerabilities Ivanti disclosed two critical vulnerabilities in EPMM - CVE-2026-1281 and CVE-2026-1340 - both covering authentication bypass and remote code execution, affecting different packages (aftstore and appstore respectively). The practical outcome is the same: unauthenticated access to application-level endpoints. Ivanti published patching guidance via their security advisory , and exploitation in the wild followed shortly after. Most of the early activity was predictable - opportunistic scanning, mass exploitation, and commodity webshell drops. # The 403.jsp Campaign Every exploit from this campaign dropped a webshell to the path: /mifs/403.jsp The path itself isnâ€™t new - 403.jsp has been observed in prior compromises targeting Ivanti and MobileIron infrastructure, typically alongside other JSP-based webshells. What made this campaign worth writing about isnâ€™t where the payload was placed, but what it did once it got there. Rather than deploying a conventional webshell with interactive command execution, the operator delivered a Base64-encoded Java class file via HTTP parameters. Each payload decoded to valid Java bytecode (identifiable by the CAFEBABE header) functioning as a dormant in-memory class loader - not an immediately usable backdoor. The distinction matters, and weâ€™ll get into why below. # Inside base.Info - The In-Memory Loader The payload is a compiled Java class ( base.Info , source file Info.java ). Itâ€™s not a webshell in the traditional sense - it doesnâ€™t provide command execution, file access, or any interactive capability on its own. Itâ€™s a stage loader: its only purpose is to receive, load, and execute a second Java class delivered via HTTP at a later time. # How It Works The class uses equals(Object) as its entry point, which is unusual but intentional - standard servlet handler methods like doGet or doPost are more likely to be flagged by security tooling. The parseObj method extracts HttpServletRequest and HttpServletResponse from the argument, with fallback logic to handle PageContext objects and various servlet wrapper/facade patterns. This makes the loader portable across different container environments. Once invoked, the loader checks for an HTTP parameter named k0f53cf964d387 . If present, it strips a two-character prefix from the value and Base64-decodes the remainder into raw bytes. These bytes are then loaded as a Java class in memory via a reflective call to ClassLoader#defineClass - nothing is written to disk. The resulting class is instantiated with a string argument containing basic host information, and its toString() output is returned in the HTTP response. The response body is wrapped in fixed delimiters ( 3cd3d / e60537 ) and served as text/html , making it straightforward for automated tooling to parse. For Base64 handling, the loader supports both java.util.Base64 (Java 8+) and sun.misc.BASE64Decoder , ensuring compatibility across older and newer JVM versions. # Host Fingerprinting Before invoking the second-stage class, the loader gathers a small set of environment details: the application working directory ( user.dir ), filesystem root paths (drive letters on Windows, / on Unix), the OS name, and the running username. This information is passed to the second-stage class as a constructor argument - likely to help the operator orient themselves on the target at a later date. # What We Didnâ€™t See This is the part that matters from a defensive standpoint. Across all observed telemetry, the loader was deployed and confirmed functional, but no follow-on requests were observed supplying a second-stage class to the trigger parameter . The access was established and then left dormant. This is consistent with initial access broker (IAB) activity. The tooling is generic and container-agnostic - itâ€™s built to work reliably across environments, not to perform any specific post-exploitation task. The operator deployed it at scale, verified it landed, and moved on. The likely purpose is to package confirmed, working access for handoff or sale to a separate party, who would activate it from different infrastructure at a later time. That separation - one actor establishes access, another exploits it - is what makes this pattern difficult to detect in practice. Thereâ€™s a gap between the initial compromise and eventual use where the telemetry trail simply goes quiet. # What To Look For If youâ€™re running Ivanti EPMM, the presence of any of this activity should be treated as evidence of compromise or attempted compromise - even without follow-on exploitation. Especially without follow-on exploitation. The absence of further activity doesnâ€™t mean the access isnâ€™t valuable; it may simply mean it hasnâ€™t been activated yet. Immediate actions: Patch Ivanti EPMM per vendor guidance immediately. Restart affected application servers to flush in-memory implants - this is critical, as the payload never touches disk. Then review access logs with the indicators below. # Log Indicators Any requests to /mifs/403.jsp Large Base64 parameters beginning with yv66vg (the Base64 encoding of the CAFEBABE Java magic bytes) The parameter name k0f53cf964d387 in request strings Response bodies containing the markers 3cd3d or e60537 Any response containing ERROR:// (the loaderâ€™s error format) # Indicators of Compromise # Artifact Field Value Class Name base.Info Source File Info.java SHA-256 097b051c9c9138ada0d2a9fb4dfe463d358299d4bd0e81a1db2f69f32578747a # Network IOCs - Source IPs IP Address Organization ASN Country 104.219.171.96 Datacamp Limited AS212238 ðŸ‡ºðŸ‡¸ 108.64.229.100 AT&T Enterprises, LLC AS7018 ðŸ‡ºðŸ‡¸ 115.167.65.16 NTT America, Inc. AS2914 ðŸ‡ºðŸ‡¸ 138.36.92.162 HOSTINGFOREX S.A. AS265645 ðŸ‡ºðŸ‡¸ 146.103.53.35 Datacamp Limited AS212238 ðŸ‡ºðŸ‡¸ 148.135.183.63 Datacamp Limited AS212238 ðŸ‡ºðŸ‡¸ 151.247.221.59 Datacamp Limited AS212238 ðŸ‡ºðŸ‡¸ 166.0.83.171 UK Dedicated Servers Limited AS42831 ðŸ‡¬ðŸ‡§ 172.59.92.152 T-Mobile USA, Inc. AS21928 ðŸ‡ºðŸ‡¸ 185.240.120.91 Datacamp Limited AS212238 ðŸ‡ºðŸ‡¸ 185.239.140.40 Datacamp Limited AS212238 ðŸ‡ªðŸ‡¸ 194.35.226.128 LeaseWeb Netherlands B.V. AS60781 ðŸ‡³ðŸ‡± 193.41.68.58 LeaseWeb Netherlands B.V. AS60781 ðŸ‡³ðŸ‡± 77.78.79.243 SPCom s.r.o. AS204383 ðŸ‡¨ðŸ‡¿ 62.84.168.208 Hydra Communications Ltd AS25369 ðŸ‡¬ðŸ‡§ 45.66.95.235 Hydra Communications Ltd AS25369 ðŸ‡¬ðŸ‡§ 46.34.44.66 Liberty Global Europe Holding B.V. AS6830 ðŸ‡³ðŸ‡± More IOCs available in Defused telemetry. # Third-Party Detection The base.Info class was submitted to VirusTotal, where it received a hit from Nextron Systemsâ€™ THOR APT Scanner under a generic JSP webshell characteristics rule. Traditional AV engines largely miss the artifact - unsurprising for a payload that never touches disk - but heuristic engines correctly identify the behavioural signatures consistent with in-memory class loaders. See the VirusTotal entry here. # The Quiet Ones Are Worse Thereâ€™s a tendency in incident response to prioritise the loud compromises - the ransomware detonations, the mass data exfiltration, the lateral movement storms that light up every detection rule in the stack. This campaign is a useful reminder that the most dangerous intrusions are often the ones that donâ€™t do anything. Yet. The use of undocumented JSP paths, in-memory Java loaders, and dormant execution triggers represents a meaningful step forward in post-exploitation tradecraft targeting enterprise mobility infrastructure. When the operatorâ€™s goal is to create inventory rather than cause immediate damage, all the usual urgency signals go quiet - and thatâ€™s exactly the point. If youâ€™re running Ivanti EPMM, donâ€™t wait for the second act. Patch, restart, and hunt. The loader is patient. You donâ€™t have to be. Parts of the technical analysis above have been AI-assisted.",
      "cover_image_url": "https://defusedcyber.com/images/posts/ivantishells.jpg"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Uber to buy delivery arm of Turkey's Getir",
      "url": "https://techcrunch.com/2026/02/09/uber-to-buy-delivery-arm-of-turkeys-getir/",
      "published": "2026-02-09T15:07:03+00:00",
      "summary": "The deal will see Uber paying $335 million at the outset to purchase Getir's food delivery business. Uber will also pay $100 million for a 15% stake in Getir's grocery, retail and water delivery business.",
      "content_text": "Uber has agreed to acquire the delivery business of Turkey’s Getir, once one of the biggest success stories of the country’s startup ecosystem, the company announced on Monday The deal will see Uber paying $335 million at the outset to purchase Getir’s food delivery business. The ride-hailing giant will also pay $100 million for a 15% stake in Getir’s grocery, retail and water delivery business, and said it would complete the acquisition of the division over the next few years. Uber is buying the business from Getir’s biggest shareholder, the Emirati sovereign wealth fund Mubadala. The investment firm was reportedly seeking to sell its stake in the company last year. The deal comes after a turbulent few years for Getir, which once enjoyed a valuation of $12 billion, that saw the startup scale down its operations massively. The company launched to great traction in 2015, and invested aggressively to expand its operations in the U.S. and Europe, both organically and via acquisitions, especially during the pandemic. But after the pandemic lockdowns eased, broader consumer demand for food and grocery delivery also wavered, and Getir chose to cut its losses in 2024, shutting shop and laying off thousands of staff in the U.S., U.K, and Europe in order to focus on business back home. Nearly a year ago, the company went through a struggle for control over a restructuring plan proposed by Mubadala. The plan was opposed by one of Getir’s co-founders, who eventually sued to fight the “illegal coup,” but a Dutch court rejected the founder’s appeals. The company has raised a total of $2.40 billion so far, according to PitchBook. Documents filed by Getir in court last year show the company valued its group assets at $374 million. Techcrunch event Boston, MA | June 23, 2026 “This transaction reflects the strength of the business and the progress it has made, particularly over the last year,” Waleed Al Mokarrab Al Muhairi, deputy group CEO at Mubadala, said in a statement. Uber said it would combine the new unit’s services with Trendyol Go, a food and grocery delivery service in Turkey that the ride-hail giant bought for $700 million last May. Uber said Getir’s food delivery business alone recorded gross bookings of more than $1 billion in 2025, up 50% from a year earlier. The deal follows a strong showing by Uber’s delivery business in the fourth quarter, reporting revenue of $4.89 billion, up 30% from a year earlier. The company said Europe, Middle-East and Asia proved the fastest-growing region for the business in 2026.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2023/11/getir-11-9-23.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Call for speakers: TechCrunch Founder Summit 2026",
      "url": "https://techcrunch.com/2026/02/09/call-for-speakers-techcrunch-founder-summit-2026/",
      "published": "2026-02-09T15:00:00+00:00",
      "summary": "Submit to speak at TechCrunch Founder Summit 2026 to lead a roundtable. Share scaling insights with 1,100 founders on June 23 in Boston. Apply here.",
      "content_text": "Have real-world scaling experience? The TechCrunch Founder Summit 2026 stage is calling. On June 23 in Boston , this annual founder-focused event will convene 1,100+ founders and investors to explore the realities of scaling startups across every stage. We’re seeking experienced founders, VCs, and startup operators to lead interactive roundtable discussions rooted in practical, real-world insight. We’re bringing together experienced leaders from across the startup ecosystem to host interactive roundtable sessions designed to spark real conversations. This is where founders get honest guidance, tactical takeaways, and clarity on the challenges that come with growth. Apply here to get started. Apply to lead a roundtable session Roundtables at TC Founder Summit are built for depth, not decks. Each session is a 30-minute, informal discussion led by up to two speakers, with no slides or video — just meaningful dialogue and practical insight. These intimate conversations create space for founders to ask real questions and connect directly with experts who’ve been there before. To apply, click “Apply to Speak” on the event page , submit your proposed topic, and share your experience as a scaling expert. TC Founder Summit is the ideal platform to contribute to the next generation of startup leaders. Image Credits: Halo Creative Speaker benefits Speaking at TC Founder Summit is more than visibility. It’s full access to the experience. Along with elevating your authority and brand, you’ll gain premium entry to breakout sessions, roundtables, and curated networking with founders seeking guidance and VCs scouting what’s next. Plus, TechCrunch will amplify your participation through: Techcrunch event Boston, MA | June 23, 2026 Event agenda placement on the web and mobile app Inclusion in a shared TechCrunch.com article Social media promotion across TechCrunch channels Make your impact by applying today Lead the conversation. Share what you’ve learned. Help founders navigate the highs and lows of scaling, and strengthen your reputation as a trusted voice in the startup community. Apply early. TC Founder Summit takes place on June 23, but speaker applications close well before then. Submit now and be part of TechCrunch’s annual founder bootcamp. Image Credits: Halo Creative",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2025/12/TC-All-Stage-2025-roundtable.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Siemens CEO Roland Busch‚Äôs mission to automate everything",
      "url": "https://www.theverge.com/podcast/875233/siemens-ceo-roland-busch-ai-automation-digital-twins-nato-tariffs",
      "published": "2026-02-09T15:00:00+00:00",
      "summary": "Today, I’m talking with Roland Busch, who is the CEO of Siemens. Siemens is one of those absolutely giant, extremely important, but fairly opaque companies we love to dig into on Decoder. At a very basic, reductive level, Siemens makes the hardware and software that allow other companies to run and automate their stuff. Everyone [&#8230;]",
      "content_text": "Today, I‚Äôm talking with Roland Busch, who is the CEO of Siemens. Siemens is one of those absolutely giant, extremely important, but fairly opaque companies we love to dig into on Decoder . At a very basic, reductive level, Siemens makes the hardware and software that allow other companies to run and automate their stuff. Everyone has seen the Siemens logo somewhere, whether it‚Äôs under the hood of their cars, stamped on control systems in fancy buildings, or scattered across factory floors. But since it‚Äôs not really a consumer-facing company, it‚Äôs hard to know what ties all these ideas together ‚Äî and what some 320,000 Siemens employees across the world are actually working on. How all those people are organized and work together is wildly complicated. Roland and I spent some real time just talking through the Siemens corporate structure, which, for my true Decoderheads out there, was incredibly fascinating. Verge subscribers, don‚Äôt forget you get exclusive access to ad-free Decoder wherever you get your podcasts. Head here . Not a subscriber? You can sign up here . We also spent a lot of time talking about automation broadly and what happens as AI brings automation from the physical world of factories into the digital world of accounting and procurement ‚Äî the things that help decide what factories should be doing. Roland‚Äôs vision is for Siemens to automate the whole factory process, upstream and downstream of actually making things. And you‚Äôll hear him describe that outcome as fairly utopian: a smooth, seamless, optimal operation. Very German. But I wanted to press him on how dystopian it sounds to me. Because in Roland‚Äôs vision, it seems like there‚Äôs a whole class of people who just‚Ä¶ don‚Äôt have jobs anymore. And the ones who do have jobs don‚Äôt really have a whole lot of autonomy or fulfillment from them, but basically just serve as the hands for the all-seeing AI. So I asked him fairly directly about that. And if that‚Äôs not already all complicated enough: Siemens is a government and defense contractor on both sides of the Atlantic and a company whose overall growth is directly tied to free trade and globalization in the postwar era. A lot is going on right now that might challenge how the world works, especially if tensions keep rising between the US and Europe , and so I had to ask him point-blank: Do you think about what you‚Äôll do if NATO collapses? Because that‚Äôs not as far-fetched a question as it used to be. There‚Äôs a lot in this one, and Roland was game for it all. I think you‚Äôll leave with a lot to think about ‚Äî certainly more to think about whenever you see all those Siemens logos. Okay: Siemens CEO Roland Busch. Here we go. This interview has been lightly edited for length and clarity. Roland Busch, you are the president and CEO of Siemens. Welcome to Decoder . Thank you, Nilay. Nice to meet you. It‚Äôs nice to meet you as well. There‚Äôs a lot to talk about. Siemens is a huge company. It has a long history. You‚Äôve been in a lot of businesses, you‚Äôve been out of a lot of businesses. You have worked there since the ‚Äò90s. The world is very complicated right now, and Siemens is a very big, very complicated multinational operating in that world. I‚Äôm curious how you are thinking of all that. So let me just start at the start: Siemens isn‚Äôt a consumer company. I think a lot of Decoder listeners have seen the logo, but maybe don‚Äôt understand the company. How would you describe Siemens today? What is the company? Indeed, it‚Äôs not that easy. We have come a long way. It‚Äôs been more than 170 years since the company was founded, and we made so many changes in our portfolio and in our company. Actually, when people talk about it, I say there‚Äôs one constant in our history, which is that we reinvented ourselves over and over again. And absolutely, we are now in the midst of another reinvention or transformation with one difference. This is the fastest and most fundamental one we ever had because of technology. And then people ask, ‚ÄúWhat is Siemens about? Because you now have Siemens Healthineers, you have Siemens Energy, you have Siemens?‚Äù And actually, it‚Äôs not that easy to describe. Siemens Healthineers has the task in its name. It‚Äôs about healthcare. Siemens Energy has the task in its name; it‚Äôs about energy. But Siemens is not that clear. So here is how I explain it. We transform, with our technology, every day for everyone. Okay, that doesn‚Äôt get you closer. But now, the point is that you have to look behind the curtain, and then you see what Siemens technology does. When you see a car passing by‚Ä¶ Eventually, all cars will be touched by Siemens technology. It is either cars that are designed by our technology, or they are manufactured by it. Every third manufacturing line in the world is run by Siemens controls. If you walk through New York, you cannot walk a block without passing by a building that is automated by Siemens technology. I think we are controlling ... I mean, something like a little bit less than 50 percent of electrons are touched by Siemens technologies in our distribution systems, low voltage systems. And if you talk about healthcare, if you get a scan somewhere in the world, the likelihood that it‚Äôs a Siemens CT or MR scan is a little bit shy of 50 percent. And this is what we do. We produce. We have technology which enables others to transform their everyday. And that is what Siemens is about. So I listen to that, and I experience Siemens everywhere. I‚Äôm the person who pays attention to how a building is automated. I talk to a lot of car CEOs; I hear about Siemens as a supplier to the car industry quite a bit. It sounds like what you were describing basically is you operate things for people, or you build technologies or products that operate other things for people. There are a lot of things in the world to operate. How do you organize the company? How do you think about where there‚Äôs opportunity and where there‚Äôs growth and investment, and then how do you think about your resources? Because it seems like we operate things for everyone. That‚Äôs a pretty wide remit that you could focus down in any number of ways. This is an absolutely valid question because now we are active in so many different industries. It‚Äôs industries, manufacturing, process industries, but we are also in buildings, grids, and mobility. So people, trains, and signaling systems. The first basis of Siemens is ‚Äî and this is where our value sits ‚Äî in our technology platform, and in our design software. We have one of the largest software companies in the world. If it comes to industrial software, we are the largest. And with our software, you can build the most comprehensive physics-based digital twin of whatever product you do. And we are now expanding into molecules. So another one is automation technology, as talked about, or it can be for discrete process manufacturing. We also go for software-defined automation, which is kind of a disruption. Anything. We are the largest automation company. We are automating grids, we‚Äôre automating buildings, we‚Äôre automating signaling systems, we‚Äôre automating trains, and we are automating manufacturing. So the underlying technology is where the value is. Now, we are bringing this technology to different verticals, so markets. It‚Äôs the industrial markets, food and beverage, chemicals, automotive, machine builders, utilities, mobility operators, and the like. And then at this point, the domain know-how comes into play. So having technology is one thing, but having the domain know-how to deploy it, to talk customers‚Äô language, is another one. And on top, quite obviously, is that the whole thing is now supercharged by AI technologies, which we are rolling in as we speak. We have a long history regarding AI. Actually, one of the first supercomputers to do machine learning algorithms was Synopsys. I mean, this was in the ‚Äò90s. Siemens had the most powerful one. This was the great-grandfather of the GPUs today. And since then, we have been working with artificial intelligence technologies, but this is now a new level that we want to bring it to. So the organization, obviously, we are organizing according to businesses. They are reflecting the markets we are acting in, but you have to look at it from the back, the underlying technology, including the data, which is super relevant. I‚Äôm very curious to talk to you about AI and automation. I think that‚Äôs very important. Digital twins, I‚Äôm curious about that. It seems like the future of automation is very rich. We‚Äôre moving from Siemens automating a lot of atoms, automating the physical world, to automating bits, and that‚Äôs a long conversation that I want to come to. I just want to stay focused on the company for one more turn here and ask the Decoder questions, because I feel like the structure of Siemens says a lot about the company itself. I was reading your last letter to shareholders. You were talking about how you‚Äôve divested portfolio companies where you weren‚Äôt the best owner, you‚Äôre exiting some businesses, and you‚Äôre obviously investing in others. How is Siemens organized today? How is the company structured? We run according to businesses. One is digital industries, which is all about the software, the automation piece. One is smart infrastructure. Here you‚Äôll find our building technology, medium voltage, low voltage, but also the grid, grid automation, grid control, and grid soft control software. The third element is Siemens mobility, where we have our trains, high-speed locomotives, commuter, metro, light rail, but also rail infrastructure, including turnkey projects, which is part of that. And the last one, since we are still consolidating , is Siemens Healthineers, where we still hold some 70 percent. It is its own listed company, a DAX-listed company. We are about to let go. We announced a spinoff of 30 percent from 65-ish, but it‚Äôs a separate company. So that‚Äôs how we‚Äôre organized. Of course, we have our corporate organizations, like strategy. IT, we run horizontally. We have our M&A department, and I talked about our portfolio. So that‚Äôs what a corporation normally has. And maybe one more special thing is that we still have research. We still invest 8 percent of our revenue, so $6.5 billion, a portion of which goes into research advancements. We work on a quantum computer. We don‚Äôt build them, but we run on the software, the middleware, how to use it, and the applications. And we have also machine learning and KEI experts who are doing research there, like AI experts. So that‚Äôs roughly how the company runs. And then talking about regions, we have in total, including Healthineers, 320,000 people. We have 45,000 people sitting in the United States, 30,000 in China, 35,000 in India, and roughly 85,000 in Germany. It‚Äôs still a German company. There‚Äôs a lot of manufacturing here. That‚Äôs a lot of people. Let me ask you about that split between regions. I think a theme on Decoder recently, and you are a part of this trend, is that a lot of these companies are a lot bigger than people think. You described divisions, you described regions. Those are both potentially first-order organizations for companies, right? I talk to lots of CEOs, and regions are just the first-order organization. Other companies are divisions. You have both. How do those interact? Yeah, I can tell you, this is a constant discussion because we have very strong regional leads. We have strong businesses. So this is a matrix, and every company has this matrix, and the first question is, which one is the predominant line? Is it the business or the regions? In our case, it‚Äôs a clear answer; it‚Äôs the businesses. So the businesses have the full P&L. Regions are, let‚Äôs say, the second derivative behind it. Still very strong. And we have, in some businesses, let‚Äôs take, for example, our low voltage business, switching technology, this business is fully run by regions. You have China, you have the United States, you have Europe, and this is their P&L. So roll it up by regions. If you talk about automation, the next level is still ... It‚Äôs motion control for machine builders, it‚Äôs factory automation, it‚Äôs process automation, and then come the regions. Therefore, you still have a different kind of setup depending on the business on how we serve technologies. And then the third dimension, just to make it a little bit more complicated for you, is the verticals, because factory automation‚Ä¶ Take factory automation, which is maybe the strongest automation business we have; they run into any kind of factory automation you can imagine. The discreet and hybrids, food and beverage, and automotive machines. Machine builders are by machine, control is another one, but then you have a lot of battery manufacturing, and you have semiconductors. Therefore, this is the third dimension to serve verticals, because each of them has a different language and different applications. So we are having a very, let‚Äôs say, three-dimensional matrix, but there‚Äôs a clear lead, and this is driven by the business lines. Yeah. I ask everybody on Decoder how the businesses are structured. And the joke I always make is, if you tell me how the company is structured, I can tell you 80 percent of your problems. But in the case of Siemens, it seems like I‚Äôm still trying to figure it all out to even get to where the problems are. When you think about that organization, and you describe things like a common platform or shared innovation across these zones or the investments you need to make in AI, a lot of your competitors are new. They‚Äôre essentially functionally organized. There‚Äôs one person driving the business in the case of some of these startups. Siemens is very old. It‚Äôs organized divisionally, and then obviously, there are layers of organization between it. How do you think about investing in the core technologies, the core platforms in that structure? Because it seems like all of your divisions should be doing it, perhaps in redundant or repetitive ways. Yeah, and you‚Äôre right. When I explain my organization, you can identify the problems or the opportunities, put it that way. And here comes the point. I talked about how we are investing $6.5 billion into R&D, and obviously, this goes into different businesses. And some of them have a higher share. This is 8 percent on average. Some of them are sitting on definitely more than 10 percent, 13 percent, 15 percent, some others are at 3 percent and 4 percent. So, capital allocation, is it R&D? Is it in CapEx, or also spending? That‚Äôs done business by business. Each of them has a business case, and we allocate capital. In some cases, we obviously want to allocate more capital in higher growth areas. And I talk about organic capital allocation if it comes to M&A. This is something that happens on the board. We come up with proposals, and we see where we want to spend more money and where we focus our M&A, and where we do not. But then here comes the point, and this is the part of our ONE Tech company program. Actually, I started last year, together with my fellow board members, maybe one of the most fundamental transformations of our organizations, because you‚Äôre completely right, we are very much boxed. Below these businesses I talked about, like digital industries, we have software, and then we have automation. Automation is three boxes: factory automation, process automation, and motion control. Below that, we have even segments, so I just didn‚Äôt give you that complexity as well. We are very much boxed. And what we want to do is take layers out, so we bring that into bigger boxes. Actually, we are targeting six units. But then we also say we want to create fabrics, which is a kind of operating system where we have horizontal ones. So we have a data fabric, a technology fab",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/DCD-Roland-Busch.png?quality=90&strip=all&crop=0%2C10.711631919237%2C100%2C78.576736161526&w=1200"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "OpenAI will reportedly start testing ads in ChatGPT today",
      "url": "https://www.theverge.com/news/875724/openai-chatgpt-ads-test-launch",
      "published": "2026-02-09T14:45:41+00:00",
      "summary": "OpenAI plans to start testing ads in ChatGPT today, according to a report from CNBC. The \"clearly labeled\" ads will appear in a separate area beneath your chat, OpenAI announced last month. A source close to the situation tells CNBC that OpenAI \"expects ads to make up less than half of its revenue long term.\" [&#8230;]",
      "content_text": "OpenAI plans to start testing ads in ChatGPT today, according to a report from CNBC . The ‚Äúclearly labeled‚Äù ads will appear in a separate area beneath your chat, OpenAI announced last month . A source close to the situation tells CNBC that OpenAI ‚Äúexpects ads to make up less than half of its revenue long term.‚Äù Last week, Anthropic showed off a Super Bowl commercial poking fun at OpenAI, saying ‚Äúads are coming to AI,‚Äù but not to its AI chatbot Claude. The version of the ad that aired during the game was a little less direct after OpenAI CEO Sam Altman called the campaign ‚Äúclearly dishonest.‚Äù OpenAI will show ads to logged-in users who use the app for free or subscribe to its cheaper Go subscription. The company says it will ‚Äúkeep your conversations with ChatGPT private from advertisers,‚Äù but notes that the ads will still be ‚Äúoptimized based on what‚Äôs most helpful to you.‚Äù Advertisers won‚Äôt have an impact on ChatGPT‚Äôs answers, according to OpenAI. In an internal memo seen by CNBC, Altman tells employees that OpenAI plans to launch an updated chat model this week, coming just days after the company released a more advanced version of its AI coding agent , Codex. Altman also reportedly said that ChatGPT is ‚Äúback to exceeding 10% monthly growth.‚Äù OpenAI last reported having 800 million weekly users last October.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/STK155_OPEN_AI_2025_CVirgiia_C.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "AI Doesn’t Reduce Work-It Intensifies It",
      "url": "https://hbr.org/2026/02/ai-doesnt-reduce-work-it-intensifies-it",
      "published": "2026-02-09T14:44:30+00:00",
      "summary": "<p>Article URL: <a href=\"https://hbr.org/2026/02/ai-doesnt-reduce-work-it-intensifies-it\">https://hbr.org/2026/02/ai-doesnt-reduce-work-it-intensifies-it</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46945755\">https://news.ycombinator.com/item?id=46945755</a></p> <p>Points: 132</p> <p># Comments: 83</p>",
      "content_text": "AI Doesn’t Reduce Work—It Intensifies It February 9, 2026 Right now, many companies are worried about how to get more employees to use AI. After all, the promise of AI reducing the burden of some work—drafting routine documents, summarizing information, and debugging code—and allowing workers more time for high-value tasks is tantalizing.",
      "cover_image_url": "/resources/images/article_assets/2026/02/Feb26_07_EynonJones.jpg"
    },
    {
      "industry": "technology",
      "source": "Ars Technica",
      "title": "Why would Elon Musk pivot from Mars to the Moon all of a sudden?",
      "url": "https://arstechnica.com/space/2026/02/has-elon-musk-given-up-on-mars/",
      "published": "2026-02-09T14:38:39+00:00",
      "summary": "\"SpaceX has already shifted focus to building a self-growing city on the Moon.\"",
      "content_text": "As more than 120 million people tuned in to the Super Bowl for kickoff on Sunday evening, SpaceX founder Elon Musk turned instead to his social network. There, he tapped out an extended message in which he revealed that SpaceX is pivoting from the settlement of Mars to building a “self-growing” city on the Moon. “For those unaware, SpaceX has already shifted focus to building a self-growing city on the Moon, as we can potentially achieve that in less than 10 years, whereas Mars would take 20+ years,” Musk wrote, in part. Elon Musk tweet at 6:24 pm ET on Sunday. Credit: X/Elon Musk Elon Musk tweet at 6:24 pm ET on Sunday. Credit: X/Elon Musk This is simultaneously a jolting and practical decision coming from Musk. Why it’s a jolting decision A quarter of a century ago, Musk founded SpaceX with a single-minded goal: settling Mars. One of his longest-tenured employees, SpaceX President and Chief Operating Officer Gwynne Shotwell, described her very first interview with Musk in 2002 to me as borderline messianic. “He was talking about Mars, his Mars Oasis project,” Shotwell said. “He wanted to do Mars Oasis, because he wanted people to see that life on Mars was doable, and we needed to go there.” She was not alone in this description of her first interaction with Musk. The vision for SpaceX has not wavered. Even in the company’s newest, massive Starship rocket factory at the Starbase facility in South Texas—also known as the Gateway to Mars—there are reminders of the red planet everywhere. For example, the carpet inside Musk’s executive conference room is rust red, the same color as the surface of Mars. In the last 25 years Musk has gone from an obscure, modestly wealthy person to the richest human being ever, from a political moderate to chief supporter of Donald Trump; from a respected entrepreneur to, well, to a lot of things to a lot of people: world’s greatest industrialist/super villain/savant/grifter-fraudster. But one thing that has remained constant across the Muskiverse has been his commitment to “extending the light of human consciousness” and to the belief that the best place to begin humanity’s journey toward becoming a multi-planetary species was Mars.",
      "cover_image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2214317436-1024x648.jpg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Long-Sought Proof Tames Some of Math’s Unruliest Equations",
      "url": "https://www.quantamagazine.org/long-sought-proof-tames-some-of-maths-unruliest-equations-20260206/",
      "published": "2026-02-09T14:36:14+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.quantamagazine.org/long-sought-proof-tames-some-of-maths-unruliest-equations-20260206/\">https://www.quantamagazine.org/long-sought-proof-tames-some-of-maths-unruliest-equations-20260206/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46945641\">https://news.ycombinator.com/item?id=46945641</a></p> <p>Points: 29</p> <p># Comments: 2</p>",
      "content_text": "The trajectory of a storm, the evolution of stock prices, the spread of disease — mathematicians can describe any phenomenon that changes in time or space using what are known as partial differential equations. But there’s a problem: These “PDEs” are often so complicated that it’s impossible to solve them directly. Mathematicians instead rely on a clever workaround. They might not know how to compute the exact solution to a given equation, but they can try to show that this solution must be “regular,” or well-behaved in a certain sense — that its values won’t suddenly jump in a physically impossible way, for instance. If a solution is regular, mathematicians can use a variety of tools to approximate it, gaining a better understanding of the phenomenon they want to study. But many of the PDEs that describe realistic situations have remained out of reach. Mathematicians haven’t been able to show that their solutions are regular. In particular, some of these out-of-reach equations belong to a special class of PDEs that researchers spent a century developing a theory of — a theory that no one could get to work for this one subclass. They’d hit a wall. Now, two Italian mathematicians have finally broken through, extending the theory to cover those messier PDEs. Their paper, published last summer, marks the culmination of an ambitious project that, for the first time, will allow scientists to describe real-life phenomena that have long defied mathematical analysis. Naughty or Nice During a volcanic eruption, a scorching, chaotic river of lava flows over the ground. But after hours or days (or perhaps even longer), it cools enough to enter a state of equilibrium. Its temperature is no longer changing from moment to moment, although it still varies from place to place across the vast expanse of space the lava covers. Mathematicians model systems that change in space but not in time — the temperature of a lava flow at equilibrium, the distribution of nutrients in tissues, the shape of a soap film — using elliptic partial differential equations. From top: Giles Laurent/Creative Commons; Mikael Häggström/Creative Commons; Ted Kinsman/Science Source Mathematicians describe situations like this using what are called elliptic PDEs. These equations represent phenomena that vary across space but not time, such as the pressure of water flowing through rock, the distribution of stress on a bridge, or the diffusion of nutrients in a tumor. But solutions to elliptic PDEs are complicated. The solution to the lava PDE, for instance, describes its temperature at every point, given some initial conditions. It depends on a lot of interacting variables. Researchers want to approximate such a solution even when it’s impossible to write it down. But the methods they use only work well if the solution is regular — meaning that it doesn’t have any sudden jumps or kinks. (There won’t be sharp spikes in the lava’s temperature from place to place.) “If something goes wrong, it’s probably because of the [lack of] regularity,” said Makson Santos of the University of Lisbon. In the 1930s, the Polish mathematician Juliusz Schauder sought to establish the minimal conditions an elliptic PDE must satisfy to guarantee that its solutions will be regular. He showed that in many cases, all you have to prove is that the rules baked into the equation — such as the rule for how quickly heat will spread in lava — do not change too abruptly from point to point. In the decades since Schauder’s proof, mathematicians have shown that this condition is enough to ensure that any PDE that describes a nice, “uniform” material has regular solutions. In such a material, there’s a limit on how extreme the underlying rules can get. For example, if you assume your lava is uniform, heat will always flow within certain speed limits, never too quickly or slowly. But lava is actually a diverse mix of molten rock, dissolved gases, and crystals. In such a nonuniform material, you can’t control the extremes, and you might get more drastic differences in how quickly heat can spread, depending on your location: Some regions in the lava might conduct heat extremely well, and others extremely poorly. In this case, you’ll use a “nonuniformly elliptic” PDE to describe the situation. For decades, no one could prove that Schauder’s theory held for this kind of PDE. Unfortunately, “the real world is nonuniformly elliptic,” said Giuseppe Mingione , a mathematician at the University of Parma in Italy. That meant mathematicians were stuck. Mingione wanted to understand why. Time Machine In August 2000, Mingione — 28 years old and fresh off his Ph.D. — found himself in a dilapidated old resort in Russia, attending a conference on differential equations. One evening, with nothing better to do, he started reading papers by Vasiliĭ Vasil’evich Zhikov, a mathematician he’d met on the trip, and he realized that nonuniformly elliptic PDEs that seem well behaved can have irregular solutions even when they satisfy the condition Schauder had identified. Schauder’s theory wasn’t simply harder to prove in the nonuniform case. It needed an update.",
      "cover_image_url": "https://www.quantamagazine.org/wp-content/uploads/2026/02/BoundaryOfSmoothness-crKristinaArmitage_MichaelKanyongolo-Social.jpg"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "2026 Startup Battlefield 200 nominations are open",
      "url": "https://techcrunch.com/2026/02/09/the-battle-begins-startup-battlefield-200-nominations-are-open/",
      "published": "2026-02-09T14:30:00+00:00",
      "summary": "Calling Pre-Series A founders: nominations for TechCrunch Startup Battlefield 200 are open. Compete in the world’s most iconic pitch competition at Disrupt 2026 from October 13 - 15.",
      "content_text": "Early-stage founders, this is your moment! Are you ready to put your startup to the test on the ultimate global stage? The Startup Battlefield is calling. Nominations for TechCrunch Startup Battlefield 200 , the world’s most iconic startup pitch competition, are officially open. Step onto the main stage at TechCrunch Disrupt 2026 and go head-to-head in front of world-class VC judges and the entire TechCrunch audience. This is where breakout companies are forged. Compete for $100,000 in equity-free funding, earn global exposure, and get real, unfiltered feedback from the investors who shape the future of tech. Startup Battlefield alumni include Trello, Mint, Dropbox, Discord, and Fitbit — over 1,700 startups that once stood exactly where you are now. The next breakout doesn’t happen by accident. Nominate now . Competition is fierce — enter early Thousands of startups apply each year, and this year’s field will be even more competitive. TechCrunch reviews every nomination, but founders who enter early give themselves a strategic edge. If you’re serious about winning, don’t wait to join the fight. Image Credits: Kimberly White / Getty Images Startup Battlefield 200 perks Free exhibit table for all three days of Disrupt 4 complimentary Disrupt passes Startup branding and listing in the Disrupt event app Press list access and lead-generation opportunities Access to exclusive founder masterclasses The chance to pitch live on the Disrupt Stage Direct feedback from top-tier, world-famous VCs A shot at $100,000 equity-free prize money Explore the full list of perks. Techcrunch event Boston, MA | June 23, 2026 What it takes to enter the arena We’re looking for bold, early-stage founders with an MVP and a vision that challenges the status quo. If you’re bootstrapped, pre-seed, or seed-funded, this battlefield was made for you. Series A startups in capital-intensive industries may also qualify. Start the battle today Nominations close mid-June, but champions don’t wait for the last call. Prepare early. Nominate early. Enter Startup Battlefield 200 and fight for your place on tech’s biggest stage.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2025/11/54889167026_7a80a409c4_o.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "AT&T, Verizon blocking release of Salt Typhoon security assessment reports",
      "url": "https://www.reuters.com/business/media-telecom/senator-says-att-verizon-blocking-release-salt-typhoon-security-assessment-2026-02-03/",
      "published": "2026-02-09T14:22:12+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.reuters.com/business/media-telecom/senator-says-att-verizon-blocking-release-salt-typhoon-security-assessment-2026-02-03/\">https://www.reuters.com/business/media-telecom/senator-says-att-verizon-blocking-release-salt-typhoon-security-assessment-2026-02-03/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46945497\">https://news.ycombinator.com/item?id=46945497</a></p> <p>Points: 92</p> <p># Comments: 15</p>",
      "content_text": "<p>Article URL: <a href=\"https://www.reuters.com/business/media-telecom/senator-says-att-verizon-blocking-release-salt-typhoon-security-assessment-2026-02-03/\">https://www.reuters.com/business/media-telecom/senator-says-att-verizon-blocking-release-salt-typhoon-security-assessment-2026-02-03/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46945497\">https://news.ycombinator.com/item?id=46945497</a></p> <p>Points: 92</p> <p># Comments: 15</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Humans peak in midlife: A combined cognitive and personality trait perspective",
      "url": "https://www.sciencedirect.com/science/article/pii/S0160289625000649",
      "published": "2026-02-09T14:18:30+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.sciencedirect.com/science/article/pii/S0160289625000649\">https://www.sciencedirect.com/science/article/pii/S0160289625000649</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46945471\">https://news.ycombinator.com/item?id=46945471</a></p> <p>Points: 52</p> <p># Comments: 15</p>",
      "content_text": "<p>Article URL: <a href=\"https://www.sciencedirect.com/science/article/pii/S0160289625000649\">https://www.sciencedirect.com/science/article/pii/S0160289625000649</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46945471\">https://news.ycombinator.com/item?id=46945471</a></p> <p>Points: 52</p> <p># Comments: 15</p>",
      "cover_image_url": null
    }
  ]
}