{
  "industry": "healthcare",
  "collected_at": "2026-02-07T01:03:45.003424+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "California state court judges found to have gaps in their understanding of autism",
      "url": "https://medicalxpress.com/news/2026-02-california-state-court-gaps-autism.html",
      "published": "2026-02-07T00:30:01+00:00",
      "summary": "A new study identifies significant gaps in judges' knowledge about autism spectrum disorder (ASD), which can lead to inequities in how people with this disorder are treated in legal settings. The study recommends remedies to address these shortcomings.",
      "content_text": "Judges' Perceptions of Legal vs. Moral Responsibility. Note. The horizontal axis represents the percentage (%) of judges (N = 61). The vertical axis displays the judges' ratings of the defendant's legal and moral responsibility on a Likert scale ranging from 1 (not at all responsible) to 5 (completely responsible). \"No Answer\" indicates judges who did not provide a response. Credit: Research in Autism (2026). DOI: 10.1016/j.reia.2026.202803 A new study identifies significant gaps in judges' knowledge about autism spectrum disorder (ASD), which can lead to inequities in how people with this disorder are treated in legal settings. The study recommends remedies to address these shortcomings. Conducted by Carolina R. Caliman, a Ph.D. candidate at the Rutgers University School of Criminal Justice, and Colleen M. Berryessa, associate professor at the Rutgers University School of Criminal Justice, the study examined how California state court judges perceive and use types of evidence surrounding ASD and expert testimony, when they evaluate a criminal case involving a defendant with ASD. Sixty-one California Superior Court judges completed a survey based on a vignette about a 28-year-old male with ASD who was convicted of assaulting his roommate with a deadly weapon. Published in the Research in Autism , the study found that most judges believe that an ASD diagnosis, as well as its known genetic etiology, would influence their sentencing decisions. Almost all judges considered it a mitigating factor in sentencing, but said that it did not substantially affect the defendant's legal responsibility. \"Addressing the educational gaps we discovered can help the criminal justice system better accommodate the complex issues associated with ASD, which may help promote more equitable treatment for defendants with the disorder,\" said Berryessa. Caliman added, \"Such training could take the form of improved access to education and resources that describe ASD.\" More information Carolina R. Caliman et al, Brief report: A survey of California state court judges on a case vignette involving a defendant with Autism Spectrum Disorder (ASD), Research in Autism (2026). DOI: 10.1016/j.reia.2026.202803 Citation : California state court judges found to have gaps in their understanding of autism (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-california-state-court-gaps-autism.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/california-state-court.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Is Charlotte at risk for bigger measles outbreak as cases climb in the Carolinas?",
      "url": "https://medicalxpress.com/news/2026-02-charlotte-bigger-measles-outbreak-cases.html",
      "published": "2026-02-06T23:40:01+00:00",
      "summary": "The spread of a highly contagious disease is creeping into the Charlotte region. But experts say there are steps the community can take to prevent the kind of widespread outbreaks springing up in other parts of the country.",
      "content_text": "Credit: Kampus Production from Pexels The spread of a highly contagious disease is creeping into the Charlotte region. But experts say there are steps the community can take to prevent the kind of widespread outbreaks springing up in other parts of the country. Mecklenburg County in recent weeks reported three cases of measles. Nearby Union County sent out more than 170 quarantine orders in late January after an infected child went to school. Those local instances come as cases surge nationally, including hundreds of infections just across the state line in South Carolina. Medical experts and public health leaders say overcoming rising vaccine hesitancy is key to preventing further spread of measles in and around Charlotte, and the rise of other infectious diseases. That can be an increasingly difficult task as the anti-vaccination movement grows in the U.S. and schools struggle to reach vaccination rates that provide widespread protection. \"If people continue to follow guidance regarding vaccinations, we can continue to mitigate the spread of measles,\" Mecklenburg Public Health interim director Dr. Kimberly Scott said. Worsening measles situation in the Carolinas Scott told The Charlotte Observer there remain three confirmed measles cases in Mecklenburg so far in 2026: two linked to the outbreak in Spartanburg, South Carolina, and one linked to other travel. The county also recently issued an exposure notice for measles for people who attended events at Sardis Presbyterian School on Jan. 17. \"Our team is actively working on contact tracing and follow up in regards to those three incidents,\" Scott said. \"The overall risk to the public right now is still minimal for those folks who are fully vaccinated. Where the risk gets higher is for individuals who are currently unvaccinated.\" Union County Public Health Director Traci Colley said her county doesn't have any confirmed cases of measles yet, but many of those potentially exposed to measles last month at a Monroe private school are still in quarantine. Measles symptoms typically appear 7 to 14 days after exposure. \"It is concerning because measles can cause serious health complications, especially in children younger than 5 years of age,\" Colley said of the current situation in the Carolinas. Statewide, North Carolina's Department of Health and Human Services reports 15 measles cases since December, including one hospitalization. Things are more severe in neighboring South Carolina , where almost 900 measles cases have been reported since an outbreak began in the Upstate region in October. That largest-in-the-nation outbreak is fueling a national rise in cases, with the Centers for Disease Control and Prevention reporting 588 measles cases in the U.S. so far in 2026. There were 2,267 cases nationwide in all of 2025, and three people died of measles last year. The U.S is now in danger of losing its official status as a country that has eliminated measles pending a review by the Pan American Health Organization, NPR reports. How vulnerable is Charlotte, NC to measles outbreak? Dr. David Weber, an adult and pediatric infectious disease expert at UNC Health, told the Observer what makes measles risky is that it's \"highly infectious.\" Whereas someone with the flu or COVID-19 might infect two to four people if they go into a room while contagious, he explained, someone with measles \"would give it to something like 14 to 18 people.\" Measles also lingers in rooms longer than many other diseases, Weber added. While the measles, mumps and rubella vaccine is \"excellent\"—93% effective after one dose and 97% effective with two doses—falling vaccination rates mean more people are vulnerable to getting sick and spreading measles, Weber said. Experts look to vaccination rates , particularly among elementary school-aged children, to measure a community's ability to protect itself against measles, with a goal of 95% to provide widespread protection. An Observer investigation found about 106,000 North Carolina children in elementary school—or one in six—attend schools where fewer than 90% of kids are vaccinated. Those kinds of numbers can lead to localized outbreaks, Weber said. Scott told the Observer Mecklenburg's MMR vaccination rate for kindergartners is about 92%. In comparison, Spartanburg County has a school-age vaccination rate of 90%, South Carolina health officials told the Greenville News. \"92% is strong protection, but 95% is that ideal space for herd immunity,\" Scott said. \"So that creates potential gaps where, if people are exposed to measles, there are spaces where measles can spread.\" What's driving vaccine hesitancy? Dr. Michael Smith, division chief of Pediatric Infectious Diseases at Duke, said given measles is \"very much a vaccine-preventable disease ... almost all of the cases are in people who've been unvaccinated.\" Smith noted vaccine hesitancy started to rise in the U.S. \"about 20 years ago\" when a since-debunked study claimed there was a connection between vaccinations and autism. That trend got a boost when President Donald Trump named longtime vaccine skeptic Robert Kennedy, Jr. to lead the federal Department of Health last year. Kennedy's department has since dropped the number of vaccines it recommends for every child, and Trump said late last year combination childhood vaccines like the MMR shot should be separated in a break with decades of medical practice. \"That bleeds over into the general public having more vaccine hesitancy, over emphasizing the rare and uncommon side effects of a vaccine compared to the benefits of vaccines,\" Weber said of the shift in federal messaging. How to prevent spread of measles Weber said it's important for people to understand the serious nature of measles, particularly in young children. Historically, about 10 to 20% of measles patients get hospitalized, and one in 3,000 die, he said. Some also develop an \"almost uniformly fatal\" brain condition, subacute sclerosing panencephalitis , with no warning years after measles infection. Scott said it's \"extremely important that people make sure that their children are vaccinated\" to prevent a worsening situation in Mecklenburg County. The American Academy of Pediatrics recommends babies get their first dose of the MMR vaccine between 12 and 15 months old and the second dose between 4 and 6 years old. Most adults who were vaccinated as children don't need a booster, experts say, but adults who didn't get the shots as kids can still get vaccinated. The MMR vaccine is available through many health care providers, pharmacies and local health departments. Scott encourages adults to use the state health department's immunization record finder to verify their vaccination status. Both Weber and Smith said if vaccine rates don't pick up, rising measles cases could also be a \"canary in the coal mine\" for an uptick in other vaccine-preventable diseases that are just taking more time to spread again. \"I don't really think we want to go back to those days of widespread disabilities and deaths from vaccine-preventable illnesses,\" Weber said. 2026 The Charlotte Observer. Distributed by Tribune Content Agency, LLC. Citation : Is Charlotte at risk for bigger measles outbreak as cases climb in the Carolinas? (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-charlotte-bigger-measles-outbreak-cases.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2023/child-vaccine-1.jpg"
    },
    {
      "industry": "healthcare",
      "source": "STAT News",
      "title": "TrumpRx promises cheapest drugs. Many cost less already",
      "url": "https://www.statnews.com/2026/02/06/trumprx-discount-drug-website-undercut-by-cheaper-generics/?utm_campaign=rss",
      "published": "2026-02-06T22:59:52+00:00",
      "summary": "STAT analysis: Many of the prescription drugs on TrumpRx are available elsewhere as cheaper generics.",
      "content_text": "WASHINGTON — President Trump said his administration’s new TrumpRx website will offer the cheapest prices in the world for 43 brand-name drugs, and counting. But about half of them are already available as generics, usually for much less. The website is part of the president’s plan to lower drug prices in the U.S. and to counter political attacks by Democrats who have increasingly focused on rising health care costs. Trump unveiled the site on Thursday evening, saying “this launch represents the largest reduction in prescription drug prices in history by many many times, and it’s not even close.” TrumpRx does not sell medicines directly. Instead, it displays prices available to consumers who pay cash without using insurance, and in some cases directs patients to other sites where they can buy the therapies. The website touts steep discounts for many drugs, compared to their list prices. But an analysis by STAT reveals that’s far from the whole story. At least 18 brand-name drugs on TrumpRx have cheaper generics available via GoodRx or Mark Cuban’s Cost Plus Drugs. In some cases, consumers could save hundreds of dollars by going with the exact same generic medicine, instead of TrumpRx’s price. STAT’s analysis is similar to a finding from Sarah Karlin-Smith, a research director at the advocacy group Public Citizen, and from Brian Reid, founder of Reid Strategic and a senior fellow at Tufts’ Center for the Evaluation of Value and Risk in Health. STAT+ Exclusive Story Already have an account? Log in This article is exclusive to STAT+ subscribers Unlock this article — plus in-depth analysis, newsletters, premium events, and news alerts. Already have an account? Log in Individual plans Group plans View All Plans To read the rest of this story subscribe to STAT+. Subscribe",
      "cover_image_url": "https://www.statnews.com/wp-content/uploads/2026/02/GettyImages-2259517267-1024x576.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Study finds daily opioid use fell 9 to 11 points after recreational cannabis legalization",
      "url": "https://medicalxpress.com/news/2026-02-daily-opioid-fell-recreational-cannabis.html",
      "published": "2026-02-06T22:50:01+00:00",
      "summary": "Legalizing cannabis for both medical and recreational use may lead to a decline in daily opioid use among people who inject drugs in the United States, according to a new study led by a Boston University School of Public Health researcher (BUSPH).",
      "content_text": "Credit: Unsplash/CC0 Public Domain Legalizing cannabis for both medical and recreational use may lead to a decline in daily opioid use among people who inject drugs in the United States, according to a new study led by a Boston University School of Public Health researcher (BUSPH). Published in the journal Drug and Alcohol Dependence , the study found that US states that legalized marijuana for medical and adult recreational use saw a 9-to-11-percentage-point decline in daily opioid use among this population, compared to states that legalized marijuana for medical use only. While the harms and benefits of cannabis use and cannabis reform continue to be debated on the national stage, these findings highlight one major potential advantage of widespread access to marijuana: this increased access may enable people to substitute their use of the unstable and toxic opioid supply with comparatively safer cannabis and, thus, lower their chances of experiencing opioid-related harms or dying from an overdose. In the US, opioids contribute to more than 75% of fatal drug overdoses. The study was published on the heels of a significant shift in US drug policy that will indeed lower restrictions on cannabis. Last December, President Donald Trump signed an executive order to downgrade cannabis from a Schedule 1 classification (assigned to drugs such as heroin and ecstasy) to a Schedule 3 classification, which refers to drugs that pose minimal to moderate risk of physical or psychological dependence. Nearly all US states and Washington, DC have legalized cannabis for medical use, while 48% of states allow cannabis for adult recreational use. People who inject drugs are part of a population that is at the epicenter of the opioid crisis in America, and they stand to benefit the most from policies that increase access to cannabis. By focusing on this group, the study builds upon past research on cannabis use and opioid mortality that has primarily examined the general population—which has a lower risk of experiencing opioid-related harms—with mixed results . \"The magnitude of decrease in opioid use that we observed among a population that is experienced with opioid use and likely to experience unpleasant withdrawal symptoms after reducing this use is very profound and important,\" says study lead and corresponding author Dr. Danielle Haley, assistant professor of community health sciences at BUSPH. The takeaway, she says, is that creating a safe and regulated supply of a substance is a valuable overdose prevention tactic because it can reduce use of non-regulated and more dangerous substances. \"Legalized cannabis tends to be higher quality and more potent. As these products become more available and cheaper, people might be able to reduce their opioid use even without increasing how often they use cannabis.\" For the study, Dr. Haley and colleagues utilized data from the Centers for Disease Control and Prevention's National HIV Behavioral Surveillance, including self-reported use of cannabis and non-medical opioid use within the last 12 months among nearly 29,000 people who inject drugs, comparing data from states that did not legalize cannabis, legalized it for medical use only, or legalized it for both medical and adult recreational use. The data spanned 13 states in four waves: 2012, 2015, 2018, and 2022. The decline in opioid use was equivalent across all racial and ethnic groups, as well as among males and females. \"This study adds to a growing body of evidence that sensible changes to our outdated drug policies can have a positive health impact, especially among some of our most vulnerable neighbors,\" says study co-author Dr. Leo Beletsky, professor of law and health sciences at Northeastern University. The team did not observe overall links between cannabis legalization and daily cannabis use, but cannabis use did increase by five percentage points among white participants living in states that transitioned from no legalization to legalizing cannabis for medical use only. This increase among White participants could reflect long-standing racial inequities in health care that make it easier for White people to navigate health systems and services than people of other races, the researchers say. Understanding how policies related to substance use benefit the health of people who use drugs is essential for effective cannabis reform. \"What this study shows is the potential impact of decriminalization paired with access to a regulated supply,\" says Stephen Murray, adjunct clinical assistant professor of community health sciences at BUSPH, who is also an overdose survivor and former paramedic with expertise in overdose prevention. Murray was not involved in the study. \"When legal barriers are removed and people have safer alternatives available, we see meaningful reductions in daily opioid use—even among people with long histories of injection drug use. That's a powerful signal.\" But the findings also serve as a reminder that the design and implementation of these policies matter, he says. \"Commercialized access to cannabis does not benefit all communities equally, and without intentional equity-focused policy , longstanding racial disparities in health care access and criminalization can persist even under legalization.\" The researchers say future research should further investigate links between legal medical and recreational cannabis and reduced opioid use, as well consider benefits in other areas, such as a reduction in cases of blood-borne infections through injection. The study's senior author is Dr. Hannah Cooper, Rollins Chair of Substance Use Disorders Research and professor of behavioral, social, and health education sciences at Emory University's Rollins School of Public Health. Publication details Danielle F. Haley et al, Cannabis legalization and cannabis and opioid use in a large, multistate sample of people who inject drugs: A staggered adoption difference-in-differences analysis, Drug and Alcohol Dependence (2026). DOI: 10.1016/j.drugalcdep.2026.113040 Journal information: Drug and Alcohol Dependence Citation : Study finds daily opioid use fell 9 to 11 points after recreational cannabis legalization (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-daily-opioid-fell-recreational-cannabis.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2023/online-dispensaries.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Physical education can boost children's health and education-let's make it central to the curriculum",
      "url": "https://medicalxpress.com/news/2026-02-physical-boost-children-health-central.html",
      "published": "2026-02-06T21:50:01+00:00",
      "summary": "The benefits of physical activity for children are enormous. As researchers of physical education (PE)—and ex-PE teachers—we know evidence shows it can have a positive impact on mental and physical health, social relationships, emotional control and confidence, as well as on academic performance. Why not make movement the framework that the rest of the school day is built upon?",
      "content_text": "Credit: Unsplash/CC0 Public Domain The benefits of physical activity for children are enormous. As researchers of physical education (PE)—and ex-PE teachers—we know evidence shows it can have a positive impact on mental and physical health, social relationships, emotional control and confidence, as well as on academic performance. Why not make movement the framework that the rest of the school day is built upon? But funding PE in England's schools remains a low priority, it seems, after a report emerged that two government departments—the Department of Health and Social Care and the Department for Education—had both proposed cutting the money allocated to school physical education. The Department for Health and Social Care has now reportedly walked back on this plan. The Department of Education's cuts were intended to come in before a new system comes into force, which will establish links between schools and expert sports organizations, and introduce a national requirement for two hours of physical activity per week. For those familiar with the recent history of PE, though, this is hardly revolutionary. It very closely resembles the school sport partnerships of old . PE could be so much more than two hours wrenched from a curriculum focused on meeting academic milestones. Other countries, such as Canada, China, Germany, Denmark, Finland and Turkey, are placing much more importance upon PE's role under the United Nations' umbrella of Quality Physical Education . Their intention is to holistically develop physically literate children who have the competence, confidence, knowledge and motivation to take ownership over their lifelong physical activity and well-being. Despite the research evidence on the benefits PE can have —including setting children up for a lifetime of healthy physical activity—the subject, in its current format in England, is not having the impact on the lives of children that it could. So, what is needed? Firstly, we need a new visionary aspiration to change society for the better, one that places children's voices at the heart. Their experiences at school are critical. PE and physical movement at school should be something that brings children joy and helps them learn. This means it's important to hear what they like and don't like about school PE, and what they would want it to be in the future. Changing the game Physical activity could be placed at the center of the timetable, with all other subjects arranged around it. Children would take part in physical education every day, with additional optional opportunities before and after school and at break times. These activities would be delivered by qualified PE specialists at every education level who are respected and supported by pupils, parents and fellow teachers. PE should be meaningful to children, individual to their needs, and help them develop the skills and motivation to be physically active for life—as well as bring them cognitive and social benefits. Children would be empowered to choose activities that enable them to learn the knowledge and skills to make healthy life choices. A multitude of activities would be available for every child in every school, and all would be valued equally and equally resourced. This vision, of course, would need to be appropriately funded at a level representative of importance placed upon it by the government. And the school day as a whole could value physical activity—with opportunities for movement during lessons, or in between, as students transfer from one subject to another. Some children may only get the opportunity to be active while at school due to demands beyond their control, such as poverty and caring duties. Many theories, concepts and frameworks are available for teachers to follow. PE as it is, though, is simply not working. The current sport-based curriculum offers a narrow vision for what PE could be. It reduces its appeal for the many children who are not interested in competitive sport. Issues such as limited resources, poor subject status, and a lack of respect for PE teachers also need to be addressed. The proposed funding, strategy and curriculum review do not go far enough. PE must permeate every day of a child's school life. As adults we may look back on our own experiences of PE, or listen to the stories our children bring back from school and form a very negative view of the subject. We need to stop thinking of PE as it was or is, but rather of what PE can be, and how it could empower future generations. This article is republished from The Conversation under a Creative Commons license. Read the original article . Citation : Physical education can boost children's health and education—let's make it central to the curriculum (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-physical-boost-children-health-central.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2023/school-gym-class.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Study finds 90 minutes weekly activity after ablation linked to fewer atrial fibrillation relapses",
      "url": "https://medicalxpress.com/news/2026-02-minutes-weekly-ablation-linked-atrial.html",
      "published": "2026-02-06T21:00:01+00:00",
      "summary": "New research from CU Anschutz scientists suggests that staying physically active after heart rhythm treatment may significantly reduce the risk of atrial fibrillation (AF) returning, offering patients a simple, low-cost way to support long-term heart health.",
      "content_text": "Credit: Unsplash/CC0 Public Domain New research from CU Anschutz scientists suggests that staying physically active after heart rhythm treatment may significantly reduce the risk of atrial fibrillation (AF) returning, offering patients a simple, low-cost way to support long-term heart health. The study, published this month in the Journal of Interventional Cardiac Electrophysiology , found that adults who engaged in regular, moderate physical activity after catheter ablation had markedly lower rates of AF recurrence compared with those who were less active. \"Atrial fibrillation often comes back even after a technically successful ablation, which can be frustrating for patients and clinicians alike,\" said Lohit Garg, MBBS, assistant professor of cardiology at the CU Anschutz School of Medicine and lead author of the study. \"Our findings suggest that moderate exercise for 30 minutes three times a week, something most people can realistically do, may help protect against recurrence after undergoing catheter ablation.\" Atrial fibrillation is the most common heart rhythm disorder worldwide and is linked to a higher risk of stroke, heart failure and repeated hospitalizations. Catheter ablation is a widely used treatment that restores normal rhythm, but recurrence remains a persistent challenge. The CU Anschutz study examined whether post-procedure lifestyle behaviors could influence outcomes. Researchers analyzed data from 163 adults who underwent catheter ablation and tracked both their physical activity levels using wearables and heart rhythm outcomes over time. Key findings: Patients who completed at least 90 minutes of moderate physical activity (as recommended by American Heart Association ) per week, including brisk walking, cycling, swimming or yard work, were significantly less likely to experience a return of AF. After adjusting for age, medications, heart structure and other clinical factors, moderate weekly exercise was associated with nearly a 50% lower risk of AF recurrence. Researchers noted that as little as 15 minutes of activity on most days of the week met the threshold linked to improved outcomes. \"For many patients, recovery after ablation raises questions about what they can do beyond medications or procedures to reduce the chances of recurrent AF,\" Garg said. \"This study suggests that physical activity may directly support the durability of AF treatment.\" The researchers also observed that regular physical activity is associated with better blood pressure control , improved sleep, mood and weight management, all of which are known contributors to heart rhythm stability. \"Exercise should be part of the post-ablation conversation,\" Garg said. \"It's one of the few interventions patients can control themselves that may meaningfully affect their long-term recovery.\" The study's authors emphasized that patients should always consult their health care provider before beginning or changing an exercise routine, particularly following a heart procedure. More information Radoslaw J. Nabrzyski et al, Impact of physical activity on atrial fibrillation recurrence following catheter ablation, Journal of Interventional Cardiac Electrophysiology (2026). DOI: 10.1007/s10840-025-02230-5 Citation : Study finds 90 minutes weekly activity after ablation linked to fewer atrial fibrillation relapses (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-minutes-weekly-ablation-linked-atrial.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2025/atrial-fibrillation.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "STS: Off-pump coronary artery bypass grafting shows lower perioperative morbidity, mortality than on-pump",
      "url": "https://medicalxpress.com/news/2026-02-sts-coronary-artery-bypass-grafting.html",
      "published": "2026-02-06T20:50:04+00:00",
      "summary": "Perioperative morbidity and mortality are slightly reduced with coronary artery bypass grafting (CABG) performed off-pump (OPCAB) by experienced surgeons, according to a study presented at the annual meeting of the Society of Thoracic Surgeons, held from Jan. 29 to Feb. 1 in New Orleans.",
      "content_text": "Perioperative morbidity and mortality are slightly reduced with coronary artery bypass grafting (CABG) performed off-pump (OPCAB) by experienced surgeons, according to a study presented at the annual meeting of the Society of Thoracic Surgeons, held from Jan. 29 to Feb. 1 in New Orleans. John Puskas, M.D., from Emory University Hospital Midtown in Atlanta, and colleagues examined the short-, intermediate-, and long-term outcomes after isolated OPCAB versus on-pump CABG (ONCAB), both performed by experienced high-volume surgeons. The primary end point was 0- to 15-year all-cause mortality. The study included 184,655 OPCAB cases performed by 205 experienced OPCAB surgeons and 1,340,404 ONCAB cases performed by 1,566 experienced ONCAB surgeons. A total of 184,550 very closely matched pairs were included in a greedy propensity score-matching analysis. The researchers found that incomplete revascularization occurred more often with OPCAB (14.4% versus 8.1%); an average of 0.20 fewer grafts were received by OPCAB patients. In OPCAB, multiarterial grafting was more frequent (14.5% versus 9.6%); an average of 0.10 more arterial grafts were received by OPCAB patients. Significantly better perioperative/30-day outcomes were experienced by OPCAB versus ONCAB patients, including operative mortality, stroke, new atrial fibrillation, renal failure, return to the operating room, prolonged ventilation, and any transfusion. A gradual diminishing return of the early OPCAB survival advantage was seen with follow-up through five years. For patients with one-vessel disease, but not for those with multivessel disease, a small OPCAB survival advantage reappeared through 15-year follow-up. \"Our results emphasize the importance of surgeon experience, complete revascularization, and use of multiple arterial grafts—regardless of surgical technique,\" Puskas said in a statement. Key medical concepts All-Cause Mortality © 2026 HealthDay . All rights reserved. Citation : STS: Off-pump coronary artery bypass grafting shows lower perioperative morbidity, mortality than on-pump (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-sts-coronary-artery-bypass-grafting.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/2026/sts-off-pump-cabg-show.jpg"
    },
    {
      "industry": "healthcare",
      "source": "STAT News",
      "title": "NIH grant reviewers fear Schedule F status will politicize their jobs",
      "url": "https://www.statnews.com/2026/02/06/nih-grant-reviewers-schedule-f-designation-politicizes-science/?utm_campaign=rss",
      "published": "2026-02-06T20:27:50+00:00",
      "summary": "The Trump administration is moving forward with a personnel rule that critics say will subject a broader swath of the federal workforce to political pressure",
      "content_text": "The Trump administration is moving forward with a personnel rule that critics say will subject a broader swath of the federal workforce to political pressure, raising concerns that the change could deter accomplished scientists from joining the federal workforce and give political appointees greater influence over grant decisions. The scientific community is especially worried about language in the rule stating that staff involved with grantmaking can be classified as “Schedule F” workers, which could remove certain civil service protections for many National Institutes of Health program officers and grantmaking officials and make it easier for the administration to dismiss them. If such officials could be fired for “subverting Presidential directives,” as the rule states, it could fundamentally change the way that scientists think about their work. Research that could be seen as disfavored by one political party may not get done because of the fear it could be terminated with a change in administration. Thousands of people and organizations voiced opposition to the Schedule F proposal when the rule was open for public comment — 94% of the comments opposed the rule, the Office of Personnel Management said. But the final language posted to the Federal Register Thursday appears to be largely unchanged. The OPM addressed concerns about politicizing the NIH and other science agencies in the text of the final rule, stating that Schedule F employees will still undergo rigorous vetting. Responding to one comment that read “it makes no sense to reclassify all the reviewers, program officers, advisory councils, and leadership at science funding agencies (such as NIH or DARPA) to be political in nature,” OPM wrote that such positions should be eligible for Schedule F — but just because positions are eligible does not mean they will be changed. Nicholas Bednar, an administrative law expert at the University of Minnesota Law School, disputed OPM’s contention that “removing due process protections for individuals in scientific positions will ensure that the best candidates fill these positions,” noting that research has shown that tenure protections are necessary to entice the best candidates to apply for positions in government. “Without tenure protections, the federal government has weakened its ability to compete with private sector employers for scientists who work in agencies like the National Institutes of Health,” he said. “OPM’s reasoning for this rule discounts everything we know about the labor market for public sector employees.” OPM wrote that the proposal is intended to increase accountability from career staff but that it “prohibited hiring or firing Schedule F employees based on their political affiliation or for other discriminatory reasons.” “But that is obvious nonsense,” said Donald Moynihan, a professor at the Gerard R. Ford School of Public Policy at the University of Michigan who wrote about the proposed changes in Science . “We already have example after example of career civil servants being punished in a partisan pattern .” It is unclear how many staffers at specific agencies would be moved into Schedule F. OPM estimates that across the federal workforce, the new rule would affect 50,000 positions. Even with that uncertainty, “I think it’s something we should watch for,” said Jenna Norton, a program officer at the NIH who was speaking in her personal capacity. If program officers, who oversee a portfolio of grants, were moved under Schedule F, “it will become even harder for us to push back on, you know, concerns internally, it will be harder to blow the whistle on concerns externally, or to use our free speech rights to raise awareness around issues.” Even without being subject to Schedule F, Norton was placed on administrative leave in November after she spoke out against the Trump administration’s disruptions to the agency. This week, she filed a whistleblower report alleging the move was unlawful.",
      "cover_image_url": "https://www.statnews.com/wp-content/uploads/2024/03/GettyImages-815710-1024x576.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Americans optimistic about heart health prospects, but face an uphill battle, survey suggests",
      "url": "https://medicalxpress.com/news/2026-02-americans-optimistic-heart-health-prospects.html",
      "published": "2026-02-06T20:00:05+00:00",
      "summary": "Americans could be facing an uphill battle when it comes to protecting their heart health as they age, a new Cleveland Clinic poll reveals.",
      "content_text": "Americans could be facing an uphill battle when it comes to protecting their heart health as they age, a new Cleveland Clinic poll reveals. Nearly 3 of 4 Americans (72%) feel confident in their ability to maintain heart health as they age, the survey found. But nearly as many (69%) also report that they have at least one known risk factor for heart disease. Worse, nearly 1 in 4 (24%) aren't sure whether they are at increased risk for heart disease, according to the survey. \"Healthy aging is about prevention,\" said Dr. Samir Kapadia, chair of cardiovascular medicine at the Cleveland Clinic. \"Heart disease often develops silently over decades, which is why staying active, understanding your risk factors, and addressing them early can make a profound difference in both quality of life and longevity,\" Kapadia said in a news release. For the survey, researchers polled 1,273 U.S. adults Dec. 3 and 4, 2025. Results showed that many have at least one heart disease risk factor, including: High blood pressure (31%) High cholesterol (24%) Family history (23%) Obesity (20%) Poor diet (18%) Sedentary lifestyle (17%) Daily unmanaged stress (16%) Sleep apnea (15%) Smoking (14%) Diabetes (13%) On the plus side, most Americans see longevity as achievable through everyday lifestyle choices like eating healthy or exercising, the poll showed. When asked what longevity means to them, survey participants said, Staying physically active and mobile as they age (62%) Maintaining cognitive health and mental sharpness (56%) Preserving independence and quality of life (56%) Only 5% of respondents associated longevity with expensive or elite medical treatments, and 6% viewed it as something reserved for wealthy people or celebrities. On the other hand, 95% agreed there are steps people can take at any stage of life to prolong their life and reduce their heart risk. Exercise (41%) and eating a balanced diet (25%) were the top two measures cited by respondents, followed by maintaining a healthy weight (23%), getting regular checkups (20%) and managing stress (20%). Many respondents said it's been challenging to protect their heart health, reporting rising stress (33%), less sleep (29%) and weight gain (29%) over the past decade. At the same time, most (84%) said they've made at least one positive change, including: Eating healthier (40%) Being more conscious of health numbers (36%) Exercising more (27%) Improving sleep (25%) Unfortunately, many people aren't aware of common risk factors for heart disease. About half (49%) didn't know diabetes increases heart disease risk, and 44% didn't know that physical inactivity contributes to that risk. Many also were unaware of the heart disease risk posed by menopause (71%). More information The U.S. Centers for Disease Control and Prevention has more on preventing heart disease . © 2026 HealthDay . All rights reserved. Citation : Americans optimistic about heart health prospects, but face an uphill battle, survey suggests (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-americans-optimistic-heart-health-prospects.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/2026/americans-optimistic-a.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "A 3D-printed delivery system enhances vaccine delivery via microneedle array patch",
      "url": "https://medicalxpress.com/news/2026-02-3d-delivery-vaccine-microneedle-array.html",
      "published": "2026-02-06T20:00:04+00:00",
      "summary": "The COVID-19 pandemic highlighted an urgent need for efficient, durable, and widely accessible vaccines. This prompted several important innovations in vaccine technology, and researchers continue to explore new and creative ways to make effective vaccines rapidly available to the greatest number of people. Researchers from the Institute of Industrial Science, The University of Tokyo have used 3D-printing technology to improve the viral titer of microneedle array patches, resulting in effective immunogenicity and protection against infection in mice. Their study is published in Scientific Reports.",
      "content_text": "Schematic illustration showing the administration of MAP for r-DIs-S vaccination. Credit: Scientific Reports (2025). DOI: 10.1038/s41598-025-29183-z The COVID-19 pandemic highlighted an urgent need for efficient, durable, and widely accessible vaccines. This prompted several important innovations in vaccine technology, and researchers continue to explore new and creative ways to make effective vaccines rapidly available to the greatest number of people. Researchers from the Institute of Industrial Science, The University of Tokyo have used 3D-printing technology to improve the viral titer of microneedle array patches, resulting in effective immunogenicity and protection against infection in mice. Their study is published in Scientific Reports . Why microneedle patches matter Conventional vaccination methods require skilled medical personnel to administer them, which can delay mass immunization efforts. Microneedle array patches (MAPs) are a promising alternative to standard vaccines, as they are painless, more stable at room temperature, and can be self-administered. \"MAPs are made by pouring a viral solution into a mold that shapes it into an array of tiny needles as it dries,\" says lead author of the study Kotaro Shobayashi. \"When the patch is applied to the skin, these microneedles dissolve, delivering the vaccine to the patient.\" How pillar-guided MAPs are made Using MAPs to deliver live virus can be challenging, however, as the whole dose is not always delivered, and some of the virus dies during fabrication. To address this, the researchers created a 3D-printed backing layer for MAPs consisting of a series of tiny plastic pillars. This backing layer is inserted into the MAP mold, much like placing wooden sticks in a popsicle mold, so that the viral solution forms dissolvable needles at the tip of each pillar. Design and characteristic evaluation of backing. (a) Schematic design of the MAP and its 3D-printed backing layer. (b) Optical microscopic images of the fabricated backing pillars. Credit: Scientific Reports (2025). DOI: 10.1038/s41598-025-29183-z \"Once we had constructed the pillar-guided MAP , we tested how much live virus it retained compared with normal MAPs,\" explains Beomjoon Kim, senior author. \"Then, we tested the vaccine efficacy of the pillar-guided MAPs in mice.\" Incorporating the 3D-printed pillar backing layer decreased drying time, which resulted in more live virus being preserved in the MAP. Furthermore, the pillar-guided MAPs induced specific immune responses in mice that protected them against lethal SARS-CoV-2 infection. \"Our findings show that pillar-guided MAPs are a promising platform for delivering virus vaccines,\" says Shobayashi. Given that MAPs offer a painless and self-administrable option for vaccination, this approach could help promote COVID-19 immunization worldwide. It could be especially useful in areas where refrigeration is not available, as the live virus is stable at room temperature in this form. Publication details Kotaro Shobayashi et al, Precision dosing of recombinant vaccinia vaccine via pillar-guided microneedle patch confers SARS-CoV-2 immunity, Scientific Reports (2025). DOI: 10.1038/s41598-025-29183-z Journal information: Scientific Reports Citation : A 3D-printed delivery system enhances vaccine delivery via microneedle array patch (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-3d-delivery-vaccine-microneedle-array.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-3d-printed-delivery.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Americans prefer to screen for cervical cancer in-clinic vs. at home, finds study",
      "url": "https://medicalxpress.com/news/2026-02-americans-screen-cervical-cancer-clinic.html",
      "published": "2026-02-06T19:40:04+00:00",
      "summary": "American women now have the option of screening for cervical cancer at home, using newly approved self-collection tools. While experts hope this will increase uptake in the under-screened population, a first-of-its kind study by researchers from The University of Texas MD Anderson Cancer Center found the majority (60.8%) still prefer to see a medical professional in-clinic.",
      "content_text": "Credit: RDNE Stock project from Pexels American women now have the option of screening for cervical cancer at home, using newly approved self-collection tools. While experts hope this will increase uptake in the under-screened population, a first-of-its kind study by researchers from The University of Texas MD Anderson Cancer Center found the majority (60.8%) still prefer to see a medical professional in-clinic. The study, published today in JAMA Network Open , also revealed that marginalized were more likely to prefer at-home self-sampling, and women with low income and those who do not trust the health care system were more likely to be uncertain about which option to choose. Of 2,300 screening-eligible women, just 20.4% prefer to screen for cervical cancer at home, and 18.8% were unsure about their choice. \" Home-based self-sampling has the potential to remove many of the barriers women face when it comes to cervical cancer screening,\" said lead author Sanjay Shete, Ph.D., deputy division head of Cancer Prevention and Population Sciences. \"By expanding screening options and pairing them with targeted education, we can empower more women to participate in screening in a way that fits their lives.\" Is there still value in offering home-based self-collection tools? While cervical cancer screening rates have increased over the last 25 years, there has been a shift since the COVID-19 pandemic toward decreased annual screening coverage. Experts say there is still a need to improve cervical cancer screening uptake among under-screened populations, and this study suggests that these groups would benefit from having options that best fit their preference. In the study, Black women were less likely to prefer at-home self-sampling versus clinic-based testing compared to white women. On the other hand, individuals who were overdue for screening were most likely to prefer at-home kits, as were those who had experienced prejudice or discrimination when getting medical care. The most reported reasons for preferring at-home self-sampling were privacy (54.9%), time constraints (35.1%), and avoiding embarrassment (33.4%). Both the Health Resources and Services Administration and the American Cancer Society have adopted home-based self-collection for cervical cancer screening. \"Major public health and medical organizations should consider updating their recommendations to include home-based self-sampling. This policy shift could play a critical role in reducing screening inequities and improving uptake among populations that have historically been underserved,\" said co-author Joël Fokom Domgue, M.D., senior researcher of Epidemiology. How the study was conducted This cross-sectional study was based on data from the 2024 Health Information National Trends Survey (HINTS) , a nationally representative survey of U.S. adults in the civilian population. This study included all women aged 21–65 who completed the survey and were eligible for cervical cancer screening as per U.S. Preventive Services Task Force guidelines. The individuals also had to have responded to the cervical cancer screening questions. Limitations of the study include the cross-sectional nature of HINTS, a lack of familiarity with the new at-home screening kits, the fact that the FDA has not approved the self-collection tool at the time of the HINTS survey, and that data and prior screening history was not collected as a part of HINTS . Publication details Women's Preferences for Home-Based Self-Sampling or Clinic-Based Testing for Cervical Cancer Screening, JAMA Network Open (2026). DOI: 10.1001/jamanetworkopen.2025.58841 Journal information: JAMA Network Open Citation : Americans prefer to screen for cervical cancer in-clinic vs. at home, finds study (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-americans-screen-cervical-cancer-clinic.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/woman-at-appointment.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Synergizing global clinical trials data: GLP-1 receptor agonist safety and novel clinical applications",
      "url": "https://medicalxpress.com/news/2026-02-synergizing-global-clinical-trials-glp.html",
      "published": "2026-02-06T19:40:01+00:00",
      "summary": "A research team led by the Department of Medicine, under the School of Clinical Medicine, LKS Faculty of Medicine of the University of Hong Kong (HKUMed), has synergized the impacts of worldwide clinical trial data through a series of meta-analyses on GLP‑1 receptor agonists, an emerging cardiometabolic drug, offering in-depth insights into its safety profile and novel therapeutic potential in treating cardiovascular diseases.",
      "content_text": "HKUMed study finds no clear link between GLP‑1 use and ischemic optic neuropathy, and shows that obese cardiac patients may improve long‑term atrial fibrillation ablation outcomes through weight control along with appropriate medication. Credit: The University of Hong Kong A research team led by the Department of Medicine, under the School of Clinical Medicine, LKS Faculty of Medicine of the University of Hong Kong (HKUMed), has synergized the impacts of worldwide clinical trial data through a series of meta-analyses on GLP‑1 receptor agonists, an emerging cardiometabolic drug, offering in-depth insights into its safety profile and novel therapeutic potential in treating cardiovascular diseases. The findings were published in Diabetes Care and were presented at the European Heart Rhythm Association Congress in Vienna in 2025. The study found that there was no definite risk of ischemic optic neuropathy associated with GLP‑1 agonist use in patients with diabetes or heart diseases. It also revealed that cardiac patients with obesity may improve the long-term success rate of curative catheter ablation for atrial fibrillation by adopting various weight-control measures, along with appropriate medication. These findings will help frontline clinicians perform more comprehensive risk‑benefit assessments before prescribing medications. Data from over 80,000 patients show no significant optic nerve risk from GLP‑1 therapy GLP-1 receptor agonists are an emerging class of therapeutics for treating obesity, diabetes and cardiometabolic diseases. As their clinical use continues to expand, concerns about their potential side effects have emerged. Previous research indicated a possible link between GLP-1 receptor agonists and ischemic optic neuropathy, a serious ocular complication that can cause sudden, painless vision loss and visual field defects, particularly among individuals with diabetes and hypertension. However, evidence regarding this risk has remained inconsistent and at times conflicting. In view of this, HKUMed conducted a meta-analysis to evaluate the safety profile and therapeutic potential of GLP-1 receptor agonists. The team analyzed global clinical trial data comprising more than 80,000 patients with diabetes and heart disease, representing the largest sample size examined in this field to date. The findings show no significant association between the use of GLP-1 receptor agonists and the risk of adverse vision-threatening complications, providing clearer evidence for formulating clinical treatment plans and enabling doctors to comprehensively assess the benefits and risks of these medications. HKUMed evaluates the safety profile and therapeutic potential of GLP-1 receptor agonists by analyzing global clinical trial data comprising more than 80,000 patients with diabetes and heart disease. Credit: The University of Hong Kong Integrated weight management and medication improve surgical success Obesity increases the risk of developing cardiovascular diseases, such as atrial fibrillation (AF), which is the most common cardiac arrhythmia encountered in clinical practice and can result in life-threatening complications, including stroke and heart failure. In another study, the team analyzed data from 5,415 patients with atrial fibrillation and found that for individuals with obesity, every 1% reduction in weight was associated with a 6.3% reduction in the relative risk of AF recurrence after catheter ablation. This highlights that sustained weight control is a critical factor in operative success. Cardiac patients with obesity may improve the long-term success rate of catheter ablation for atrial fibrillation though a holistic approach to weight control, including adopting a healthier lifestyle and incorporating other clinical interventions, together with GLP-1 receptor agonists. Optimal treatment outcomes require patients to adopt a comprehensive cardiovascular risk management strategy, rather than relying solely on medication. Data‑driven insights help doctors evaluate new drugs Lead investigator Dr. Will Chan Yap-hang, Clinical Assistant Professor, Department of Medicine, School of Clinical Medicine, HKUMed, said, \"Our meta‑analysis of clinical trial data provides important evidence regarding both the safety profile and novel use of GLP-1 receptor agonists in cardiovascular patients. \"This will help doctors more comprehensively evaluate the potential risks and benefits of prescribing these medications. However, this research does not completely rule out the possibility of rare adverse complications. \"Clinicians must exercise careful judgment based on each patient's condition. It is essential not to overemphasize the potential benefits while overlooking the associated risks, and to always assess the situation holistically.\" Publication details Hoi-Ying Li et al, GLP-1 Receptor Agonists and Risk of Optic Nerve or Vision-Threatening Events in Patients With Type 2 Diabetes or Cardiometabolic Diseases: A Meta-analysis of Randomized Controlled Trials, Diabetes Care (2026). DOI: 10.2337/dc25-1929 Journal information: Diabetes Care Citation : Synergizing global clinical trials data: GLP-1 receptor agonist safety and novel clinical applications (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-synergizing-global-clinical-trials-glp.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/hkumed-leads-in-synerg-1.jpg"
    },
    {
      "industry": "healthcare",
      "source": "STAT News",
      "title": "ARPA-H, federal agency focused on scientific advances, lays off staff",
      "url": "https://www.statnews.com/2026/02/06/arpa-h-layoffs-include-biomedical-commercialization-staff/?utm_campaign=rss",
      "published": "2026-02-06T19:27:48+00:00",
      "summary": "As the new director of ARPA-H, Alicia Jackson, takes over the DARPA-inspired agency, layoffs are made.",
      "content_text": "ARPA-H, the “moonshot” biomedical agency established under the Biden administration, laid off staff last week, according to two people familiar with the matter. The cuts largely hit staff responsible for operations and for commercializing the technologies the agency supports, the people said, leaving scientific staff and programs intact. The people said they believed 20 individuals were let go between employees and contractors. Health and Humans Services spokesperson Andrew Nixon confirmed that there were layoffs but did not provide details. STAT+ Exclusive Story Already have an account? Log in This article is exclusive to STAT+ subscribers Unlock this article — plus daily coverage and analysis of the biotech sector — by subscribing to STAT+. Already have an account? Log in Individual plans Group plans View All Plans To read the rest of this story subscribe to STAT+. Subscribe",
      "cover_image_url": "https://www.statnews.com/wp-content/uploads/2025/03/AdobeStock_617959135-1024x576.jpeg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Can chemo-resistant cancer cells be resensitized?",
      "url": "https://medicalxpress.com/news/2026-02-chemo-resistant-cancer-cells-resensitized.html",
      "published": "2026-02-06T19:20:08+00:00",
      "summary": "Overcoming tumor resistance to chemotherapy drugs has long been a challenge for oncology clinicians and researchers. Now, a new study suggests that blocking a key protein, p300, may force damaged cancer cells into a state of uncontrolled transcriptional activity, thereby creating a novel form of cellular stress that can make even chemo-resistant tumors sensitive again to treatment.",
      "content_text": "Credit: Ivan Samkov from Pexels Overcoming tumor resistance to chemotherapy drugs has long been a challenge for oncology clinicians and researchers. Now, a new study suggests that blocking a key protein, p300, may force damaged cancer cells into a state of uncontrolled transcriptional activity, thereby creating a novel form of cellular stress that can make even chemo-resistant tumors sensitive again to treatment. The study was led by researchers at Sylvester Comprehensive Cancer Center, part of the University of Miami Miller School of Medicine, and appears online in the journal Genes & Development . How healthy cells handle DNA damage When cells are struck by something damaging—ultraviolet light, environmental exposures, or chemotherapy—they're supposed to do something simple and wise: stop and assess the damage. It's a biological version of pulling over when your engine light flashes, giving your system a chance to cool down and repair. But cancer cells don't always follow the rules. Many learn to keep pushing forward by rapidly adapting—rerouting drugs, rewiring repair pathways, and clearing damage more efficiently—allowing tumors to become resistant to chemotherapy, the very drugs meant to stop them. \"It's a fresh angle on the long-standing problem of chemotherapy resistance, and an encouraging path toward restoring the power of widely used chemotherapy drugs,\" said Ramiro Verdun, Ph.D., Sylvester research professor in the Division of Hematology. The pivotal role of p300 in repair Cells are constantly reading DNA and making proteins, but when DNA is damaged, the cell performs an essential function: it pauses until repairs are made. The pause protects the cell from copying or translating damaged instructions, and several molecular players, including p300, orchestrate it. Think of p300 as a traffic officer at the site of an accident: when damage occurs, p300 steps in to clear stalled transcription machinery so traffic can be properly managed again. \"It's one of the most basic safety checks a cell has,\" said Dr. Verdun. \"When the DNA script is damaged, the cell is supposed to deal with the problem before pushing forward.\" But the Sylvester team discovered that when p300 is inhibited, the traffic officer fails to clear the accident. Stalled transcription machinery lingers, and cells keep forcing transcription through damaged DNA. Without p300, cells keep reading DNA and producing proteins even when the DNA is damaged. A flood of faulty proteins and stress Inside the cell, this creates a flood of newly made proteins, many of them misfolded or unstable, leading to a buildup of toxic protein \"clutter\" and intense stress inside the endoplasmic reticulum—the cell's protein-folding workshop. The cell's internal quality-control system—the unfolded protein response—lights up like an alarm panel. The stress becomes overwhelming, like an engine overheating after being pushed too hard for too long. Here's the twist: This meltdown becomes a vulnerability. Tumors that resist platinum therapy often survive by tolerating DNA damage. But this study shows that when p300 is blocked, those same tumors become intensely sensitive again—not because their DNA is more damaged, but because they can't handle the stress of pushing through it. Combining p300 blockade with chemotherapy In lab models and patient-derived xenografts, platinum chemotherapy alone had limited effect, and blocking p300 alone had only a modest impact. However, when combined, they produced a strong synergistic effect that selectively eliminated tumor cells. \"It is the biological equivalent of overloading a faulty circuit—not by increasing DNA damage, but by bypassing the cancer's usual resistance response,\" said Verdun. \"These cells can cope with cisplatin-damaged DNA, but they can't cope with the sudden and intense protein stress that builds up when transcription keeps going.\" Platinum-based chemotherapies face two major limits in the clinic: tumors often become resistant, and even when they respond, toxicity to normal tissues—particularly the kidneys and nervous system—can force doctors to reduce doses or stop treatment altogether. This work opens the possibility of a new door: instead of increasing chemotherapy intensity, make the cancer more vulnerable to the dose patients can already tolerate. Implications for resistant cancers and patients By shifting how tumor cells respond to damage, blocking p300 turns that principle into a practical therapeutic approach. In two chemo-refractory patient-derived models—colorectal cancer and pediatric osteosarcoma—the combination shrank tumors and improved survival. \"What excites us most is the opportunity this creates to rethink treatment for patients who've run out of options,\" said Ramin Shiekhattar, Ph.D., co-leader of the Cancer Epigenetics Program at Sylvester, chief of the Division of Cancer Genomics and Epigenomics and the Eugenia J. Dodson Chair in Cancer Research. \"By uncovering this stress state, we can begin to design smarter combinations that anticipate resistance rather than simply react to it, with the long-term goal of making standard chemotherapies work longer and for more people.\" The team exposed a stress pathway that had not been tapped before. When cells keep working despite DNA damage , they enter a state of unresolved internal stress that can be therapeutically exploited. The research also identifies p300 as a new target in drug-resistant cancers: blocking this protein prevents proper resolution of stalled transcription, pushing tumor cells into a stress state that chemotherapy can exploit. Crucially, the approach offers a way to re-sensitize tumors without adding toxicity. Instead of intensifying chemotherapy, it changes how tumor cells respond to damage. This creates new possibilities for combination therapy, where p300 inhibitors and platinum drugs can be paired in a rational, targeted way. \"For patients whose tumors have stopped responding to chemotherapy, this gives us a way to make those treatments meaningful again,\" said Lluis Morey, Ph.D., associate professor in the Dr. John T. Macdonald Foundation Department of Human Genetics. \"This study doesn't just add a chapter to the DNA repair story—it reframes it. It shows that the danger isn't only in the damage itself, but in what happens when cells refuse to hit pause.\" Publication details Carolina P. Bañuelos et al, Bypass of blocking lesions by RNAPII reveals a novel stress induced by DNA damage, Genes & Development (2026). DOI: 10.1101/gad.353164.125 Journal information: Genes & Development Clinical categories Oncology Citation : Can chemo-resistant cancer cells be resensitized? (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-chemo-resistant-cancer-cells-resensitized.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2024/cancer-patient.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Housing conditions and outdoor air pollution together affect children's asthma risk, study shows",
      "url": "https://medicalxpress.com/news/2026-02-housing-conditions-outdoor-air-pollution.html",
      "published": "2026-02-06T19:03:51+00:00",
      "summary": "Children growing up in homes with water damage or dampness and exposed to higher levels of outdoor air pollution during early childhood face a greater risk of developing asthma, according to new research supported by the NIH's Environmental Influences on Child Health Outcomes (ECHO) Program.",
      "content_text": "Credit: Unsplash/CC0 Public Domain Children growing up in homes with water damage or dampness and exposed to higher levels of outdoor air pollution during early childhood face a greater risk of developing asthma, according to new research supported by the NIH's Environmental Influences on Child Health Outcomes (ECHO) Program. The large multisite study, published in Environmental Epidemiology, found that early-life exposure to fine particulate matter (PM 2.5 ) and indoor housing problems each independently raised asthma risk , while having a dog during infancy was linked to reduced risk. Asthma affects millions of U.S. children, yet the environmental origins of the disease are complex. While previous research has tended to study exposures such as pollution or indoor allergens separately, this study shows that evaluating them together offers a more accurate picture of children's risk. The ECHO Program, which brings together data from diverse U.S. populations, made this integrated analysis possible. Drawing on data from 6,413 children across nine U.S. ECHO Study Sites, the research provides one of the clearest looks yet at how multiple early-life environmental factors interact to influence childhood asthma. The findings underscore the importance of assessing both indoor and outdoor environments together, rather than in isolation—an approach that prior studies often could not address due to limited sample sizes. \"Our research shows that to truly understand and prevent childhood asthma, we need to look at a child's full environment—both the air they breathe outside and the conditions inside their home,\" said Akihiro Shiroshita, a study author from Vanderbilt University School of Medicine. \"Considering these factors together gives us a much clearer picture of what puts children at risk and how we can better protect them.\" Key findings Outdoor air pollution matters: Higher early life exposure to PM 2.5 was associated with increased asthma risk. Indoor environments matter too: Home dampness or water damage independently raised asthma risk, even after accounting for pollution exposure. Pets may offer protection: Having a dog in the home during infancy was linked to a lower risk of developing asthma. Large, diverse dataset: The study combines data from multiple U.S. ECHO Study Sites, offering a comprehensive view of environmental impacts on children's respiratory health. Researchers evaluated children's exposure to PM 2.5 during the first three years of life and combined that information with detailed data on early life housing conditions—including water damage, dampness, pet exposure, and dust mites. Childhood asthma was identified based on caregiver reports or physician diagnosis between birth and age five. The analysis also controlled for family and neighborhood factors to isolate the effects of environmental exposures. The findings signal the need for additional research into how indoor and outdoor exposures interact and how early life interventions could help reduce asthma risk in children nationwide. More information Akihiro Shiroshita et al, Individual and combined effects of indoor home exposures and ambient PM2.5 during early life on childhood asthma in us birth cohort studies, Environmental Epidemiology (2026). DOI: 10.1097/ee9.0000000000000443 Key medical concepts Asthma Provided by Environmental influences on Child Health Outcomes Citation : Housing conditions and outdoor air pollution together affect children's asthma risk, study shows (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-housing-conditions-outdoor-air-pollution.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2025/child-3.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Scientists now know why ovarian cancer spreads so rapidly in the abdomen",
      "url": "https://medicalxpress.com/news/2026-02-scientists-ovarian-cancer-rapidly-abdomen.html",
      "published": "2026-02-06T19:00:01+00:00",
      "summary": "Ovarian cancer kills more women than any other gynecological cancer. Most patients receive their diagnosis only after the disease spreads throughout the abdomen. Until now, scientists have never fully understood why this cancer advances so fast.",
      "content_text": "Cancer cells (red) stick to mesothelial cells (green) and form hybrid spheres that cut into surrounding abdominal tissue. Credit: Uno et al., 2026 Ovarian cancer kills more women than any other gynecological cancer. Most patients receive their diagnosis only after the disease spreads throughout the abdomen. Until now, scientists have never fully understood why this cancer advances so fast. A new study led by Nagoya University explains why. Published in Science Advances , the study shows that cancer cells recruit help from protective mesothelial cells that normally line the abdominal cavity. Mesothelial cells lead the invasion and cancer cells follow the pathways they create. These hybrid cell clusters resist chemotherapy better than cancer alone. Researchers examined abdominal fluid from ovarian cancer patients and found something unexpected. Cancer cells do not float alone in the abdominal cavity. Instead, they often grab onto mesothelial cells and form hybrid spheres. About 60% of all cancer spheres contain these recruited mesothelial cells. The cancer cells release a protein called TGF-β1 that transforms the mesothelial cells and causes them to develop spike-like structures that cut through tissue. Red stained mesothelial cells (red arrow) break through surrounding tissue first and create pathways for cancer cells. Green cancer cells (white arrows) follow behind through the openings. Credit: Uno et al., 2026 Invadopodia, spike structures that do the digging for cancer When ovarian cancer develops, cancer cells break off from the tumor. These cells enter the abdominal fluid and float freely. The fluid moves around as you breathe and move your body. This movement carries the cancer cells to different spots in the abdomen. Most other cancers spread differently. Breast cancer or lung cancer cells enter blood vessels. They travel through the bloodstream to reach distant organs. Doctors can sometimes track these cancers through blood tests because blood moves in predictable paths through vessels. Ovarian cancer cells avoid blood vessels entirely. They float in fluid that has no fixed path. This floating stage happens before the cancer cells attach to new organs. Scientists did not fully understand what happened during the floating period or how cells worked together to spread cancer so quickly. The research team discovered that cancer cells recruit protective mesothelial cells that have shed from the abdominal cavity lining during this floating stage. The two cell types stick together and form hybrid spheres. The mesothelial cells then grow invadopodia, spike-like structures that drill into surrounding tissue. The hybrid spheres resist chemotherapy drugs more effectively and invade tissues faster when they land on organs. Outsourcing the hard work of cell invasion The researchers examined abdominal fluid from ovarian cancer patients using advanced microscopy to watch this process in real time. They confirmed their findings with mouse models and single-cell genetic analysis. Lead author Dr. Kaname Uno, a former Ph.D. student and current Visiting Researcher at Nagoya University's Graduate School of Medicine, explained that the cancer cells do not need to become more invasive themselves. \"They manipulate mesothelial cells to do the tissue invasion work. They undergo minimal genetic and molecular changes and just migrate through the openings that mesothelial cells create.\" Dr. Uno worked as a gynecologist for eight years before he pursued research. One of his patients changed his career path. She had clear screening results just three months before doctors found advanced ovarian cancer. Current medical tools failed to detect the cancer early enough to save her life. This motivated Dr. Uno to investigate why ovarian cancer spreads so rapidly. This discovery opens new treatment possibilities. Current chemotherapy targets cancer cells but ignores the mesothelial accomplices. Future drugs could block the TGF-β1 signal or prevent the formation of these dangerous partnerships. The research also suggests that doctors could monitor these cell clusters in abdominal fluid to predict disease progression and treatment response. Publication details Kaname Uno et al, Mesothelial cells promote peritoneal invasion and metastasis of ascites-derived ovarian cancer cells through spheroid formation, Science Advances (2026). DOI: 10.1126/sciadv.adu5944 . www.science.org/doi/10.1126/sciadv.adu5944 Journal information: Science Advances Key medical concepts Ovarian carcinoma Citation : Scientists now know why ovarian cancer spreads so rapidly in the abdomen (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-scientists-ovarian-cancer-rapidly-abdomen.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/scientists-now-know-wh.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "CRISPR approach turns oncogene amplification into a weakness in multiple solid tumors",
      "url": "https://medicalxpress.com/news/2026-02-crispr-approach-oncogene-amplification-weakness.html",
      "published": "2026-02-06T18:59:46+00:00",
      "summary": "The onset and aggressiveness of cancer are related to the abnormal behavior of certain genes, known as oncogenes. The best-known of these alterations is mutation, but it is not the only one. Sometimes, within a cell, a very high number of copies of the oncogene appear—tens or even hundreds. This amplification of oncogenes occurs in a significant proportion of solid tumors and may make the tumor more aggressive and prevent the body's defenses from detecting it, contributing to the development of resistance to treatments.",
      "content_text": "Intronic sgMYCN induces locus-specific DNA damage response and potentiates doxorubicin response. Credit: Molecular Cancer (2025). DOI: 10.1186/s12943-025-02542-0 The onset and aggressiveness of cancer are related to the abnormal behavior of certain genes, known as oncogenes. The best-known of these alterations is mutation, but it is not the only one. Sometimes, within a cell, a very high number of copies of the oncogene appear—tens or even hundreds. This amplification of oncogenes occurs in a significant proportion of solid tumors and may make the tumor more aggressive and prevent the body's defenses from detecting it, contributing to the development of resistance to treatments. A study led by Sandra Rodríguez-Perales, head of the Molecular Cytogenetics and Cancer Genome Editing Unit at the Spanish National Cancer Research Centre (CNIO), and by Raúl Torres, from the Innovative Therapies Unit at CIEMAT, uses the amplification of oncogenes as a vulnerability to fight the tumor. Published in Molecular Cancer , the study offers proof of concept in animal models to destroy tumor cells containing amplified oncogenes through gene editing. Thus, the excess copies of the oncogene become a tumor's Achilles' heel. Cutting to the root of the problem: The oncogene \"We used the CRISPR-Cas9 gene editing tool to make a cut in the amplified oncogene. Normally, when a cell detects damage in its DNA, it repairs it; but if the gene is amplified and exists in multiple copies, the cut occurs in all of them and a high level of genetic damage builds up. As it lacks the capacity to fully repair it, the cell triggers its cell death machinery,\" Rodríguez explains. The gene editing mechanism also affects healthy cells, but since they do not have the amplified gene, they can repair the cuts made. \"This addresses one of the major bottlenecks in gene editing therapies: achieving selective cutting, so that it targets tumor cells [in this case, those with amplified oncogenes] without harming healthy cells,\" the authors state. The new strategy has been tested in cellular and animal models of neuroblastoma, small cell lung cancer and colon cancer. These experiments saw a reduction in tumor growth, an increase in animal survival, and changes that may indicate a tumor-fighting immune response. Teaching the immune system Cell death would be induced by high levels of damage to the DNA. The team's hypothesis is that this type of cell death could alert the immune cells and promote the activation of a tumor-fighting response. In their experiments, they have already detected initial reactions to this activation, so they will delve further into this line of research in future work. \"Gene editing of amplification in tumors may be a basis for developing precision gene therapies for resistant cancers,\" the authors say. They have also begun to explore the combination with existing therapies, always in animal models. By combining gene editing and one of the common drugs used in chemotherapy for neuroblastoma, they observed that the number of cells that died was larger than the sum of those caused by the two treatments separately. Alejandro Nieto and Marta Martínez-Lage, the first authors of the study, state that \"the study demonstrates a CRISPR-based novel strategy that turns oncogene amplification into a vulnerability, triggering the death only of the tumor cells, which could open up a pathway towards precision therapies for hard-to-treat tumors.\" Publication details A. Nieto-Sanchez et al, Selective genome editing of amplified oncogenes triggers immunogenic cell death and tumor remodeling, Molecular Cancer (2025). DOI: 10.1186/s12943-025-02542-0 Journal information: Molecular Cancer Clinical categories Oncology Citation : CRISPR approach turns oncogene amplification into a weakness in multiple solid tumors (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-crispr-approach-oncogene-amplification-weakness.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/experimental-strategy.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Understanding the path from genetic changes to Parkinson's disease opens possibilities for early diagnosis",
      "url": "https://medicalxpress.com/news/2026-02-path-genetic-parkinson-disease-possibilities.html",
      "published": "2026-02-06T18:57:29+00:00",
      "summary": "A team led by researchers at Baylor College of Medicine and the Duncan Neurological Research Institute (Duncan NRI) at Texas Children's Hospital has uncovered a chain of events that connects genetic alterations, disruptions in lipid metabolism and the manifestation of Parkinson's disease in patients. The findings, published in the journal Brain, bring forward the possibility of identifying people at risk before symptoms appear and developing strategies to treat the disease rather than manage the symptoms.",
      "content_text": "Credit: Unsplash/CC0 Public Domain A team led by researchers at Baylor College of Medicine and the Duncan Neurological Research Institute (Duncan NRI) at Texas Children's Hospital has uncovered a chain of events that connects genetic alterations, disruptions in lipid metabolism and the manifestation of Parkinson's disease in patients. The findings, published in the journal Brain , bring forward the possibility of identifying people at risk before symptoms appear and developing strategies to treat the disease rather than manage the symptoms. \"Parkinson's disease is the second most common neurodegenerative disease after Alzheimer's disease, affecting more than 10 million people worldwide. We know more than 100 genes that increase the risk of developing the disease but, in most cases, we do not understand how the genetic change leads to the condition,\" said corresponding author Dr. Joshua Shulman, professor of neurology, neuroscience and molecular and human genetics at Baylor. He also is an investigator and co-director of the Duncan NRI. Previous studies have shown that many Parkinson's susceptibility genes participate in lipid metabolism and that disrupting some lipid functions may directly promote brain alterations that have been linked to the disease's onset and progression. Zeroing in on a key risk gene The researchers focused on a common Parkinson's risk gene called SPTSSB, which helps regulate the first steps in the synthesis of sphingolipids. The team specifically focused on an SPTSSB variant known as rs1450522, which has been linked to a modest increase in Parkinson's risk. \"We studied blood samples of people carrying this genetic variant who were healthy—they did not show any symptoms of the condition, like tremors, limb stiffness, gait and balance problems,\" Shulman said. \"We found that this risk variant increases the amount of protein SPTSSB produced in the brain, especially in neurons, and the levels of sphingolipids in blood, when compared to individuals not carrying this variant. Out of 62 sphingolipids that we measured, 23% were significantly altered.\" Tracking lipid shifts in patients These findings encouraged the team to look deeper to identify biological markers that may mediate the risk of developing the condition. The team systematically analyzed all the metabolites , the products of the body's metabolism, present in blood in 149 people with Parkinson's disease and 150 individuals without the condition. \"We identified multiple other lipids that were altered in patients with Parkinson's disease. For instance, fatty acids were present at lower levels in patients than in people without the condition. Interestingly, healthy individuals carrying the SPTSSB variant who had higher levels of multiple sphingolipids in their blood also had lower levels of certain fatty acids,\" Shulman said. Building evidence for a causal chain The researchers confirmed these findings using a large dataset of thousands of individuals. A statistical model developed with these data indicated that the SPTSSB gene variant rs1450522 drives increased Parkinson's risk, higher levels of SPTSSB protein and altered lipid metabolism. This provides strong evidence supporting that this chain of events connecting genetic changes and alterations on lipid metabolism may cause Parkinson's disease. Although the changes in lipids are modest, Shulman explained, \"we think they are important primarily because they give us insights into a mechanism, a process that triggers and sustains the condition. Understanding how these lipid metabolic changes set the path to Parkinson's disease can guide the development of treatments to prevent or delay the onset of symptoms.\" Implications for early diagnosis and care The researchers are further pursuing this promising line of research because it may also lead to the identification of early diagnosis markers that could be detected in a blood test. \"Currently, early diagnosis remains an unsolved challenge in Parkinson's research,\" Shulman said. \"We need sensitive, specific tests that can detect the disease before symptoms appear. By the time patients come to see me because of their symptoms, often their brains are already significantly affected, and we can only treat the symptoms for which we have effective therapies. But we still lack options for early diagnosis or for delaying or preventing this devastating disease.\" Publication details Ruth B De-Paula et al, Mapping the causal chain from genetic risk variants to lipid dysmetabolism in Parkinson's disease, Brain (2026). DOI: 10.1093/brain/awag039 Journal information: Brain Citation : Understanding the path from genetic changes to Parkinson's disease opens possibilities for early diagnosis (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-path-genetic-parkinson-disease-possibilities.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2023/parkinsons-disease-1.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "ABCA1 protein releases molecular brakes on solid tumor immunotherapy, study finds",
      "url": "https://medicalxpress.com/news/2026-02-abca1-protein-molecular-solid-tumor.html",
      "published": "2026-02-06T18:48:46+00:00",
      "summary": "In recent years, cancer researchers have made major breakthroughs by using the body's immune system to fight cancer. One of the most promising approaches, known as immune checkpoint blockade, works by releasing molecular \"brakes\" on T cells. This allows them to better recognize and attack cancer cells. While these therapies can be very effective for some patients, many solid tumors, including most forms of breast cancer, remain largely unaffected. Cancer Center at Illinois (CCIL) Program Co-leader Erik Nelson and his research group are working to understand why these treatments fail.",
      "content_text": "ABCA1 activity in macrophages increases their capacity to infiltrate mammary cancer spheroids. Credit: Science Advances (2026). DOI: 10.1126/sciadv.adx5490 In recent years, cancer researchers have made major breakthroughs by using the body's immune system to fight cancer. One of the most promising approaches, known as immune checkpoint blockade, works by releasing molecular \"brakes\" on T cells. This allows them to better recognize and attack cancer cells. While these therapies can be very effective for some patients, many solid tumors, including most forms of breast cancer, remain largely unaffected. Cancer Center at Illinois (CCIL) Program Co-leader Erik Nelson and his research group are working to understand why these treatments fail. Elevated blood concentrations of cholesterol have long been linked to cancer outcomes. In a new study, they found that a protein called ABCA1 is involved in transporting cholesterol out of a type of immune cell called macrophages, and in so-doing shifts them to an \"attack cancer\" mode. \"Immune based therapies have revolutionized how we can treat cancer, basically taking the brakes off of a type of immune cell called T cells so they can attack cancer,\" Nelson said. \"While this approach works well for some patients, many so-called solid tumors fail to respond or develop resistance mechanisms.\" Nelson's team began looking beyond T cells to try and understand why solid tumors fail to respond to traditional treatments. They focused on myeloid immune cells , particularly macrophages, which are abundant in many solid tumors and play a major role in shaping the tumor environment. The work is published in the journal Science Advances . \"Here, we find that ABCA1, which is a protein that transports cholesterol from inside the cell to the outside, plays a big role in directing how myeloid cells, specifically macrophages, behave,\" Nelson said. \"When we engineer macrophages to express more ABCA1, they become much better at fighting cancer and supporting the other immune cell type, T cells.\" Immune checkpoint blockers are currently approved for only one subtype of breast cancer, and even among those patients, only about a quarter respond to treatment. One reason, researchers believe, is the influence of myeloid cells in the tumor environment. These cells can suppress immune activity, promote new blood vessel growth that feeds tumors, and limit the effectiveness of immunotherapy. To understand how important ABCA1 is to the immune response, the team tested what happens when myeloid cells completely lack ABCA1. \"We next utilized mice that were engineered so that their myeloid cells did not express ABCA1,\" Nelson said. \"Tumors grew quicker in these mice, and perhaps even more importantly, immune based therapies failed to control tumors in these mice.\" The researchers also found strong evidence that these mechanisms matter in humans. In patient tumor samples, higher levels of ABCA1 in myeloid immune cells were associated with increased numbers of cancer killing T cells and improved outcomes for breast cancer patients. \"This tells us that what we are seeing in the lab is relevant to patients with cancer,\" Nelson said. \"It gives us confidence that targeting ABCA1 could be a meaningful new strategy for cancer immunotherapy.\" Looking ahead, Nelson's team is now focused on developing ways to increase ABCA1 activity specifically in tumor associated macrophages and testing whether these approaches can be combined with existing immune therapies. \"Our ultimate goal is to induce an immune response in tumors that were previously unresponsive to immunotherapy,\" Nelson said. \"The immune system has the capacity to eradicate cancer. We just need to figure out where all the brakes are and how to release them safely.\" Publication details Shruti V. Bendre et al, Cholesterol efflux protein, ABCA1, supports anticancer functions of myeloid immune cells, Science Advances (2026). DOI: 10.1126/sciadv.adx5490 Journal information: Science Advances Citation : ABCA1 protein releases molecular brakes on solid tumor immunotherapy, study finds (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-abca1-protein-molecular-solid-tumor.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/abca1-protein-releases.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Dual-action molecule design concentrates cancer treatment in tumor cells to allow higher doses",
      "url": "https://medicalxpress.com/news/2026-02-dual-action-molecule-cancer-treatment.html",
      "published": "2026-02-06T18:47:33+00:00",
      "summary": "Wistar scientists have combined a promising cancer therapy with a molecule that targets tumors to treat cancer more effectively. The new approach could be a way to deliver treatment directly to tumors at higher doses, while reducing side effects in healthy tissue. The research is published in the journal Molecular Cancer Therapeutics.",
      "content_text": "NN-01-195 reduces cell viability and promotes mitotic abnormalities. Credit: Molecular Cancer Therapeutics (2026). DOI: 10.1158/1535-7163.mct-25-0857 Wistar scientists have combined a promising cancer therapy with a molecule that targets tumors to treat cancer more effectively. The new approach could be a way to deliver treatment directly to tumors at higher doses, while reducing side effects in healthy tissue. The research is published in the journal Molecular Cancer Therapeutics . Targeting a powerful cancer inhibitor \"An Aurora kinase A (AURKA) inhibitor is viewed as a lethal synthetic molecule in cancer therapy, but the problem is you can't dose it high enough, because then it starts to spill over and target normal cells, causing toxicity,\" said co-author Joseph Salvino, Ph.D. \"By using this cancer-targeting approach, we can direct this molecule, which is already in clinical use, to cancer cells, increasing its exposure in the tumor itself.\" Salvino is professor in the Molecular and Cellular Oncogenesis Program at the Ellen and Ronald Caplan Cancer Center, and scientific director of Wistar's Molecular Screening & Protein Expression Facility. Building a tumor-seeking conjugate The new chimeric molecule takes two existing molecules and attaches them together like LEGO blocks to make what's called a small molecule drug conjugate. One half of the conjugate, an Aurora kinase A (AURKA) inhibitor, works by blocking a protein that controls cell division and helps tumors to grow. While this molecule has shown promise in clinical trials, it's also caused toxic side effects that limited its use. The second half is a molecule that binds to a protein called HSP90, which cancer cells produce to help them survive stress. By targeting HSP90 , which is found at high levels in cancer cells, researchers hoped to show that they could concentrate the compound within the tumor, preferentially over healthy tissue. Results from lab and animal tests In a proof-of-concept study, they demonstrated that the new chimeric molecule successfully binds to both the AURKA and HSP90 proteins. When researchers tested it in cell samples taken from multiple cancer types, including head and neck, lung, and melanoma, they found that it stopped the cancer cells from dividing and replicating, eventually causing the cells to die. The researchers then tested the new chimeric molecule in preclinical animal models. They found that it concentrated inside the tumors at levels sometimes 10 times higher than when the original AURKA inhibitor was used on its own. The compound also stayed in the tumor for much longer, and was still active 24 hours after being injected, while the original inhibitor was no longer detectable. The compound was also well tolerated in preclinical models, with no significant toxicity. Combination therapy and future directions When the researchers combined the new molecule with another cancer drug, called a WEE1 inhibitor , the two together were even more effective in controlling tumor growth. \"When drugs fail in the clinic, 50% of the time it's because of poor exposures in the tumor, due to pharmacokinetic problems,\" or the body's ability to absorb or interact with a drug, Salvino explained. \"Our approach will take an existing compound and improve its pharmacokinetic properties, enhancing its exposure to the tumor.\" In addition to the cancers tested in the initial study, the new compound should have broad application to many other types of cancer, he added. Next, researchers plan to apply their approach to different molecules and types of cancer. They also want to develop the new chimeric molecule into a formulation that can be given orally. Publication details Theodore T. Nguyen et al, NN-01-195, a novel conjugate of HSP90 and AURKA inhibitors, effectively targets solid tumors, Molecular Cancer Therapeutics (2026). DOI: 10.1158/1535-7163.mct-25-0857 Journal information: Molecular Cancer Therapeutics Citation : Dual-action molecule design concentrates cancer treatment in tumor cells to allow higher doses (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-dual-action-molecule-cancer-treatment.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/dual-action-molecule-d.jpg"
    },
    {
      "industry": "healthcare",
      "source": "STAT News",
      "title": "China criticizes U.S. for withdrawing from World Health Organization",
      "url": "https://www.statnews.com/2026/02/06/china-criticizes-us-withdrawal-from-who/?utm_campaign=rss",
      "published": "2026-02-06T18:44:30+00:00",
      "summary": "China criticized the United States for withdrawing from the WHO, saying countries should not place domestic politics ahead of international law.",
      "content_text": "China criticized the United States on Friday for withdrawing from the World Health Organization , saying countries should not place domestic politics ahead of international law. The country’s representative, attending a meeting of the WHO’s executive board, made the comments during discussions about the withdrawal of the U.S. and Argentina from the global health agency. Though the Trump administration has made clear the U.S. withdrawal is complete, the WHO has little precedent for the mechanics of such an exit. The executive board agreed to refer the issue to the World Health Assembly, the annual meeting of the WHO’s member states held every year in May. On the issue of Argentina, the executive board adopted a draft resolution to recommend the WHA acknowledge the country’s withdrawal. “Major countries in particular should lead by example,” the Chinese representative said during the portion of the weeklong meeting that dealt with the U.S. withdrawal. China is not currently a member of the WHO executive board, but other countries are allowed to attend its meetings and take part in its deliberations. “They should not treat the WHO as something to be used as it fits and abandoned when it [does] not, nor should they bypass the WHO and set up alternative mechanisms,” the Chinese official said. Officials speaking at the meeting were identified solely by the country which they were representing. STAT has asked the State Department for comment. The United States has suggested bilateral agreements and “results-driven partnerships” can protect the country from infectious diseases threats, a major role played by the WHO. The Chinese representative suggested the issue of withdrawal from the WHO was “complex and sensitive” and that countries should not be allowed to enter or exit at will. “At present, there are certain gaps and ambiguity in the WHO’s rule regarding membership changes,” he said. “Based on fairness and transparency, necessary adjustments and improvements should be made to better respond to the new circumstances and requirements on global health governance.” President Trump attempted to pull the United States out of the WHO during his first administration, but the Biden administration reversed the decision when it took office in 2021. Trump renewed the effort on the day of his second inauguration, giving a year’s notice as required by the 1948 congressional joint resolution that allowed the U.S. to join the WHO. The joint resolution also stipulated that the U.S. would need to pay outstanding bills before leaving the global health agency — something the Trump administration has insisted it will not do. The country has left the organization without paying at least $278 million in assessed contributions or dues for 2024 and 2025, plus several hundreds of millions more in voluntary contributions the country had promised the WHO for projects of particular interest to the United States. At the executive board meeting Friday, a representative from North Korea — which is currently a member of the board — raised the issue of the unpaid U.S. bills. “It is our view that the obligation of discharging arrears of the assessed contributions due to the WHO is applicable to all withdrawing countries,” the North Korean official said. Discussion of the U.S. withdrawal from WHO was surprisingly short — less than five minutes — with comments made by only China, North Korea, and Israel. The latter, also a member of the executive board at present, suggested further discussion of the U.S. membership question was a waste of the body’s time. “Any attempt to compel states against their national decisions is an infringement of their sovereign rights,” the Israeli representative said. “There is no valid reason to further discuss this matter in any WHO forum.” The Trump administration attributed its decision to withdrawal in large part to the WHO’s handling of the Covid-19 pandemic. It also complained about the fact that the U.S. paid more to sustain the WHO than China, which has a substantially larger population. The dues structure for United Nations agencies — WHO is one — is based on the size of a member country’s economy, not its population. At the World Health Assembly last May, China announced it would increase its funding for WHO. Two months after Trump signed the executive order announcing that the U.S. would withdraw from the WHO, Argentina — led by Javier Milei, a close ally of Trump’s — announced it, too, was pulling out . Citing similar complaints about the WHO’s handling of the Covid pandemic, Argentina said it would leave the agency’s fold on March 17 of this year. The matter of withdrawing from the WHO is more complicated than it may seem. In fact, a document prepared for the executive board on the issue suggested countries are not able to quit the WHO. At the agency’s founding there were discussions about whether to include a process for withdrawing, but a decision was made not to. The U.S. Congress would only agree to the country joining if there was a way for it to withdraw if the need arose, and passed the 1948 joint resolution. The proviso was accepted by the WHO’s founders, and the country became a member on June 21, 1948. Because no such provision existed in the case of Argentina, the discussion of its withdrawal on Friday was longer than it was for the United States. Though some countries reserved their positions on Argentina’s withdrawal, a number made it clear they felt that a country could not be compelled to remain in the organization. The Israeli representative suggested that it was “unfathomable” to imagine that the WHO’s founders would have meant to grant a single country — the United States — the option of exiting the agency if it wished.",
      "cover_image_url": "https://www.statnews.com/wp-content/uploads/2025/01/GettyImages-1232766072-1024x576.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Experimental bioadhesive patch sticks to wet brain tissue and wipes out most glioblastoma cells",
      "url": "https://medicalxpress.com/news/2026-02-experimental-bioadhesive-patch-brain-tissue.html",
      "published": "2026-02-06T18:43:30+00:00",
      "summary": "Glioblastoma is the most prevalent and aggressive brain tumor. It proliferates very rapidly, is highly invasive, and there is currently no treatment capable of halting its progression or curing it, which means life expectancy after diagnosis is very short. The standard procedure involves surgical resection of the tumor followed by radiotherapy and chemotherapy, but even with this aggressive treatment, recurrences are very common, often within a year.",
      "content_text": "Representation of the applicability of the CATH-M membrane in glioblastoma treatment. Credit: Advanced Science (2026). DOI: 10.1002/advs.202510658 Glioblastoma is the most prevalent and aggressive brain tumor. It proliferates very rapidly, is highly invasive, and there is currently no treatment capable of halting its progression or curing it, which means life expectancy after diagnosis is very short. The standard procedure involves surgical resection of the tumor followed by radiotherapy and chemotherapy, but even with this aggressive treatment, recurrences are very common, often within a year. Now, in an article published in the journal Advanced Science , a research team led by Professor Víctor Yuste, from the Department of Biochemistry and Molecular Biology and the Institut de Neurociències de la UAB (INc-UAB), has designed and tested several bioadhesive patches that could be placed at the site where the tumor is removed during surgery, targeting any remaining cancer cells. The design of the patches is inspired by the way mussels adhere to rocks (using polyphenol-type molecules ), allowing the material to strongly attach to moist brain tissue and enabling sustained release of the drug. According to the results, among all the tested options, the patch containing catechin—a natural polyphenol found in green tea, cocoa, and some fruits—performed best, eliminating approximately 90% of malignant cells. This highly oxidizing material induces cell death by increasing reactive oxygen species (ROS). Synthesis of the CATH-M and PYRO-M membranes. Credit: Advanced Science (2026). DOI: 10.1002/advs.202510658 \"If catechin were administered orally, it could cause unwanted systemic side effects. However, by adhering to the area from which the tumor has been removed, it can act locally, minimizing or even preventing the appearance of side effects,\" explains Professor Yuste. In addition, \"these materials show high antimicrobial activity and excellent biocompatibility, which would help prevent infections and promote proper wound healing. Combined with their extremely low production cost and the simplicity of their fabrication, they represent a viable option in terms of future development, scalability, and potential investor interest,\" adds Jose Bolaños-Cardet, a researcher at the UAB and the Catalan Institute of Nanoscience and Nanotechnology (ICN2). The study, a collaboration among several research centers in Catalonia—including the INc-UAB, the ICN2, and the Bellvitge University Hospital – Catalan Institute of Oncology (ICO) – Bellvitge Biomedical Research Institute (IDIBELL)—could represent a major step forward in the treatment of glioblastoma and offer hope to patients facing this devastating diagnosis. Publication details Jose Bolaños‐Cardet et al, A Mussel‐Inspired Bioadhesive Patch to Selectively Kill Glioblastoma Cells, Advanced Science (2026). DOI: 10.1002/advs.202510658 Journal information: Advanced Science Clinical categories Oncology Neurology Citation : Experimental bioadhesive patch sticks to wet brain tissue and wipes out most glioblastoma cells (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-experimental-bioadhesive-patch-brain-tissue.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/2026/a-bioadhesive-patch-in.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Brain network identified for effective treatment of Parkinson's disease",
      "url": "https://medicalxpress.com/news/2026-02-brain-network-effective-treatment-parkinson.html",
      "published": "2026-02-06T18:41:06+00:00",
      "summary": "Deep brain stimulation (DBS) improves motor symptoms of Parkinson's disease by modulating a specific brain network that is mainly active in the fast beta frequency range (20 to 35 Hz). This conclusion was reached by an interdisciplinary team of neuroscientists and clinicians from the University Hospitals of Cologne and Düsseldorf, Harvard Medical School and Charité Berlin. The study \"The Deep Brain Stimulation Response Network in Parkinson's Disease Operates in the High Beta Band\" in the journal Brain is the first to bridge the gap between two ways of analyzing DBS response that were previously widely separate: electrophysiology and brain imaging.",
      "content_text": "3D representation of beta connectivity between the site of stimulation (subthalamic nucleus, STN) and the cerebral cortex, as well as a schematic representation of connectivity over time. The Big Brain Atlas is shown in the background. Credit: Bahne Bahners Deep brain stimulation (DBS) improves motor symptoms of Parkinson's disease by modulating a specific brain network that is mainly active in the fast beta frequency range (20 to 35 Hz). This conclusion was reached by an interdisciplinary team of neuroscientists and clinicians from the University Hospitals of Cologne and Düsseldorf, Harvard Medical School and Charité Berlin. The study \"The Deep Brain Stimulation Response Network in Parkinson's Disease Operates in the High Beta Band\" in the journal Brain is the first to bridge the gap between two ways of analyzing DBS response that were previously widely separate: electrophysiology and brain imaging. \"For the first time, we were able to characterize the DBS response network in Parkinson's disease in terms of space and time, simultaneously,\" says Professor Dr. Andreas Horn from the University of Cologne, who led the study and specializes in computational neurology. \"We show that Parkinson's disease can best be treated if we stimulate a very precisely defined network. This network operates synchronized within a specific frequency band, and offers an explanation for how well patients respond to deep brain stimulation.\" Deep brain stimulation of the subthalamic nucleus is an established treatment method for alleviating motor symptoms in people with Parkinson's disease by delivering small electric pulses to deep regions of the brain. Whereas previous imaging studies have shown where in the brain the stimulation works best, and electrophysiological studies described the frequency of the underlying signals, no study has yet been able to capture both dimensions simultaneously in space and time. The research team analyzed data from a large multi-center cohort with one hundred brain hemispheres from fifty patients. Using brain signals that were simultaneously recorded via the implanted DBS electrode and magnetoencephalography (MEG), the scientists mapped the functional connectivity between the deep and superficial areas of the brain. The study showed that the relevant network between the subthalamic nucleus and frontal brain regions largely communicates at a comparatively fast frequency (20–35 Hz). The strength of this connection explains how well the motor symptoms of individual patients improved after electrode implantation. \"These results suggest that a certain rhythm of the brain acts as a communication channel between the subthalamic nucleus and the cerebral cortex and may mediate the therapeutic effects of deep brain stimulation,\" explains Dr. Bahne Bahners, first author of the study, who works at Düsseldorf University Hospital. \"By stimulating regions that are connected to the identified network, we will probably be able to adjust DBS settings more precisely in the future, especially in patients who have not yet benefited optimally from deep brain stimulation.\" In the future, the researchers plan to take a closer look at the causal effects of deep brain stimulation on brain networks. Studies to this effect are currently being conducted. Publication details The Deep Brain Stimulation Response Network in Parkinson's Disease Operates in the High Beta Band, Brain (2026). DOI: 10.1093/brain/awaf445 Journal information: Brain Clinical categories Neurology Citation : Brain network identified for effective treatment of Parkinson's disease (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-brain-network-effective-treatment-parkinson.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/hires/2026/brain-network-identifi.jpg"
    },
    {
      "industry": "healthcare",
      "source": "Medical Xpress",
      "title": "Understanding how cancer cells use water pressure to move through the body",
      "url": "https://medicalxpress.com/news/2026-02-cancer-cells-pressure-body.html",
      "published": "2026-02-06T18:39:30+00:00",
      "summary": "Cancer is one of the leading causes of death worldwide, marked by the uncontrolled growth of abnormal cells. What makes it more dangerous is the ability of cancer cells to move quickly through the body, allowing them to invade surrounding tissues. While this behavior is well known, the mechanism behind this rapid spread remains unclear. Researchers from Kyushu University set out to fill this gap and unveiled a new physical process that helps cancer cells move rapidly throughout the body.",
      "content_text": "Calcium/calmodulin-dependent protein kinase II (CaMKII) gathers inside a growing membrane bleb, creating a local increase in water pressure. This pressure draws in water and pushes the cell membrane outward, helping the cell move by amoeboid migration. Credit: Junichi Ikenouchi / Kyushu University Cancer is one of the leading causes of death worldwide, marked by the uncontrolled growth of abnormal cells. What makes it more dangerous is the ability of cancer cells to move quickly through the body, allowing them to invade surrounding tissues. While this behavior is well known, the mechanism behind this rapid spread remains unclear. Researchers from Kyushu University set out to fill this gap and unveiled a new physical process that helps cancer cells move rapidly throughout the body. This study was led by Professor Junichi Ikenouchi from Kyushu University's Faculty of Medical Sciences, along with his colleagues at Kyushu University, in collaboration with Yokohama City University. The findings of this study, published in The EMBO Journal on February 3, 2026, reveal how water pressure generated inside cells aids in cancer cell migration. Healthy cells typically move by attaching to surfaces, which allows them to pull themselves forward. While existing therapies can target this adhesion-based movement, cancer cells evade this treatment approach by following a different strategy: amoeboid migration . In this mode, cells form temporary bulges called blebs, enabling them to squeeze through tight spaces without attaching to their surroundings. For a long time, it was believed that bleb expansion was driven by internal pressure—until research by Ikenouchi in 2021 overturned that assumption. \"In our previous research, we observed that expanding blebs show unique cytoplasmic properties such as high levels of calcium ions, suggesting that blebs are not just passive, pressure-driven protrusions but specialized cellular compartments,\" explains Ikenouchi. Movie of WT DLD1 cells expressing the CaMKII FRET probe Camui-CR showing the FRET/donor ratio, related to Fig. 4A. Scale bar, 10 µm. Credit: The EMBO Journal (2026). DOI: 10.1038/s44318-026-00703-5 Inspired by this, the researchers wanted to further explore the reasons behind these bleb expansions. Furthermore, they also noticed significantly higher levels of calcium/calmodulin-dependent protein kinase II (CaMKII) present in the cells, prompting a critical question: does CaMKII have a more direct physical role in shaping cells and their movements? As the researchers probed deeper into bleb dynamics, they discovered that CaMKII does much more than act as a signaling protein. When a bleb begins to grow, there is an increase in the calcium levels inside the cells. In response to this surge, CaMKII present in the cell undergoes a structural change and assembles into a large protein supercomplex together with other molecules. Once formed, this supercomplex behaves like an osmotic engine, creating a concentration gradient that draws water into the bleb through osmosis. The water pushes the cell membrane outwards, leading to rapid growth of the bleb. This newly discovered process was named \"CODE\" which stands for \"CaMKII-based osmotically-driven deformation.\" \"Surprisingly, cells can generate force simply by changing how proteins are distributed inside them,\" says Ikenouchi. \"CaMKII creates pressure by gathering in one place, and that pressure physically pushes the membrane outward.\" These findings hold great significance in molecular biology, as most advanced cancer cells rely on amoeboid movement. In such cases, treatment becomes difficult; most current therapies only target cell proliferation or adhesion-dependent migration. Uncovering the CODE mechanism opens new avenues for therapies that specifically target amoeboid movement. Apart from cancer, understanding how cells generate force through changes in their physical properties could also have implications for regenerative medicine, developmental biology, and tissue engineering. This research may inspire new therapeutic strategies that target cellular mechanics rather than classical signaling pathways, opening the door to more robust and effective treatments. Publication details Yuki Fujii et al, CaMKII nucleates an osmotic protein supercomplex to induce cellular bleb expansion, The EMBO Journal (2026). DOI: 10.1038/s44318-026-00703-5 Journal information: EMBO Journal Clinical categories Oncology Citation : Understanding how cancer cells use water pressure to move through the body (2026, February 6) retrieved 6 February 2026 from https://medicalxpress.com/news/2026-02-cancer-cells-pressure-body.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
      "cover_image_url": "https://scx2.b-cdn.net/gfx/news/2026/understanding-how-canc.jpg"
    },
    {
      "industry": "healthcare",
      "source": "STAT News",
      "title": "White House wants to add more drugs to TrumpRx",
      "url": "https://www.statnews.com/2026/02/06/white-house-wants-more-pharma-companies-on-trumprx/?utm_campaign=rss",
      "published": "2026-02-06T18:36:05+00:00",
      "summary": "The Trump administration wants more companies to offer prescription drugs at discounted cash prices on TrumpRx.",
      "content_text": "WASHINGTON — After striking 16 deals with pharmaceutical giants and launching a direct-to-consumer drug purchasing platform, the Trump administration is looking to expand its efforts to lower drug prices to more companies. Federal officials on Thursday unveiled the administration’s TrumpRx drug purchasing platform with 43 drugs, promising substantial discounts for people paying cash, without insurance. STAT+ Exclusive Story Already have an account? Log in This article is exclusive to STAT+ subscribers Unlock this article — plus daily intelligence on Capitol Hill and the life sciences industry — by subscribing to STAT+. Already have an account? Log in Individual plans Group plans View All Plans To read the rest of this story subscribe to STAT+. Subscribe",
      "cover_image_url": "https://www.statnews.com/wp-content/uploads/2026/02/GettyImages-2259517422-1024x576.jpg"
    }
  ]
}