{
  "industry": "retail",
  "collected_at": "2026-02-07T12:38:08.284290+00:00",
  "hours": 24,
  "limit": 25,
  "count": 5,
  "items": [
    {
      "industry": "retail",
      "source": "Retail Dive",
      "title": "The Home Depot debuts Material List Builder AI",
      "url": "https://www.retaildive.com/news/home-depot-material-list-builder-ai-tool/810883/",
      "published": "2026-02-06T17:53:00+00:00",
      "summary": "<figure><div><img src=\"https://imgproxy.divecdn.com/OMDWEXQi77CXU1UhAZEAujBIjOifNrrLGl2YEc8HNcM/g:nowe:18:129/c:1991:1125/rs:fill:1600:900:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9ob21lX2RlcG90X25vdmVtYmVyXzIwMjQuanBn.webp\" /></div></figure><p>The technology helps its Pro customers quickly generate project material lists&nbsp;from voice prompts, emails, texts or existing documents.&nbsp;</p>",
      "content_text": "Listen to the article 3 min This audio is auto-generated. Please let us know if you have feedback . Dive Brief: The Home Depot in late January debuted its Material List Builder AI tool , which helps professional renovators, remodelers, builders and tradespeople create project material lists. Users can type or dictate their queries using natural language; incorporate existing lists from spreadsheets, emails, texts or other documents; or use built-in list templates. Once the tool creates a list, it will autopopulate product recommendations with customers’ preferred pricing and inventory availability. Pros can select and order their desired items from that list as well as reorder items from previous lists, according to a company press release. Dive Insight: The Home Depot is doubling down on its tech features for Pro customers. The latest tool uses AI tech to generate actionable project lists with the goal of helping Pros stay on time and on budget with their projects. “Pros often tell us that their most valuable resource for any job is time, so we're focused on delivering solutions that empower Pros to work smarter and faster,” Mike Rowe, executive vice president of Pro for The Home Depot, said in a statement. \"Material List Builder AI generates reliable, comprehensive job lists in a fraction of the time it would take to complete this process manually, and Pros can then spend more time focused on their customers and the job at hand.\" The Material List Builder AI is available for free to Pro Xtra members, within the Home Depot’s Project Planning tool. The home improvement retailer unveiled the Project Planning tool , a digital hub where professional customers can track and manage their projects, last September. Later that fall, the company released its Blueprint Takeoffs tool , which uses AI to generate more accurate and cost-effective material lists and estimates for single-family project blueprints. In a continued focus on the professional customer segment, The Home Depot named Michael Rowe — a nearly 20-year company veteran — executive vice president of Pro last March. “We are uniquely positioned to win as we build out our Pro ecosystem, investing in capabilities to grow share of wallet with Pros no matter how they choose to shop with us,” CEO Ted Decker said in a statement at the time of Rowe’s appointment. Last June, the retailer’s subsidiary SRS Distribution acquired specialty building products distributor GMS Inc. in a deal valued at $5.5 billion. The Home Depot purchased SRS Distribution , which caters to pool, roofing and landscaping contractors, for roughly $18.3 billion in 2024.",
      "cover_image_url": "https://imgproxy.divecdn.com/Z2YLpw8AwiQcj0s2Y6sdSNtzLBwwNjy9QMJJk1xHvew/g:nowe:18:129/c:1991:1125/rs:fit:770:435/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9ob21lX2RlcG90X25vdmVtYmVyXzIwMjQuanBn.webp"
    },
    {
      "industry": "retail",
      "source": "Retail Dive",
      "title": "Under Armour CEO: ‘Most disruptive’ phase of turnaround is over",
      "url": "https://www.retaildive.com/news/under-armour-ceo-disruptive-turnaround-progress/811591/",
      "published": "2026-02-06T17:36:00+00:00",
      "summary": "<figure><div><img src=\"https://imgproxy.divecdn.com/S1wcecDob8w5jYeGpYc9jS7UCda6gfBWxmEUvdq9Q8Q/g:ce/rs:fill:1600:900:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9HZXR0eUltYWdlcy02MzU0OTY2MzguanBn.webp\" /></div></figure><p>Revenue in Q3 was down 5% to $1.3 billion, but executives believe declines in North America have hit the bottom of their trajectory.</p>",
      "content_text": "Listen to the article 4 min This audio is auto-generated. Please let us know if you have feedback . Dive Brief: Under Armour CEO Kevin Plank on Friday said the “most disruptive” phase of the brand’s turnaround is now behind it. The executive sees revenue volatility stabilizing, cleaner inventories and growing interest from wholesale partners. Importantly, Plank believes Under Armour’s declines in North America are hitting the bottom of their trajectory. Revenue in the region, which accounts for 57% of Under Armour’s business, declined 10% in Q3. Overall, Under Armour’s revenue was down 5% year over year to $1.3 billion, with wholesale declining 6% and DTC down 4%. By category, footwear faced the largest decline, at 12%, while both apparel and accessories fell 3%. Dive Insight: While revenue is still falling, Under Armour executives believe they’ve reached a turning point in the brand’s comeback efforts. The leadership team is now shifting its focus to stabilization and execution, according to Plank. Looking ahead to next year, wholesale partners are buying into Under Armour’s strategy, according to Plank. Specifically, Under Armour is “no longer looking at significant declines” in wholesale, an important milestone. The retailer also continues to prioritize a strategy of building out “better” and “best” products, which are more premium offerings with higher price points. An effort to reduce Under Armour’s SKUs by 25% , announced nearly two years ago, is now complete. Executives are now turning their attention to efficiencies in the raw materials the brand uses. Under Armour is still targeting reductions in its footwear business, with plans to exit certain styles and reduce SKUs across that category. Plank acknowledged that the footwear business grew for too long by releasing new products without the demand to support them. Going forward, the brand is taking inspiration from footwear brands who are doing “a lot more with a lot fewer items.” The segment is expected to stabilize by 2027. “There are no shortcuts in a turnaround like this,” Plank said on the call. While the turnaround work is not yet finished, Under Armour now has the correct team in place to execute on its strategy, according to Plank. That includes a slate of recent changes that put Americas President Kara Trent into the role of chief merchandising officer and promoted 16-year veteran Adam Peake into her position. Longtime Adidas executive Eric Liedtke, who joined the company in 2024 to head up brand strategy , is also now chief marketing officer. Analysts are not as convinced by the brand’s progress. GlobalData Managing Director Neil Saunders noted that the brand beat sales expectations, but said this was a “low bar” to begin with and still represents a weak performance against the broader sportswear market. “Under Armour will argue that some of this step back is deliberately engineered as the brand tries to move away from excessive discounting and takes a more disciplined approach to ranging and product development,” Saunders said in emailed comments. “While we agree that these are sensible steps and concur that they have a material impact on the numbers, they do not provide the whole picture.” Needham analyst Tom Nikic noted that the brand’s optimism is encouraging, but the company is awaiting “further proof points of a clear turnaround” at the company. Chief among concerns for Saunders is that Under Armour is losing its importance to consumers at the same time that rival brands like Gymshark and On are gaining speed. Even successful lines like the Vanish range are getting “buried” under the brand’s other products and a lack of strong brand positioning, Saunders said. “To be fair, this is the very thing the current management team is trying to unpick. But our blunt assessment is that this is not yet coming through strongly enough on the ground nor is it completely resonating with consumers,” Saunders said.",
      "cover_image_url": "https://imgproxy.divecdn.com/1DzYGqIHwKY_VBk_eMv9DPwhic0rBcWq1BffKzfbfOY/g:ce/rs:fit:770:435/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9HZXR0eUltYWdlcy02MzU0OTY2MzguanBn.webp"
    },
    {
      "industry": "retail",
      "source": "Retail Dive",
      "title": "Amazon’s Q4 retail sales grow amid broadening assortment",
      "url": "https://www.retaildive.com/news/amazons-q4-retail-sales-grow/811584/",
      "published": "2026-02-06T17:31:00+00:00",
      "summary": "<figure><div><img src=\"https://imgproxy.divecdn.com/IyN6GcjOZixTvu2YYWbsY_GvL5MGkkUztUqJ28cQSqo/g:nowe:0:0/c:2000:1129/rs:fill:1600:900:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS92YW4taGVyby1hbWF6b24uanBn.webp\" /></div></figure><p>The e-commerce giant will continue to carry luxury offerings, though everyday essentials were one out of every three units sold in fiscal 2025.</p>",
      "content_text": "Listen to the article 4 min This audio is auto-generated. Please let us know if you have feedback . Dive Brief: Amazon’s fourth quarter online store net sales increased 10% year over year to nearly $83 billion, per a Thursday press release. The e-commerce giant’s physical store sales rose 5% to about $5.9 billion. Related retail operations also grew, with third-party seller services increasing 11% and subscription services jumping 14%. Amazon’s overall net income increased from $20 billion in the same period the year before to $21.2 billion in its latest quarter. Amazon expects companywide net sales for the first quarter of fiscal year 2026 to be between $173.5 billion and $178.5 billion, representing growth between 11% and 15% year over year. Dive Insight: For Amazon’s retail side of the business, the company is continuing to beat the drum on expanding its assortment with both higher-end products and everyday essentials. “We're going to work really hard to expand selection,” CEO Andy Jassy told analysts on a Thursday call. “We have a lot more of those luxury brands that have built presences in Amazon had success and found that we could manage their brand presentation in the right way, and they've been very happy.” Jassy’s comments come as the e-commerce company recently said it will continue operating a luxury online storefront despite Saks Global wanting to end its partnership with Amazon. Amazon developed its “Luxury Stores at Amazon” storefront about a year ago, which was curated by Saks Fifth Avenue . Saks Global is now seeking to end the arrangement as part of its bankruptcy process. For its nonluxury assortment, Jassy noted that everyday essentials represented one out of every three units sold in fiscal 2025. “[North American retail] and International benefited from an expanded product assortment, sharper pricing, and faster delivery,” Telsey Advisory Group analysts led by Joe Feldman said in an emailed note Friday. “Amazon's ability to fuel key growth opportunities — grocery, private brands, pharmacy, logistics, and generative AI — should make it more valuable.” In addition to the assortment efforts, Jassy on the Thursday call highlighted the company’s quick delivery initiatives. The chief executive said it launched Amazon Now in India, Mexico and the United Arab Emirates, which provides delivery on thousands of items in 30 minutes or less. Amazon is also testing it in several communities across the U.S. and U.K. Although the e-commerce giant maintained market share despite increasing competition, GlobalData Managing Director Neil Saunders said that there was a notable divergence between Amazon's online and physical store sales. “The more lackluster store numbers were delivered even though Whole Foods continues to perform reasonably well, so they underscore some of the reasoning for Amazon exiting its own-brand physical grocery stores,” Saunders said in emailed comments Thursday. Amazon in January announced that it would close all of its convenience-oriented Amazon Go stores, as well as its grocery-focused Amazon Fresh locations. An undisclosed number of those locations will be converted into Whole Foods Market stores. Meanwhile, the e-commerce company is working to open a new store concept outside of Chicago, which will be its first big-box format featuring household essentials and groceries. Amazon’s latest earnings results also come about a week after it revealed it will cut another 16,000 roles in a broader downsizing effort, adding to the previous 14,000 positions it cut in 2025. The company did not disclose how much of the latest reduction will impact retail operations positions.",
      "cover_image_url": "https://imgproxy.divecdn.com/OjOFdbCQJZQ0k1zZcB0xJ5KbbO8U6DxsMvjKq2qt1bE/g:nowe:0:0/c:2000:1129/rs:fit:770:435/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS92YW4taGVyby1hbWF6b24uanBn.webp"
    },
    {
      "industry": "retail",
      "source": "Retail Dive",
      "title": "Saks Global brings back Neiman Marcus exec to oversee marketing, e-commerce",
      "url": "https://www.retaildive.com/news/saks-global-neiman-marcus-exec-cheryl-han-returns-chief-marketing-digital-officer/811579/",
      "published": "2026-02-06T16:17:00+00:00",
      "summary": "<figure><div><img src=\"https://imgproxy.divecdn.com/NA2N2BXTpyHMSVt9LpvPzWettKTyAsMu18dmNh2UHIo/g:ce/rs:fill:1600:900:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9uZWltYW5fbWFyY3VzX2NoaWNhZ28uanBn.webp\" /></div></figure><p>Cheryl Han, who joined Saks Global&rsquo;s leadership early last year but left months later, has taken the dual role of chief marketing and digital officer.</p>",
      "content_text": "Listen to the article 2 min This audio is auto-generated. Please let us know if you have feedback . Cheryl Han has returned to Saks Global, this time in a newly created dual role, chief marketing and digital officer, the luxury department store conglomerate confirmed by email Thursday. Han will oversee “end-to-end marketing strategy and execution, and will also oversee Saks Global’s e-commerce businesses,” a Saks Global spokesperson said in a statement. “We are pleased to announce the appointment of Cheryl Han as Chief Marketing & Digital Officer of Saks Global as we continue to take decisive steps to position the company for sustainable, profitable growth,” the spokesperson said. “This newly created position brings two important pillars together under one leader and reflects the critical role that marketing and digital play in driving sales and customer engagement across all channels.” It’s a return for Han, who left Saks Global in August. That was just months after she was named to Saks Global’s leadership team, shortly after the $2.7 billion deal to acquire Neiman Marcus Group closed in late December. Han is a longtime Neiman Marcus veteran — as is newly appointed Saks Global CEO Geoffroy van Raemdonck. Her work at Neiman Marcus Group included a stint as chief digital officer and, before that, oversight of e-commerce and customer strategy at Bergdorf Goodman . Saks Global, whose struggles commenced almost immediately after the deal was finalized, watched a series of executives shift roles and/or make their exit throughout 2025. The company on Jan. 14 announced a bankruptcy filing . Han’s work could be complicated by the separate tracks Saks Fifth Avenue’s digital operations are on, including through the company’s Chapter 11 process. In 2021, Saks Fifth Avenue spun off the e-commerce of full-line Saks Fifth Avenue and the off-price Saks Off 5th banner from the brick-and-mortar operations. The digital businesses are part of Saks Global’s Chapter 11 process, but have their own chief restructuring officer . Last month the company announced it is liquidating all off-price e-commerce and shuttering nearly 60 off-price stores , leaving just a dozen open to sell excess inventory from its full-price banners.",
      "cover_image_url": "https://imgproxy.divecdn.com/0QT_AqSuWCz7wO6YemCNkdBvhH-K0w6g97oaaWuiRts/g:ce/rs:fit:770:435/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9uZWltYW5fbWFyY3VzX2NoaWNhZ28uanBn.webp"
    },
    {
      "industry": "retail",
      "source": "Retail Dive",
      "title": "The Weekly Closeout: Layoffs jump in January and Walmart hits $1 trillion market cap",
      "url": "https://www.retaildive.com/news/the-weekly-closeout-layoffs-january-walmart-1-trillion-market-cap/811544/",
      "published": "2026-02-06T16:15:00+00:00",
      "summary": "<figure><div><img src=\"https://imgproxy.divecdn.com/as2dABG_NULOC-c-twAWosnhIGhrI4Tk12rYbA4DK-o/g:nowe:234:2/c:841:475/rs:fill:1600:900:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9TY3JlZW5zaG90XzIwMjUtMDUtMDJfMTEzNzM4LnBuZw==.webp\" /></div></figure><p>Last month was the biggest dip in hiring since the Great Recession. Meanwhile, the big-box retailer reached a milestone.&nbsp;</p>",
      "content_text": "Listen to the article 5 min This audio is auto-generated. Please let us know if you have feedback . It’s been another week with far more retail news than there is time in the day. Below, we break down some things you may have missed during the week and what we’re still thinking about. From to Ikea’s falafel promotion to Bob’s Discount Furniture making its New York Stock Exchange debut , here’s our closeout for the week. What you may have missed Adidas opens first US soccer flagship With the World Cup landing in North America this summer, Adidas last week opened its first soccer-focused flagship in the U.S., at New Jersey’s American Dream mall. The store will offer athletic footwear, gear and lifestyle products like the Adidas Originals line, according to a press release from the shopping mall. The store will cater to both avid soccer fans and newcomers, and will offer the first 200 visitors an Adidas zine with exclusive content and other offerings. A grand opening is planned for Feb. 25 and will feature athlete appearances. Adam Petrick, chief marketing officer of American Dream, expressed excitement at the debut of Adidas’ soccer-focused store concept, which the mall describes as an “immersive, soccer-driven retail experience.” “This opening reinforces our commitment to bringing iconic brands and culturally relevant experiences to our guests, especially as the world turns its attention to the global game,” Petrick said in a statement. American Dream plans to have a slate of World Cup-related programming throughout 2026. Bob’s Discount Furniture makes its NYSE debut Ahead of its public market debut, Bob’s Discount Furniture on Wednesday said it would price its initial public offering at $17 per share , which was on the lower end of its expected range of $17 to $19 per share. Shares of the company’s common stock began trading on the New York Stock Exchange on Thursday. Bob’s operates about 200 stores across 26 states as of Sept. 28, but sees the potential to run more than 500 stores by 2035 , according to its S-1 filing. Retail therapy Ikea fala-falls for the Tiny Chef Ikea and the “Tiny Chef” stop-annimation show are partnering on three episodes to celebrate the launch of the retailer’s falafel. The story finds the Tiny Chef visiting an Ikea store only to become an ambassador for the falafel balls. The collaboration is part of Ikea’s year-long “Cooking & Eating” initiative. Image courtesy of Ikea “[W]e have the privilege and responsibility to make healthier, sustainable food choices accessible and affordable for the many,” Lourido Gomez, global food manager at Ikea Retail Ingka Group, said in a statement. “ We are excited to partner with Tiny Chef, showing people that plant-based eating should be joyful, creative, and full of flavour, not just better for the planet.” The Tiny Chef episodes began releasing on Monday and can be found on Tiny Chef’s official channels, with promotion across Ikea’s social platforms in the U.S., U.K., Canada, Germany and Australia. What we’re still thinking about $1 trillion Walmart Inc. hit a milestone on Tuesday by reaching a market value of over $1 trillion. The mass retailer reached the value as its share price surpassed a little over $125, which was needed to hit a more than $1 trillion market cap. Walmart's share price traded at a high of $128.17 for the day, and it has maintained the record market cap since. The move comes after Walmart transferred its listing from the New York Stock Exchange to the Nasdaq in December. Former CEO Doug McMillon at the time said this move helped reflect the retailer’s commitment to innovation and growth as a “tech-powered omnichannel retailer.” What we’re watching Consumers face most January job cuts, biggest dip in hiring since the Great Recession, Challenger says The number of job cuts announced in the U.S. in January rose 118% year over year and 205% from December, according to a report from Challenger, Gray & Christmas. The total of 108,435 is the highest for January since 2009 — the height of the Great Recession — and the highest for any month since October 2025, the firm said. This signals a “less-than-optimistic” outlook for the year, Chief Revenue Officer Andy Challenger said in a statement. Employers also announced the lowest total job openings for January since 2009 when Challenger started tracking hiring plans. This could erode consumer spending this year, with Moody’s analysts noting the dependence on relatively stable wages and employment . Larger-than-usual tax refunds could lift spending at some point but “the long game still depends on the labor market,” Bank of America Institute analysts said earlier this month.",
      "cover_image_url": "https://imgproxy.divecdn.com/jyN-sQUF83ublZCNP-7H7QzLcn5yQn5qA2Xi0GnMx7k/g:nowe:234:2/c:841:475/rs:fit:770:435/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9TY3JlZW5zaG90XzIwMjUtMDUtMDJfMTEzNzM4LnBuZw==.webp"
    }
  ]
}