{
  "industry": "foreign_trade",
  "collected_at": "2026-02-07T12:09:09.772953+00:00",
  "hours": 24,
  "limit": 25,
  "count": 16,
  "items": [
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "ACT Expo 2026 embraces the digital frontier for commercial fleets",
      "url": "https://www.freightwaves.com/news/act-expo-2026",
      "published": "2026-02-06T23:15:11+00:00",
      "summary": "<p>Connected vehicles, ADAS safety tech, autonomous advancements and software-defined vehicles drive innovation</p> <p>The post <a href=\"https://www.freightwaves.com/news/act-expo-2026\">ACT Expo 2026 embraces the digital frontier for commercial fleets</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "ACT Expo 2026 is shaping up to be the most comprehensive show in the event’s 16-year history. The transportation expo, held this year in Las Vegas, brings nearly 400 speakers, over 200 vehicles on display and in the Ride & Drive, and typically over 12,000 attendees. This year’s conference highlights a commercial transportation industry in the throes of technological transformation—and wrestling with what to do about it. Beyond the sheer scale of the event, there’s also an expansion of what attendees will find on the show floor. Emerging green technologies will still be there, but ACT Expo will showcase the digital technology layer that sits on top of advanced vehicle platforms. This focus will make the show useful to any fleet that needs pragmatic advice about measurable returns of new technologies taking hold in the market. Erik Neandross, president of Clean Transportation Solutions at TRC, and host of ACT Expo told FreightWaves in an interview that the event reflects a maturation of the industry’s approach to emerging technologies. As always at ACT Expo, fleet presentations on their experiences with new technology deployments will be a cornerstone of the conference. That real-world experience provides more insight than a showcase of innovation. “There’s no end to the technology choices, fuel options and drivetrain options available to commercial operators,” Neandross said. “But the key is what really makes sense for them from a financial perspective. Where can fleets expect to achieve equivalent or improved Total Cost of Ownership (TCO) and thus, a return on their investment in a given period of time?” That question—where the value actually lies for fleet operators—will drive much of the conversation at this year’s event. The Digital Frontier Expands to Fleets A big focus of ACT Expo 2026 is what Neandross calls “the digital frontier”—a catch-all term encompassing software-defined vehicles (SDVs), real-time data analytics, artificial intelligence (AI) in fleet management, the growing role of predictive maintenance, and a lot more. “Last year we explored software-defined vehicles, which was kind of a new topic, and we will see continued progress in this area this year,” Neandross said. “While the digital frontier can be all-encompassing and overwhelming to fleets, especially given how loosely the term ‘AI’ is thrown around these days, when a customer is able to make the right technology selections to fit their application and operation, we have seen fleets reporting significant improvements in uptime, asset utilization and productivity, the driver experience, and safety. There is real value here, but it’s important for fleets to understand the landscape of the digital frontier and make the right selections in terms of technology and partners.” Another big focus of ACT Expo 2026 will be driver assist technologies and autonomous vehicle (AV) commercialization. The conference will feature a main stage panel with leading figures in the autonomous space including Aurora, Kodiak, Waabi, Torc, and PlusAI. These industry leaders will be discussing where the technology stands as it moves beyond pilot demonstrations and into a commercialization phase. A key focus will be identifying where and how the technology best fits into a fleet’s operation, and ultimately, how to achieve the right ROI on the investment. “Regardless of the product we’re talking about, ACT Expo has always served the market to showcase technologies moving from the R&D and pilot phases and into the commercialization phase,” Neandross explained. “Between the conference sessions and technology on the show floor, the event highlights how the industry will scale a technology from a handful of units, to dozens to then hundreds or thousands on the road.” As part of this advanced digital transformation – which includes driver assist and autonomous technologies, the use of AI, and a lot more – safety is an area of focus that is gaining a lot more attention from fleets. “That’s something we heard loud and clear last year,” he said. “In all of the conversations we were having about digital or autonomy, I just kept hearing safety, safety, safety.” For an event historically focused on clean technology and alternative powertrains, the emphasis on safety represents a notable addition. The driving forces aren’t mysterious; nuclear verdicts in trucking litigation have become almost routine headlines, and fleets are looking for every available tool to protect themselves, improve driver and vehicle safety, increase uptime and reduce costs. Advanced Driver Assistance Systems (ADAS) are at the center of this conversation. Lane-keeping technology, collision avoidance systems, automatic braking, and camera systems—both inside and outside the cab—are increasingly working together to create safer vehicles. The economic benefits extend well beyond avoiding crashes. Neandross outlined a cascade of advantages for fleets that invest in safety technology: improved driver retention, reduced downtime and lower repair costs (the vehicle spends less time in the shop), happier customers (deliveries arrive as scheduled), reduced legal and public image liability, improved Compliance, Safety, Accountability (CSA) scores (which attract more business), and better insurance outcomes. “Fleets that operate more safely have better CSA scores, which they can then use to better retain existing customers, attract more customers, and develop longer-term, more robust relationships,” he said. “You’re avoiding litigation, lawsuits, nuclear verdicts, all those sorts of things. And then ultimately, we also see it helping with fleets having better access to insurance coverage options, and lower insurance costs.” The challenge lies in quantifying these benefits. Unlike a 3% efficiency improvement from an aerodynamic package, the return on investment (ROI) for safety technology involves variables like mitigated repair costs and insurance savings that don’t fit neatly into traditional total cost of ownership (TCO) models. “Those are things that are not necessarily easy to put into a TCO model,” Neandross acknowledged. “But they matter, they’re important, and the economic value is there. The challenge, and opportunity for us, is to help illustrate the business case for fleet safety investments, which will be a key area of focus for ACT Expo this year as fleet presenters will highlight their experiences with these technologies and their return on investment.” 2026 Brings an EV Reality Check When asked about the state of commercial electric vehicles heading into ACT Expo 2026, Neandross noted that the event will take this topic head-on. “Clearly the interest level in EVs is a bit reduced from frenzied pitch we saw a couple of years ago,” he noted. “The changes and removal of several EV-forcing regulations in California and other states, along with reductions in federal funding support for EVs and charging infrastructure are having an impact on the market.” However, he pointed to data showing consistent growth in commercial battery-electric vehicle deployments. “When you look at the data, that always tells the real story,” Neandross said. Market figures show commercial EV deployments rising year over year, from about 800 in 2021, to 13,500 in 2022, 26,000 in 2023, and more than 41,000 battery-electric commercial vehicles deployed in 2024, according to the 2025 edition of State of Sustainable Fleets . While many projected higher growth rates based upon the regulatory environment that previously existed, the industry is clearly maturing and has been roughly doubling year-over-year. Much of this growth has occurred in the cargo van segment, driven by Rivian’s partnership with Amazon. Rivian’s CEO RJ Scaringe will deliver a keynote address at the conference. The company committed to putting 100,000 electric delivery vehicles on the road, and that program is well underway. In the heavy-duty segment, Tesla’s Semi program appears ready to drive significant growth in the Class 8 battery electric truck market, alongside OEMs like Volvo Trucks and Daimler Truck which have significant deployed fleets. Tesla recently announced a partnership with Pilot to install charging infrastructure across five states, and its Semi production facility is expected to begin commercial production in the coming months, poised to again shake up the market as this product begins to roll out to customers. “As pricing decreases and a product’s operational capability improves, the EV business case becomes increasingly more attractive, even without incentives or regulations,” Neandross said. “As customers see the ROI on technology that meets their operational needs, and financial and environmental goals, we are going to see the needle really start to move in these applications. This, in turn, drives increased competition in the marketplace, which then further benefits the customers with improved products and lower prices.” Gaseous Fuels, Alternative Powertrains and Clean Diesel In addition to the attention paid to digital tech and electrification, ACT Expo 2026 will feature substantial programming on gaseous fuels—natural gas vehicles (NGVs), liquefied petroleum gas (LPG) and hydrogen—where significant activity continues. Cummins has provided strong updates over the past year on its X15N natural gas engine product, with more deployments generating real-world data which prove the use-case, operational feasibility and ROI. “Natural gas is one of the technologies that’s a great example of what we’re talking about—there’s real TCO there,” Neandross said. “In the right application, with the right project team and approach, we have seen tremendously positive economic outcomes for a customer. As one large over-the-road fleet once told me, ‘these things print money.’ ” Clean and advanced diesel technology will also be given significant attention at this year’s ACT Expo, driven in part by the finalization of Environmental Protection Agency (EPA) 2027 emissions standards. “The OEMs are excited to talk about EPA 2027 compliant engine solutions they are bringing to market, as we all prepare for those federal standards to take effect,” Neandross said. “There is new technology that fleets need to know about, and increased costs, but some real benefits to these new engines. In addition to the technology aspect, we’re seeing more use of renewable diesel, B100, those sorts of things; so we’ll have a lot of coverage on diesel.” Sessions will examine fuel efficiency and reliability improvements across advanced powertrains, along with how fuel management technologies and hybrid systems are improving uptime and reducing costs for diesel fleets. Professional Development Opportunities Another big addition to this year’s ACT Expo will be the introduction of a continuing education certification program. More than 25 sessions have been approved by the NAFA Fleet Management Association for Continuing Professional Education hours applicable toward Certified Automotive Fleet Manager (CAFM) recertification. Additionally, Green Business Certification Inc. (GBCI) has also confirmed that 10 ACT Expo workshops meet its criteria for general continuing education hours. “Given the massive array of technology that’s out there these days and all the different varieties—from the clean diesel to the gaseous fuels to the electric drive to everything digital overlaying all of the powertrain and fuel technologies—there’s just a ton going on,” Neandross said. “We’ve been talking about these continuing education credits for a couple of years, and the team was able to make it happen this year. It’s exciting because attendees can return home with stronger credentials and knowledge they can apply to their job right away. It provides even more value for fleets attending the event this year.” The workshop programming spans practical applications of artificial intelligence and software-defined vehicles, automation and advanced safety systems, EV charging strategies and grid integration, alternative fuel pathways, cleaner combustion and vehicle efficiency, and market dynamics shaping fleet investment decisions. “We realize fleets are pressed—frankly, everyone’s pressed—for time and budget,” Neandross said. “Our agenda puts people in a position to maximize their time and learn which new technologies will have the biggest impact on their financial returns and operational success. That’s what will allow for further investments in these advanced technologies, and what will ultimately make the industry stronger.” To learn more, visit www.actexpo.com .",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/ACT_EXPO_Image_cropped.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Paladin Capital files for Chapter 11 as trucking portfolio unravels",
      "url": "https://www.freightwaves.com/news/paladin-capital-files-for-chapter-11-as-trucking-portfolio-unravels",
      "published": "2026-02-06T22:43:01+00:00",
      "summary": "<p>Paladin Capital’s Chapter 11 filing ties together recent truck carrier shutdowns at Robert Bearden Inc. and Quickway Transportation.</p> <p>The post <a href=\"https://www.freightwaves.com/news/paladin-capital-files-for-chapter-11-as-trucking-portfolio-unravels\">Paladin Capital files for Chapter 11 as trucking portfolio unravels</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Paladin Capital Inc., a Tennessee-based private equity firm that owns multiple trucking and logistics companies, has filed for Chapter 11 bankruptcy protection, impacting hundreds of truck drivers, mechanics and logistics industry workers. Paladin Capital filed its voluntary Chapter 11 petition on Jan. 26 in the U.S. Bankruptcy Court for the Middle District of Tennessee, listing between $10 million and $50 million in assets and between $100 million and $500 million in liabilities, according to court records. Paladin Capital is headquartered in Brentwood, Tennessee, and operates as the ultimate parent of a sprawling trucking and logistics platform. Court filings show Paladin Capital owns 100% equity interests in more than 20 operating subsidiaries, including Robert Bearden Inc. and the Quickway family of companies. Those two carriers have each filed separate Chapter 11 petitions in recent weeks amid operational shutdowns, driver layoffs and equipment returns, as FreightWaves previously reported. In filings outlining the events leading to bankruptcy, Paladin Capital cited prolonged freight market weakness, rising insurance and equipment costs, and liquidity pressures tied to its lending arrangements. The company said it defaulted under a credit facility with Truist Bank after insurers drew on letters of credit tied to accident claims, draining cash needed to service equipment leases. As a result, Paladin Capital said it has been unable to make payments to major equipment lenders since mid-2025. The filing also shows that Robert Bearden Inc. was a significant cash drain within the portfolio prior to the Chapter 11 filing, according to Paladin’s restructuring documents. The firm said it attempted to negotiate a workout with lenders but ultimately filed for bankruptcy protection to prevent widespread equipment repossessions and preserve remaining operations. Paladin Capital reported employing approximately 912 workers across its portfolio at the time of the filing, including more than 150 employees at Robert Bearden Inc. and nearly 500 workers tied to the Quickway entities. The company said it plans to pursue Section 363 sales of individual business units rather than a single sale of the entire platform. The Paladin Capital bankruptcy adds to a growing list of private equity-backed trucking platforms seeking court protection as the prolonged freight downturn continues to pressure highly leveraged carriers.",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/092323-2957-1.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Increased Amazon flight activity boosts Sun Country cargo revenue",
      "url": "https://www.freightwaves.com/news/increased-amazon-flight-activity-boots-sun-country-cargo-revenue",
      "published": "2026-02-06T21:33:49+00:00",
      "summary": "<p>Sun Country Airlines generated record cargo revenue last quarter as its Amazon flying business took off. </p> <p>The post <a href=\"https://www.freightwaves.com/news/increased-amazon-flight-activity-boots-sun-country-cargo-revenue\">Increased Amazon flight activity boosts Sun Country cargo revenue</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Sun Country Airlines on Thursday reported record cargo revenue of $48 million for the fourth quarter primarily driven by the addition of eight freighter aircraft last year under its transportation service agreement with Amazon. Cargo has become an increasingly important prong in the Minneapolis-based carrier’s diversified business model — it is best known for passenger service to leisure destinations and also operates charter flights. It agreed last month to be sold to Allegiant ( NASDAQ: ALGT ), another passenger airline that mostly serves secondary markets. Allegiant has said it welcomes the Amazon business . Cargo revenue increased 68% year over year behind 50.6% growth in flight hours. Sun Country ( NASDAQ: SCNY ) has operated a dozen Boeing 737-800 converted freighters in Amazon’s network for six years. Last year, Amazon transferred eight more aircraft from another vendor to Sun Country. Full-year cargo revenue jumped 44.6% to $155 million. The carrier reiterated that it plans to add two freighters, supplied by Amazon, bringing the fleet to 22 cargo aircraft. The new planes are expected to be operational in July. One of the new freighters will be utilized as a spare to ensure schedule reliability for Amazon, according to the earnings report. A new operations base at Cincinnati/Northern Kentucky International Airport, where Amazon’s North America super hub is located, is scheduled to open this month. Management said it will help improve efficiency for the Amazon operation. Sun Country currently shares facilities with other carriers. Overall, Sun Country generated $281 million in revenue, up 7.9% year over year and its fourteenth consecutive profitable quarter, although net income dropped nearly 40% to $8.1 million. The Allegiant transaction is expected to close in the second half, subject to shareholder and regulatory approvals. Click here for more FreightWaves/American Shipper stories by Eric Kulisch. Allegiant to absorb Sun Country’s Amazon business Alaska Airlines dissatisfied with Amazon cargo contract, executive says",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/Amazon-Sun-Country-737s_1.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "EXCLUSIVE: BlackRock could bid for largest New York container terminal",
      "url": "https://www.freightwaves.com/news/exclusive-blackrock-could-bid-for-largest-new-york-container-terminal",
      "published": "2026-02-06T19:34:16+00:00",
      "summary": "<p>The world’s largest asset manager could back an effort by the world’s biggest container line to buy the busiest container terminal at the leading U.S. East Coast port.</p> <p>The post <a href=\"https://www.freightwaves.com/news/exclusive-blackrock-could-bid-for-largest-new-york-container-terminal\">EXCLUSIVE: BlackRock could bid for largest New York container terminal</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "In a case of terminal superlatives, the world’s largest asset manager could back a bid by the world’s biggest container line to buy the busiest container terminal at the top U.S. East Coast port. BlackRock, the New York-based investment manager, could partner with Mediterranean Shipping Co. to purchase Maher Terminals, which handles more than a third of all box traffic moving through the Port of New York-New Jersey, sources told FreightWaves. The Port Authority of New York and New Jersey recently signed a 33-year lease extension through 2063 with Macquarie Group, the Australian investor that acquired a controlling interest in Maher from Deutsche Bank in 2016 through its Macquarie Asset Management unit. An agency spokesman referred questions to Macquarie, which also owns Long Beach Container Terminal (LBCT) in California. Maher processed more than 3 million twenty foot equivalent units (TEUs) of New York’s total 8.7 million TEUs in 2024, making it the busiest terminal at the port complex. GCT, one of the other four terminals in New York-New Jersey and about half the size of Maher, was sold to CMA CGM for $3 billion in 2023. An executive with knowledge of the prospective deal said that the lease extension spurred interest from prospective buyers, including private infrastructure fund managers. The executive added that the sale process is not yet underway and no timeline has been established. Macquarie’s stake in Maher is through private infrastructure fund Macquarie Infrastructure Partners III, managed by Macquarie Asset Management. The sale of Maher and other investments coincides with the end of the fund’s term in 2030. The Maher sale won’t affect Macquarie-owned LBCT, International Transportation Service in Long Beach, and TraPac at the Port of Los Angeles. The Maher sale was first reported by the Wall Street Journal. Ocean carrier Hapag-Lloyd of Germany ( HLAG.DE ), and terminal operators PSA International of Singapore and Dubai’s DP World are reportedly interested in Maher, the only New York terminal not controlled by ocean carriers. BlackRock (NYSE: BLK ), with $11-$12 trillion under management, emerged as a factor in global maritime infrastructure in 2025 when it teamed with MSC’s Terminal Investment Limited to buy most of the terminals business of Hong Kong’s CK Hutchison ( 0001.HK ) for $23 billion. Beijing later blocked the deal which included terminals at the Panama Canal, demanding a controlling stake for state-owned carrier Cosco ( 1919.HK ). A BlackRock spokesman said the company had no comment on the Maher report, or the Hutchison deal. Media-shy MSC is controlled by the Aponte family out of Geneva, led by founder and chairman Gianluigi Aponte. The octogenarian has been on a spending spree fueled by a reported $75 billion cash reserve, including recent orders for six new cruise ships worth $16 billion, as well as new and second-hand container vessels totaling 2 million TEUs. The company is also constructing a new container terminal at the Port of Baltimore. FreightWaves has reached out to the companies in this article for comment. This article was update Feb. 6 to clarify that a sale of Maher would start at $3 billion, and delete a reference to NYK’s ownership stake. Find more articles by Stuart Chirls here . Related coverage: Maersk posts Q4 pre-tax loss, will cut 1,000 jobs Panama targeted Canal ports contract, China company claims Carriers say military to secure Red Sea voyages Leaner inventories weaken ocean demand, a harbinger for higher tender rejections, increased truck rates",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/maherSCfoto20240930_115722-copy_cropped_processed_by_imagy.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "How St. Christopher Fund supports drivers beyond emergencies and its record-breaking support from TravelCenters of America",
      "url": "https://www.freightwaves.com/news/how-st-christopher-fund-supports-drivers-beyond-emergencies-and-its-record-breaking-support-from-travelcenters-of-america",
      "published": "2026-02-06T19:26:33+00:00",
      "summary": "<p>TravelCenters of America’s (TA) most recent charity golf tournament did more than set a fundraising record. It showed that industry support for driver health and hardship relief is not only growing, but becoming more intentional. The tournament raised more than $100,000 for the St. Christopher Truckers Relief Fund, the largest single-year contribution since the partnership [&#8230;]</p> <p>The post <a href=\"https://www.freightwaves.com/news/how-st-christopher-fund-supports-drivers-beyond-emergencies-and-its-record-breaking-support-from-travelcenters-of-america\">How St. Christopher Fund supports drivers beyond emergencies and its record-breaking support from TravelCenters of America</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "TravelCenters of America’s (TA) most recent charity golf tournament did more than set a fundraising record. It showed that industry support for driver health and hardship relief is not only growing, but becoming more intentional. The tournament raised more than $100,000 for the St. Christopher Truckers Relief Fund , the largest single-year contribution since the partnership between TA and SCF began in 2017. For Courtney Niemann, executive director of SCF, the milestone is meaningful precisely because it wasn’t expected. “We weren’t anticipating a record-breaking year,” Niemann said. “It speaks to how many people genuinely want to support drivers in any way they can. Someone got a good golf game out of it, and drivers got support when they needed it most.” The balance of community engagement and tangible impact has defined TA’s relationship with SCF over the past several years. What began as a charitable partnership has evolved into a deeper alignment around driver well-being, with TA leaders and board members actively involved in supporting the organization’s mission. Niemann said. “That kind of sustained involvement shows a growing awareness across the industry that driver health can’t be treated as an afterthought.” For SCF, the funding directly strengthens a safety net designed specifically for over-the-road drivers who are sidelined by illness or injury. The nonprofit provides short-term financial assistance to drivers who have been taken off the road within the past 365 days, helping cover household expenses while they navigate recovery and, in many cases, the gap before other benefits begin. Beyond emergency financial relief, SCF has increasingly invested in prevention and wellness programs aimed at addressing the long-term health challenges drivers face. The organization now operates five core prevention initiatives, including Rigs Without Cigs for nicotine cessation, vaccine vouchers for flu, COVID, pneumonia, shingles and other immunizations, diabetes prevention, chronic disease management through its Long Haul program, and at-home cancer screening for prostate and colon cancer, with cervical cancer screening for women set to launch soon. “Drivers are still facing many of the same challenges we’ve seen for years,” Niemann said. “They’re on the road, they don’t always have a primary care provider, and when something comes up, they can’t easily make an appointment.” That reality is compounded by the sedentary nature of the job and the difficulty of prioritizing rest, nutrition and movement while running long-haul schedules. According to Niemann, shifting that mindset, both individually and across the industry, is critical. “We’re here for drivers who are over the road four days or more, whether they’re independent contractors or company drivers,” she said. “Sometimes we can offer programs or support that a company may not be able to. Our goal is to remove barriers and meet drivers where they are.” Record contributions also give SCF room to plan beyond immediate needs. Niemann said the organization is looking at internal growth as well as expanded community engagement, including upcoming fundraising efforts like its auction at the Mid-America Trucking Show and a virtual walk in May . “Being able to say we might have the opportunity to hire more staff, grow programs, and give more money to those in need — that’s huge,” Niemann said. For Niemann, what stands out most about TA’s record-breaking donation isn’t just the amount, but what it represents within the broader trucking ecosystem. “When larger corporations support smaller nonprofits, it matters,” she said. “Drivers are the backbone of America. They move everything we have. When organizations step up and say, ‘This is a cause we trust,’ it strengthens the entire community.”",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/SCF2.6-1200x675.png"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Shares of Hub Group tank on accounting error",
      "url": "https://www.freightwaves.com/news/shares-of-hub-group-tank-on-accounting-error",
      "published": "2026-02-06T18:45:09+00:00",
      "summary": "<p>An accounting error at Hub Group has placed its financial statements for the first three quarters of 2025 under review.</p> <p>The post <a href=\"https://www.freightwaves.com/news/shares-of-hub-group-tank-on-accounting-error\">Shares of Hub Group tank on accounting error</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Shares of Hub Group were off 19% in midday trading on Friday after the company flagged a $77 million understatement in purchased transportation expenses. It said the accounting error occurred in the first three quarters of 2025 and that its financial statements are under review. It has delayed fourth-quarter and full-year reporting until the matter can be resolved. “Based on its analysis to date, the Company estimates the correction of the error will increase purchased transportation and warehousing costs for the nine months ended September 30, 2025, but cannot yet estimate what the resulting increase to purchased transportation and warehousing costs and accounts payable will be,” a news release said. Hub Group ( NASDAQ: HUBG ) said it plans to restate financials for the first three quarters of 2025 and will “assess the potential impact” to 2024 and 2023 results. The company does not expect any impact to its cash position or operating cash flows, which it said totaled $194 million in 2025. A fourth-quarter update issued on Thursday after the market closed only provided select financial results for the period. Hub Group hosted a pre-recorded call discussing preliminary results and said updated results will be available “as soon as practicable.” “Accuracy and transparency in reporting on our performance is of the utmost importance at Hub Group,” said President, CEO and Vice Chairman Phil Yeager. “We look forward to reporting our full financial results as soon as possible and are enhancing our processes. Our team continues to focus on serving our customers with innovative solutions and services.” Following the announcement, some industry analysts downgraded Hub Group’s stock, and others worked to estimate the total impact. Deutsche Bank ( NYSE: DB ) analyst Richa Harnain said the understated expenses could represent roughly 300 basis points of degradation to the company’s already depressed operating margin. “This figure represents 2.8% of revenue or over 65% of HUBG’s EBIT [earnings before interest and taxes],” Harnain said in a Friday note to clients. “In other words, after fully adjusting for this cost, the company’s adjusted operating margins for the first nine months of 2025 would appear to have been 1.4%, significantly lower than the 4.4% originally reported.” She said there could be other offsets and that the restatement may not be as bad as feared, “therefore implying the margin headwind could be smaller.” Preliminary Q4 results Intermodal and Transportation Solutions revenue “declined slightly” year over year in the fourth quarter. Intermodal volumes were up 1% y/y with revenue per load coming in flat. Intermodal loads were off 4% y/y in January. January volumes were negatively impacted by winter storms. The month was also up against a difficult comp to January 2025, when “shippers pulled forward orders ahead of tariffs.” Dedicated revenue was down in the fourth quarter. Brokerage volumes were down 10% y/y with revenue per load off 4%. Hub Group said full-year 2025 revenue was approximately $3.7 billion, a 7% y/y decline. It guided 2026 revenue to a range of $3.65 billon to $3.95 billion, which bracketed the $3.77 billion consensus estimate. Securities law firm, Bleichmar Fonti & Auld LLP, announced it has launched an investigation to see if the company “violated the federal securities laws by making false and misleading statements to investors.” More FreightWaves articles by Todd Maiden:",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/green-Hub-Group-intermodal-containers-on-a-BNSF-wellcar-1200x675.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Arrive Logistics trims Toronto headcount as it retools Canadian operations",
      "url": "https://www.freightwaves.com/news/arrive-logistics-trims-toronto-headcount-as-it-retools-canadian-operations",
      "published": "2026-02-06T17:48:23+00:00",
      "summary": "<p>Arrive Logistics trimmed its staff at its Toronto office as part of a strategic retooling of its Canadian operations.</p> <p>The post <a href=\"https://www.freightwaves.com/news/arrive-logistics-trims-toronto-headcount-as-it-retools-canadian-operations\">Arrive Logistics trims Toronto headcount as it retools Canadian operations</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Arrive Logistics has laid off five employees from its Toronto office as it reconfigures how the brokerage supports customers and carriers in Canada. Evan Pundyk, the company’s vice president of marketing, told FreightWaves the staffing reduction followed a review of Arrive’s broader strategy and represents “a very small portion” of the company’s workforce of more than 2,000 employees. “Following a review of the Arrive group’s strategy, we have retooled our Toronto office to support ongoing client interaction,” Pundyk said in an emailed statement. The company declined to provide additional detail on how the Toronto office functions today compared with its original launch, but emphasized that it continues to maintain a physical presence in the city and remains committed to the Canadian market. “Arrive remains focused on delivering industry-leading service at scale for thousands of shippers and carriers across North America,” Pundyk said. “Putting customers, carriers, and employees first and incrementally improving every day is our playbook.” Founded in 2014, Arrive Logistics is a multimodal transportation and technology platform with over 1,700 employees, 4,000 customers and 40,000 carriers in its network. In addition to Toronto, the company also has a location in Guadalajara, Mexico; along with five offices across the U.S. Arrive opened its Toronto office in October 2023, framing the expansion as a way to establish “boots on the ground” across North America and better serve Canadian shippers and carriers as nearshoring trends reshaped freight flows. At the time, company executives described Canada as a growth market complementary to Arrive’s U.S. and Mexico operations. Despite the staffing changes, Arrive said its Canadian business has continued to expand. According to Pundyk, Arrive achieved 26% volume growth in 2025 while remaining profitable, and its cross-border Canada business grew nearly 20% year over year. The company projects that segment will grow an additional 40% in 2026. Canada is the second largest U.S. trading partner, with trade totaling $53.7 billion in November, according to the latest Census Bureau data.",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/Arrive-Logistics_Toronto.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Another tough quarter so RXO emphasizes its AI tools, spot market growth",
      "url": "https://www.freightwaves.com/news/another-tough-quarter-so-rxo-emphasizes-its-ai-tools-spot-market-growth",
      "published": "2026-02-06T17:41:16+00:00",
      "summary": "<p>RXO’s fourth quarter was tough but it is focusing on a longer-term message.</p> <p>The post <a href=\"https://www.freightwaves.com/news/another-tough-quarter-so-rxo-emphasizes-its-ai-tools-spot-market-growth\">Another tough quarter so RXO emphasizes its AI tools, spot market growth</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "With a fourth quarter earnings report and subsequent call with analysts that was as negative as anticipated, RXO took the approach in its public-facing actions that it would seek to highlight what is getting better. In its prepared released disclosed late Thursday, in an interview with FreightWaves and on its quarterly conference call, RXO (NYSE: RXO) management tried to shift the focus away from another quarter with lower EBITDA and another net loss and instead look at changes in its own structure to say it is well positioned to benefit from a turnaround in the freight market. That broader freight market strengthening is well underway. But for a broker, the early stages of that are not good news. Spot rates rise, contract rates are stuck where they were negotiated, and the squeeze is on. Drew Wilkerson, RXO CEO, summed up the market situation for brokers in his opening remarks on the conference call. “In December, rates increased by about 15% month over month, much faster than our contractual sale rates,” he said. “At the same time, demand remains off with not enough spot loads to offset the rise of purchased transportation costs.” Wilkerson said the strength of the market was visible in the “waterfall” of freight going through routing guides, “where it’s making past the second, third and fourth carrier.” The strength of the spot market is most visible in the SONAR Outbound Tender Rejection Index, which has soared in recent weeks. Jared Weisfeld, the company’s chief strategy officer, told FreightWaves in a pre-earnings call interview that RXO “did see spot loads increase sequentially slightly from the third quarter to the fourth quarter and then increase again in January.” “If this persists in a better demand environment, you are going to see spot start to increase pretty significantly as a percentage of the mix,” he added. But in setting its outlook for the first quarter, with a projected EBITDA less than in the fourth quarter, CFO Jamie Harris suggested the growth wasn’t enough to move the needle on the bottom line. “Within our brokerage business, we’re not assuming a meaningful increase in either spot opportunities or sale rates in the first quarter,” he said on the earnings call. Pushing the AI story A major challenge for RXO has been convincing investors who have pushed down the company’s stock by about 25% in the last year that like C.H. Robinson, RXO is using AI to vastly improve profitability. The message relentlessly pushed by C.H. Robinson (NASDAQ: CHRW) has been consistent enough that the company’s stock, up more than 100% in the last year, has been described as much of an AI stock play as it is a logistics exposure. Weisfeld took on the challenge in the company’s earnings call, saying the RXO AI results in the quarter were “transformational” that “(drive) improvements across four key pillars: volume, margin, productivity and service.” He rattled off several of the areas where he said RXO has been using AI to improve performance. A new “proprietary AI spot agent will unlock an incremental market opportunity,” he said. There are “improvements in our pricing engine and in the quarter we extended pricing tools for the RXO platform.” RXO automated “thousands of training updates” through an AI tool and “delivered generative AI tickets to support customer sales and operations.” Theft prevention was aided by an “identity AI solution,” Weisfeld said. Cutback in employees Part of the C.H. Robinson success story with analysts is that it has continued to grow its business while using AI to see a reduction in its workforce. C.H. Robinson’s quarterly earnings disclose the number of total employees at the company as well as a breakout of its brokerage operation, North American Surface Transportation. While RXO does not match that level of transparency, Wilkerson said on the call that brokerage headcount at the company had declined by a mid-teens percentage in the last 12 months while achieving a 19% increase in productivity. Productivity at brokerages is generally measured by volume or transactions per employee. “Our streamlined operations will provide us with substantial operating leverage,” Wilkerson said. Another key point RXO management noted in its prepared statements and on the earnings call is that what it said was its “late stage” brokerage sales pipeline was up more than 50% year over year, “strong momentum as we start 2026,” Wilkerson said. “While bid season is not yet complete, we’ve seen some early wins,” Wilkerson said on the call. “The strength and makeup of our pipeline gives us confidence that we will resume truckload volume outperformance as early as the middle of this year.” Truckload was a weak point for RXO in the quarter, particularly in comparison to growth in LTL. Truckload volume was down 12% year over year, and Weisfeld said it represented 74% of brokerage volume. But he said truckload volume had increased 500 basis points sequentially from the third quarter. Weisfeld, in his interview with FreightWaves, said the growth of the LTL business at RXO–up 31% year-on-year–in contrast to the weakness in truckload because “a lot truckload customers come to use because LTL is such a pain point for them in terms of that freight, when you think about claims and damages, so let RXO be your easy button.” Wall Street reaction While RXO stock Friday morning declined at first in reaction to the report, it shifted higher later. RXO’s stock was up more than 1% at approximately 11:20 a.m., to $16.75. It is down about 19.7% in the last year. It traded as high Friday as $17.40. A report from Deutsche Bank’s transportation team noted that the 130 basis point decline in RXO’s gross margins was better than the brokerage segments at J.B Hunt (NASDAQ: JBHT) and Knight Swift, (NYSE: KNX) , which reported declines in their brokerage gross margins of about 500 and 200 points, respectively. Deutsche also noted that the net loss of 7 cents per share was worse than the consensus forecast of 4 cents per share. More articles by John Kingston Werner settlement ready to go in drivers’ lawsuit that dates to 2014 Amazon’s LTL offering reaching out to shippers as possible customers: report NFI’s Brown, others win another round in dismissed New Jersey indictment",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/rxo-5.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "FMCSA taking comments on industry-wide ELD exemption",
      "url": "https://www.freightwaves.com/news/fmcsa-taking-comments-on-industry-wide-eld-exemption",
      "published": "2026-02-06T17:34:33+00:00",
      "summary": "<p>Federal regulators are weighing a proposal to allow drivers to ditch ELDs for paper logs, potentially ending the digital mandate for small carriers.</p> <p>The post <a href=\"https://www.freightwaves.com/news/fmcsa-taking-comments-on-industry-wide-eld-exemption\">FMCSA taking comments on industry-wide ELD exemption</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "WASHINGTON — The Federal Motor Carrier Safety Administration is opening the floor for public comment on an exemption request which, if approved, would fundamentally change how truck drivers track their time behind the wheel. The Federation of Professional Truckers (FOPT) is seeking a broad exemption from current electronic logging device (ELD) requirements, arguing that professional drivers should have the right to choose manual paper logs over digital tracking. The law currently allows manual logs only for drivers who use them eight days or fewer in a 30-day period, or those operating engines manufactured before the year 2000. The exemption would remove those barriers by allowing any driver or motor carrier – not just FOPT members – the option of using a manual paper logbook for their records of duty requirement. “Paper logbooks remain enforceable and understood by enforcement officers nationwide,” wrote Micheal Cobb, CEO of FOPT, a non-profit advocacy group based in Ohio, in their petition to FMCSA . “Small carriers face disproportionate financial burdens from ELD requirements, as compliance costs exceed $500 annually per truck according to FMCSA’s Regulatory Impact Analysis. Technical limitations and frequent malfunctions highlight the continued necessity of paper alternatives.” They cited an executive order (E.O. 12866) that requires agencies to avoid unnecessary regulations when there are “reasonable” alternatives. “Allowing drivers to use either method ensures compliance without undermining safety,” they asserted. To address safety concerns, FOPT included a “Safety Assurance Plan” in its request: FOPT will educate members on proper paper log completion. Random internal audits will be conducted by carriers. Violations of HOS will result in exclusion from exemption program. Success in question The success of the petition may hinge on whether FOPT can convince FMCSA that their “equivalent level of safety” – through education and internal audits – is as reliable as the digital systems the Trump administration is currently working to secure. While the administration’s “pro-trucker” initiatives – such as shutting down speed limiter proposals and new restrictions on foreign-drivers – show a desire to help owner-operators, the recent focus on data-driven enforcement may make them hesitant to lose the digital visibility ELDs provide. FMCSA also recently began tightening its vetting of approved ELDs , cracking down on fraud and removing dozens of non-compliant devices from the market – which may suggest the administration prefers fixing the technology over loosening restrictions. The agency is accepting comments on the petition through March 11. Related articles Click for more FreightWaves articles by John Gallagher.",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/Leland-HOS-credit-JAFW-scaled.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Werner Enterprises restructuring one-way fleet",
      "url": "https://www.freightwaves.com/news/werner-enterprises-restructuring-one-way-fleet",
      "published": "2026-02-06T16:17:38+00:00",
      "summary": "<p>Werner Enterprises is taking steps to restore its one-way unit to profitability by reducing the fleet size and eliminating unprofitable freight.</p> <p>The post <a href=\"https://www.freightwaves.com/news/werner-enterprises-restructuring-one-way-fleet\">Werner Enterprises restructuring one-way fleet</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Werner Enterprises announced it is restructuring its one-way truckload business in an effort to improve fleet utilization and return the unit to profitability. The changes are expected to be completed in the first quarter, but impacts on financial results may not be noticeable until the second quarter. The announcement was made in conjunction with the carrier’s fourth-quarter report released Thursday after the market closed. Werner ( NASDAQ: WERN ) reported a headline net loss of $27.8 million, or 46 cents per share, for the quarter. However, the number included $44.2 million in restructuring and impairment charges, the bulk of which were noncash. Excluding the charges and other one-off items, adjusted net income was $3.3 million, or 5 cents per share. That was 5 cents below the consensus estimate and 3 cents lower year over year. The company is transitioning its one-way business to more profitable services like expedited, cross-border, and long-haul delivery using driver teams. It is also looking for ways to better engage the unit with its power-only offering. Werner has begun exiting unprofitable regional and short-haul business, and it is continuing to further integrate past fleet acquisitions. The move comes as Werner is making a bigger push into dedicated trucking—a more defensible business model featuring multiyear contracts with shippers. Werner acquired dedicated carrier FirstFleet and its real estate last month in a $283 million deal. The transaction added over 2,400 tractors and $615 million in revenue, making Werner the fifth-largest dedicated provider in the U.S. The deal is expected to be immediately accretive to earnings and free cash flow. Table: Werner’s key performance indicators Q4 by the numbers; 2026 outlook Consolidated revenue of $738 million was 2% lower y/y and below the $761 million consensus estimate. Total TL revenue was down 3% y/y to $513 million. The segment reported a 97.2% adjusted operating ratio (inverse of operating margin), which was 30 basis points worse y/y. One-way revenue fell 8% y/y as average trucks in service declined 10% and revenue per truck per week was up 2%. Miles per truck per week improved 2% but revenue per total mile was off slightly. The one-way fleet topped out at nearly 3,300 tractors in 2022 but stood at less than 2,400 units in the recent quarter, a 28% decline. The company said that even after downsizing the one-way business, it still expects to be able to play in an improving spot market. Dedicated revenue increased 1% y/y as a 2% increase in the average truck count was partially offset by a 1% decline in revenue per truck per week. Chart: SONAR: National Truckload Index (linehaul only – NTIL.USA) for 2026 (blue shaded area), 2025 (yellow line), 2024 (green line) and 2023 (pink line) . The NTIL is based on an average of booked spot dry van loads from 250,000 lanes. The NTIL is a seven-day moving average of linehaul spot rates excluding fuel. Spot rates stepped higher through peak season as new constraints on the driver pool took hold. Severe winter weather amid a tighter capacity backdrop is keeping rates elevated in recent days. Werner issued guidance calling for one-way revenue per total mile to be flat to up 3% y/y in the first half of 2026. Revenue per truck per week in dedicated is expected to be down 1% to up 2% y/y in 2026. The guide assumes Werner will capture mid-single-digit contractual rate increases in one-way and low- to mid-single-digit increases in dedicated. Werner said there is a lag when implementing new contract rates and that efforts to extend length of haul in one-way will be a modest headwind to rate-per-mile results. Werner negotiates 25% of its bids in the first quarter and 33% in the second quarter. Shares of WERN were down 7.1% at 10:29 a.m. EST on Friday compared to the S&P 500, which was up 1.2%. The stock was up 64% from the week before Thanksgiving into the Thursday print. The move was largely in lockstep with a steep rise in tender rejections and spot rates. More FreightWaves articles by Todd Maiden:",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/a-closeup-of-a-white-Werner-tractor-pulling-a-trailer-near-an-underpass-on-a-highway-1200x675.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "UPDATE: Georgia-based carrier with 128 drivers files for Chapter 11 bankruptcy",
      "url": "https://www.freightwaves.com/news/georgia-based-carrier-with-128-drivers-files-for-chapter-11-bankruptcy",
      "published": "2026-02-06T15:20:32+00:00",
      "summary": "<p>Georgia-based regional carrier Robert Bearden Trucking has filed for Chapter 11 bankruptcy protection.</p> <p>The post <a href=\"https://www.freightwaves.com/news/georgia-based-carrier-with-128-drivers-files-for-chapter-11-bankruptcy\">UPDATE: Georgia-based carrier with 128 drivers files for Chapter 11 bankruptcy</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Robert Bearden Inc. was acquired by Paladin Capital Inc. in 2012. Paladin Capital has since filed for Chapter 11 bankruptcy protection on Jan. 26. Updated Feb. 6, 4:30 pm ET Robert Bearden Inc., a Southeast regional trucking carrier, has filed for Chapter 11 bankruptcy protection, according to court records. The Cairo, Georgia-based company filed its voluntary petition on Jan. 26 in the U.S. Bankruptcy Court for the Middle District of Tennessee, listing between 1 and 49 creditors. The debtor estimated both assets and liabilities in the range of $0 to $50,000 and indicated that funds may be available for distribution to unsecured creditors. As of early February, Federal Motor Carrier Safety Administration records listed the company with 143 power units and 128 drivers, and showed it maintained active interstate operating authority at the time of the bankruptcy filing. In a Facebook post circulating among trucking industry groups, a user identifying as a company driver said employees were informed that Robert Bearden Inc. had gone bankrupt and that drivers were being routed to Mobile, Alabama, and Valdosta, Georgia, to return trucks.",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/Robert_Bearden_Trucking2.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Feds went on-terminal for Indiana’s chameleon carrier crash-what happens next?",
      "url": "https://www.freightwaves.com/news/feds-went-on-terminal-for-indianas-chameleon-carrier-crash-what-happens-next",
      "published": "2026-02-06T15:17:35+00:00",
      "summary": "<p>The agency confirmed investigators visited the carrier linked to a deadly Indiana crash and a massive chameleon network. But the enforcement pathway matters more than the headline.</p> <p>The post <a href=\"https://www.freightwaves.com/news/feds-went-on-terminal-for-indianas-chameleon-carrier-crash-what-happens-next\">Feds went on-terminal for Indiana’s chameleon carrier crash—what happens next?</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "U.S. Transportation Secretary Sean Duffy confirmed that Federal Motor Carrier Safety Administration investigators were on-terminal at Sam Express yesterday, the Illinois-based carrier at the center of a sprawling chameleon carrier network I’ve been investigating for months, one linked to a crash in Jay County, Indiana, that killed four Amish men last year. That’s where the easy part of this story ends. What most people outside this industry don’t understand, what even a lot of people inside this industry don’t fully appreciate, is that the presence of federal investigators at a trucking terminal doesn’t mean what you think it means. It doesn’t automatically mean a raid. It doesn’t mean the carrier is shut down tomorrow. It doesn’t mean the government is dragging its feet if nothing visible happens next week. What it means depends entirely on how they got there, under what authority, and which agencies were involved. Understanding that distinction is the difference between informed advocacy and armchair quarterbacking. The Network We In The Private Sector Exposed For those just catching up, here’s the short version. Over the past several months, we’ve documented a network of interconnected carriers operating approximately 800 trucks out of shared terminal facilities in the Chicago metropolitan area. The network includes Sam Express Corp (USDOT 3235924), Tutash Express Inc (USDOT 3487141), KG Line Group (USDOT 3487333), AJ Partners LLC (USDOT 3617842), Altex Logistics, DVL Express, VIDMA, Tutash Express 1, Tutash Cargo LLC, and 1st Choice Logistics. The connections aren’t speculation. They’re documented through shared terminal addresses in South Holland, Markham, and Streamwood, Illinois. Sequential DOT registrations, Sam Express and Tutash Express received their DOT numbers on the same day in September 2020, with KG Line Group registered one day later. Shared VINs: AJ Partners shares 139 VINs with Tutash Express and 36 VINs with KG Line Group, meaning the same trucks are operating under multiple DOT numbers. The same distinctive mountain logo appears on equipment registered to different companies. And KG Line Group’s president was photographed wearing a Sam Express polo at the Broker Carrier Summit in Orlando. Tutash Express alone has recorded 57 crashes and over 1,800 inspections, with a significant violation rate. Across the network, we’re looking at nearly 100 crashes combined. This is textbook chameleon carrier behavior. The GAO told us in 2012 that chameleon carriers are three times more likely to be involved in serious crashes than legitimate new entrants. That data hasn’t gotten better. And four men from Bryant, Indiana, Henry Eicher, 50, his sons Menno, 25, and Paul, 19, and family friend Simon Girod, 23, paid the price. Three Doors and How the Government Can Approach a Carrier When federal investigators show up at a trucking terminal, they’re walking through one of three very different doors. Each has its own rules, limitations, and timeline. This matters. Door One: The FMCSA Compliance Review This is the standard enforcement pathway, the one most carriers encounter. If FMCSA investigators arrived at Sam Express to conduct a compliance review or a focused investigation, they are bound by established procedures. They follow the FMCSA’s Electronic Field Operations Training Manual (eFOTM), which dictates the scope, methodology, and documentation requirements for every investigation. They pull a sample size of driver qualification files based on fleet size. For a carrier of Sam Express’s size, that might mean 10 to 25 DQ files, not all of them. They review the six compliance factors: general compliance, driver qualifications, hours of service, controlled substances and alcohol, vehicle maintenance, and hazardous materials if applicable. They compare carrier records against the Motor Carrier Management Information System, the Safety Measurement System, and roadside inspection data. A focused review, which is what most CSA-triggered investigations are, is typically non-ratable. The investigator can’t issue a Satisfactory rating, but they can downgrade to Conditional or Unsatisfactory if they discover patterns of non-compliance. The standard is generally more than 10 percent for any one type of violation, or a pattern that, in a full compliance review, would warrant a rating reduction. The carrier gets notified of results. If the rating drops to Unsatisfactory, the carrier is ordered to cease operations, but even that process involves notification periods and opportunities for corrective action. It’s not instant. This pathway is procedurally sound. It is also, by design, methodical. The government has to follow its own rules. Door Two: The Imminent Hazard Out-of-Service Order This is the nuclear option. Under 49 USC §521(b)(5)(A), the Secretary of Transportation, through FMCSA’s Field Administrators and Regional Service Centers, can declare a carrier an imminent hazard to public safety and order it to immediately cease all operations. Interstate and intrastate. From all terminals and dispatching locations. No sample size. No eFOTM procedure. No 45-day notification window. The carrier is done. Simultaneously, FMCSA revokes the carrier’s operating authority and suspends its USDOT number. Civil penalties run up to $33,252 per violation. Criminal penalties can include fines up to $25,000 and imprisonment. And if the carrier ignores the order, the U.S. Attorney’s Office can seek equitable relief in federal court. We’ve seen FMCSA use this authority effectively. Monique Trucking in California. Sorbon Transport in Colorado. DND International in Naperville, Illinois, which came after a crash that killed an Illinois Tollway worker. FTW Transport in Texas. The pattern is consistent: post-crash investigations reveal egregious, systemic noncompliance, and FMCSA imposes penalties. Given what we’ve documented in the Sam Express/Tutash network, nearly 100 crashes, 139 shared VINs between carriers, the same trucks operating under multiple DOT numbers, sequential authority registrations, and four people dead in Indiana, the evidence for an imminent hazard finding is there. Whether FMCSA takes that step depends on what investigators found on-terminal yesterday and what authority they were operating under when they walked through the door. Door Three: The Federal Criminal Investigation This is the Beam Brothers’ route. Mount Crawford, Virginia. One of the nation’s largest USPS mail carriers. Federal agents, not FMCSA investigators, but agents from the DOT Office of Inspector General, IRS Criminal Investigation, USPS-OIG, and Department of Labor OIG, raided the facility with federal warrants. They seized records, computers, and everything else. No sample size. No compliance review procedure. The warrants authorized them to take what the evidence supported. That investigation ran from 2006 through a 2017 indictment, 126 counts, including conspiracy to defraud the United States, wire fraud, and money laundering. The company paid $3.25 million. The four senior officers pled guilty. The investigation revealed that management had been forcing drivers to falsify logbooks and work beyond hours-of-service limits while hauling U.S. mail under government contracts valued at over $500 million. If the Department of Justice is involved in the Sam Express investigation, and the OIG, the FBI, the U.S. Marshals Service, or any other federal law enforcement entity has obtained warrants, then the rules of engagement are entirely different. They’re operating under the Federal Rules of Criminal Procedure, not the eFOTM. And the timeline, scope, and eventual outcome bear no resemblance to a compliance review. Why This Matters. We Don’t Have Kings I want to be very clear about something, and I want the people reading this to actually hear it. This administration, President Trump, Secretary Duffy, and FMCSA Administrator Derek Barrs, is the most proactive, most aggressive, most hands-on leadership team the Department of Transportation and FMCSA have seen in my lifetime. And I’ve been alive for 45 years. I’ve watched every administration from Reagan to right now. I have personally met with some of these people. I know that the data and information we have provided have been received and acted upon. I know they are hands-on. I know they care about highway safety. I know they are trying to drive change. The receipts speak for themselves. Secretary Duffy launched a nationwide audit of non-domiciled CDL issuance that uncovered systemic noncompliance across 19 states. California alone accounted for over 25 percent of sampled non-domiciled CDLs issued improperly, including one case in which a driver from Brazil received endorsements to drive a passenger bus and a school bus, with credentials valid months after his legal status expired. New York’s audit found 53 percent of sampled non-domiciled CDLs were issued illegally. Minnesota was at one-third. North Carolina at 54 percent. FMCSA Administrator Barrs put it plainly: “Under the Trump Administration, states have two choices: meet our standards or face the consequences. Following the law is not optional.” In May 2025, Secretary Duffy signed an order strengthening enforcement of English language proficiency, and more than 11,500 drivers have been placed out of service for failing to comply. By December, 7,500 CDL training schools had been shut down, nearly half of all schools on the Training Provider Registry, for failing to meet readiness standards. The agency removed nearly 3,000 training providers and placed another 4,500 under investigation in what FMCSA called the largest enforcement action ever against low-quality CDL training programs. This is not an administration that is sitting on its hands. This is the fastest and most decisive regulatory enforcement action I have ever seen in the transportation sector. Period. But here’s what people don’t understand, or refuse to understand, because it doesn’t fit their narrative. We don’t have kings. The President of the United States, the Secretary of Transportation, and the FMCSA Administrator all operate within confines. Legal confines. Procedural confines. Constitutional confines. And those constraints exist for a reason, even when they slow outcomes that feel urgent. The Confines That Bind Here’s how rules typically get made at the FMCSA level, because most people have no idea. It starts with an Advance Notice of Proposed Rulemaking (ANPRM), in which the agency says, “We’re thinking about addressing this issue, and we want public input.” Then comes the Notice of Proposed Rulemaking (NPRM), which is the actual proposed rule with a public comment period. Then comes the Final Rule, which incorporates public comments and sets an effective date. The entire process can take years. Sometimes a decade. Sometimes longer. There are congressional hearings. Committee investigations. Government Accountability Office reports indicate the GAO has been raising concerns about chameleon carriers since at least 2012. There are appropriations battles. There are Office of Management and Budget reviews. There is the Administrative Procedure Act, which requires agencies to follow specific steps before implementing regulations, and which provides grounds for legal challenge if they don’t. And then there are the lawsuits. This administration has faced an unprecedented volume of litigation. By late November 2025, approximately 530 lawsuits had been filed against the Trump administration, compared with fewer than 50 against the Biden administration in the same period and roughly 30 against Obama. The D.C. Circuit Court of Appeals stayed FMCSA’s interim final rule on non-domiciled CDLs in November 2025, preventing it from taking effect. A rule that was issued as an emergency action, because states were illegally issuing CDLs to unqualified foreign drivers, and people were dying on American highways, was frozen by a court order. Think about that. The agency identified an imminent hazard. The agency took emergency action. And a court said wait. That’s not a failure of this administration. That’s the system working exactly as it’s designed to work, with all the friction and frustration that entails. And it’s important to understand that dynamic when you’re wondering why a chameleon carrier network with nearly 100 crashes and four dead Amish men isn’t shut down overnight. The Political Reality The political opposition to this administration has reached a point where common-sense safety measures are being fought not on their merits, but on the identity of the person proposing them. Non-domiciled CDL reform, which protects every American on the highway regardless of their politics, is tied up in litigation because of who signed the order. English language proficiency enforcement, a requirement that has been on the books for decades and exists because a truck driver who cannot read road signs or communicate with emergency responders is a danger to everyone, becomes a political football. Historically, policies like food safety reform, immigration enforcement, and infrastructure investment have enjoyed bipartisan support. Democrats and Republicans have both championed these causes under their own administrations. But the current political environment has devolved to a point where the substance of a policy matters less than the name on the letterhead. Common-sense proposals that previous Democratic leaders have openly supported are now reflexively opposed because of who occupies the White House. This isn’t about left or right. This is about whether we can have an honest conversation about highway safety without letting partisan tribalism override logic. And right now, that conversation is harder than it should be. The Resource Problem Nobody Talks About Here’s another reality check. FMCSA employs just over 1,000 people, and that number declined in 2025 when 169 employees (13.7 percent of the workforce) accepted Deferred Resignation Program offers as part of a broader federal workforce restructuring. Those 1,000 or so people are responsible for regulating more than 500,000 commercial trucking companies, more than 4,000 interstate bus companies, and more than 4 million CDL holders. Around 1,000 people. Over 500,000 trucking companies. That’s why prioritization matters. That’s why the Safety Measurement System exists, to identify the highest-risk carriers and focus limited enforcement resources where they’ll have the most impact. That’s why FMCSA relies heavily on state agency partnerships through the Motor Carrier Safety Assistance Program (MCSAP), which provides federal funding to state law enforcement agencies to conduct roadside inspections and compliance reviews. Those state partnerships come with their own complications. Some states have adopted federal regulations wholesale. Others have carve-outs and variations. Some have their own enforcement priorities that don’t perfectly align with federal objectives. Then there’s the immigration enforcement angle. The 287(g) program, named after Section 287(g) of the Immigration and Nationality Act, authorizes state and local law enforcement agencies to be deputized by DHS to conduct immigration enforcement functions. That’s a completely different department and a completely different statutory authority than FMCSA. As of September 2025, DHS had signed over 1,000 287(g) agreements nationwide. But just this week, literally two days ago, Virginia’s new governor, Abigail Spanberger, signed an executive directive terminating all state-level 287(g) agreements with ICE, ordering Virginia State Police, the Department of Corrections, and other state agencies to exit the program. This reversed former Governor Youngkin’s directive that had placed state law enforcement into the immigration enforcement business. The point isn’t to debate whether that’s good or bad policy. The point is that the regulatory and enforcement landscape is a patchwork.",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/Rob-C-2-6-C.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "REAL-ID, Mail-Order CDLs, and America's CDL Free-for-All.",
      "url": "https://www.freightwaves.com/news/real-id-mail-order-cdls-and-americas-cdl-free-for-all",
      "published": "2026-02-06T14:57:56+00:00",
      "summary": "<p>A Mexican licencia federal de conductor can be obtained without a behind-the-wheel road test. Third-party brokers advertise mail-order processing for as little as $200. Under existing reciprocity agreements, that license can be converted to an American CDL in states that accept foreign credentials, and at least six of those states have been flagged by FMCSA for failing to verify the legal presence of non-domiciled applicants.</p> <p>The post <a href=\"https://www.freightwaves.com/news/real-id-mail-order-cdls-and-americas-cdl-free-for-all\">REAL-ID, Mail-Order CDLs, and America&#8217;s CDL Free-for-All.</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Somewhere between a Philadelphia apartment and a flea market in South Texas, between a wire transfer to a Mexican fixer and a California DMV counter that doesn’t blink at a birth certificate listing “No Name Given,” the American commercial driver’s license system broke. Not bent. Not stressed. Broke. It is so broken that a 2025 federal audit found that one in four non-domiciled CDLs issued by California were improper. It broke so badly that Oklahoma state troopers pulled over commercial vehicles driven by individuals whose official government-issued CDLs listed their first name as “No Name Given.” It broke so completely that for $2,500 wired to the right contact in Mexico, a Honduran national who has never sat behind the wheel of a tractor-trailer can receive a digital Licencia Federal de Conductor, a Mexican federal commercial driver’s license, in his email inbox, printed against a backdrop of his garage door, and use it to drive 80,000 pounds of freight on American highways. This is not a single problem. It is a constellation of failures, federal, state, and international, that have converged into what U.S. Transportation Secretary Sean Duffy called “an imminent hazard on America’s roadways” and “a direct threat to the safety of every family on the road.” At least five fatal crashes in the first eight months of 2025 involved non-domiciled CDL holders. In one, a driver attempted an illegal U-turn on the Florida Turnpike in St. Lucie County, killing three Americans. In another, a March crash in Austin involving 17 vehicles killed five people, including two children. The crashes are the symptom. The disease is a licensing infrastructure so fragmented, so riddled with loopholes and willful state-level negligence, that it has effectively created multiple open doors for unvetted, unqualified, and in many cases undocumented individuals to obtain credentials to operate the deadliest vehicles on American roads. Those doors have names: AB 60, Driver’s Licenses for All, non-domiciled CDLs, reciprocal license recognition, and the newest and perhaps most brazen of them all, the Mexican mail-order CDL. The $2,500 CDL You Never Have to Earn The story of the mail-order Mexican CDL begins, ironically, with a modernization effort. In April 2021, Mexico’s Secretaría de Comunicaciones y Transportes began issuing digital versions of the Licencia Federal de Conductor, or LFC. The move was intended to reduce fraud by replacing hard-copy licenses that had long been counterfeited using materials sourced from China, from the same manufacturer, with licenses bearing the same holograms used by the Mexican government. U.S. Customs had been seizing counterfeit materials from cargo ships for years, but had never connected the dots to the downstream implications for American highway safety. The digital transition didn’t kill the fraud. It supercharged it. According to Maj. Omar Villarreal of the Texas Highway Patrol’s Commercial Vehicle Enforcement division, the scheme works like this: An aspiring driver, often not a Mexican national but a citizen of Honduras, Guatemala, El Salvador, Cuba, Nicaragua, Ecuador, Colombia, or Venezuela, hears through informal networks that a Mexican CDL is available for purchase. The buyer emails a photograph of themselves, provides basic biographical information, and wires between $2,000 and $5,000, depending on the state where the transaction is facilitated. What arrives is a digital LFC that, when queried through Mexico’s SCT verification portal, may appear legitimate or redirect to a fraudulent clone website that mimics the official system. Texas enforcement officers began catching these fakes because of the photos. Where legitimate LFC photos would be taken in a Mexican government facility, the digital frauds showed drivers standing in front of garage doors, against residential backdrops, and against living room walls. The backgrounds told the story the documents were designed to hide: these licenses were never issued in Mexico. Many of the holders had never been to Mexico. “We started noticing in the Austin area an uptick of commercial vehicles engaged in construction,” Villarreal told FreightWaves. That uptick soon gave way to massive encampments forming outside Texas cities, with 80 to 100 commercial vehicles at a time, housing operators working in short-haul construction and aggregate hauling. “We started seeing this crop up all over the major metropolitan areas of Texas.” When officers interviewed the drivers, many disclosed they were Central American nationals who had acquired their Mexican LFCs without ever setting foot in a testing facility. The digital transition had opened the door to corruption within the Mexican government, which allegedly began selling LFCs to third-party vendors, who then resold them internationally. The result is a fully operational, transnational commercial licensing fraud operation, one that the Biden-era FMCSA and CVSA showed little appetite to address when Texas first raised the alarm. Cabotage, the Border Zone, and the Legal Fiction Under NAFTA and now under the USMCA, the United States, Mexico, and Canada agreed to recognize each other’s commercial driver’s licenses for international commerce. A Mexican driver holding a valid LFC can legally deliver international cargo into the United States, but only within designated commercial zones along the southern border or under limited long-haul authority granted to a small number of Mexican carriers following a 2011-2015 congressional pilot program. The critical restriction is cabotage. Under 49 CFR § 365.501(b) and 19 CFR § 123.14(c), a Mexico-domiciled carrier may not provide point-to-point transportation within the United States for goods other than international cargo. Period. When a Mexican carrier delivers a load into the U.S., it must either find a return load to Mexico or deadhead home. It cannot haul freight from Dallas to Houston. It cannot pick up domestic loads. The regulation exists to protect American trucking jobs and ensure domestic freight moves on domestic credentials. In theory. In practice, as the Trucking and Enforcement Action Coalition noted in its 2025 recommendations, “there is nothing to stop drivers authorized for border-zone-only hauling from operating beyond the zone without proper authorization or language proficiency verification.” State law enforcement cannot enforce federal cabotage rules. FMCSA has statutory authority to levy $10,000 civil fines for cabotage violations, but has a longstanding pattern of failing to follow through. The result is a system where the rules exist on paper and evaporate on the highway. And here is where the mail-order Mexican CDL becomes more than a fraud problem. Under reciprocal recognition, a Mexican LFC, even a fraudulent one, is treated as a valid credential if it appears legitimate. A driver who purchased a digital LFC for $2,500 from a contact in Mexico City can present it to a U.S. motor carrier as proof of qualification. Unless that carrier takes the extraordinary step of verifying the license in Mexico’s SCT database and cross-referencing the CURP, an 18-character personal identification code unique to each Mexican citizen, there is no practical way to distinguish the fraud from the real thing. Texas tried to close this gap. In 2023, the state legislature unanimously passed SB 672, requiring foreign CDL holders operating outside border counties to possess valid U.S. work authorization documents. The law classified both Mexican and Canadian CDLs as government records, giving prosecutors grounds to charge possession of a fraudulent LFC as tampering with a government record. Enforcement of the new law reduced crashes in Texas. But it also pushed the operators out of state, to Colorado, to Pennsylvania, to California, to Washington, where they found more permissive environments and, in some cases, the opportunity to trade their fraudulent Mexican LFC for a genuine American CDL. AB 60, Driver’s Licenses for All, and the Gateway to a CLP California’s Assembly Bill 60, signed into law in 2013 and effective January 2015, allows undocumented immigrants to obtain a California driver’s license without proof of legal presence in the United States. The applicant needs proof of identity, which can include a Mexican passport, a Mexican Federal Electoral Card, or a foreign consular ID, and proof of California residency, which can be established with documents as informal as a cell phone bill, a letter from a nonprofit, or an attestation from a faith-based organization. More than one million AB 60 licenses have been issued since the program’s inception. The licenses bear the notation “Federal Limits Apply” and cannot be used for federal identification purposes. And critically, AB 60 does not authorize the issuance of a commercial driver’s license. A CDL in California still requires a valid Social Security number. That is the letter of the law. But the letter and the reality occupy different zip codes. What AB 60 does provide is a state-issued identity document. It creates a documented residency. It establishes a person in a system. While the license itself cannot be upgraded to a CDL, it provides the bureaucratic foundation on which other credentials can be stacked. An individual with an AB 60 license has passed both the knowledge and driving tests. They have established residency. They have a government-issued photo ID with an address. For someone seeking to navigate the patchwork of state CDL programs, particularly the non-domiciled CDL pathway, that foundation is the first brick in the wall. The same principle applies in Minnesota, where Governor Tim Walz signed the Driver’s Licenses for All bill in March 2023, effective October 1 of that year. The law removed the requirement to prove legal presence in the United States for a standard Class D license. An estimated 81,000 undocumented immigrants in Minnesota became eligible. The law includes strict privacy protections prohibiting the Minnesota Department of Public Safety from sharing applicant information with federal immigration authorities. Washington state has followed a similar trajectory. Before the 2025 federal crackdown, Washington was issuing non-domiciled CDLs with what federal auditors later characterized as grossly insufficient verification. In one case identified by the FMCSA, Washington authorized a non-domiciled CDL to a Ukrainian citizen without verifying the individual’s lawful presence in the United States. An internal review discovered that 685 non-domiciled drivers were incorrectly given regular CDLs or learner’s permits rather than limited-term credentials. The pattern across these states is not identical, but the architecture is the same: create an accessible entry point for a state-issued identity document, build privacy walls that prevent federal immigration authorities from accessing the resulting data, and then fail to adequately police the pathways between that entry-level document and the commercial credentials that allow someone to operate 80,000 pounds of steel at 65 miles per hour. ‘No Name Given’ and the Identity Verification Insanity In September 2025, Oklahoma Governor Kevin Stitt posted a photograph on X showing a New York state CDL seized during Operation Guardian, a joint operation between the Oklahoma Highway Patrol and ICE along Interstate 40. The CDL listed the driver’s first name as “No Name Given.” The operation resulted in the apprehension of 125 undocumented immigrants from nine countries operating commercial vehicles. The image detonated on social media. But the reality behind it is both more nuanced and more damning than the viral moment suggested. In many cultures, Afghanistan, Indonesia, parts of South Asia, and the Middle East, individuals use a single name. There is no surname, no given name, and no family name division. When these individuals present identity documents at an American DMV, the documents may list only one name, with the first-name field left blank or populated with “No Name Given.” California DMV policy requires clerks to transcribe names exactly as they appear on the presented identity documents. If the birth certificate or passport says “No Name Given” in the first-name field, that is what goes on the license. The policy is defensible in isolation. The problem is what it reveals about the broader system. If a state is issuing CDLs, credentials that under the Real ID Act are supposed to represent some of the most secure identity documents in the nation, credentials that in their REAL ID-compliant form bear a star indicating the holder has been vetted to enter a nuclear facility, to individuals whose identity documents cannot populate a first-name field, the question is not whether mononyms are culturally legitimate. The question is whether the identity verification process actually verifies anything. Federal auditors apparently concluded it was not. The FMCSA audit that prompted Secretary Duffy’s September 2025 emergency action found that California, Colorado, Pennsylvania, South Dakota, Texas, and Washington all exhibited “systemic non-compliance” in their CDL issuance patterns. California alone had 62,000 unexpired non-domiciled CLPs and CDLs in its system. More than 25 percent of those reviewed were improperly issued. Some licenses are extended four years beyond the expiration of the holder’s legal authorization to be in the United States. In one case, California issued a CDL with school bus and passenger bus endorsements to a Brazilian national whose legal presence had already expired. Pennsylvania, the state that issued the non-domiciled CDL shown in the image at the top of this article, was identified as one of the six states with licensing patterns inconsistent with federal regulations. Over 12,000 active non-domiciled CDLs exist in the Pennsylvania system. FMCSA issued eight mandatory corrective actions to the state, including an immediate pause on all non-domiciled CDL issuance and a full internal audit of every transaction. Duffy’s Emergency and the Court’s Pause On September 26, 2025, Secretary Duffy announced an emergency interim final rule that immediately restricted non-domiciled CDL eligibility to holders of H-2A agricultural worker visas, H-2B temporary worker visas, or E-2 treaty investor visas. Employment Authorization Documents alone, the work permits that had previously been sufficient, would no longer qualify. The rule required states to use the USCIS SAVE database to verify every applicant’s immigration status, mandated in-person renewals, and required states to maintain documentation for at least two years. The rule affected approximately 200,000 active non-domiciled CDL holders and 20,000 CLP holders. FMCSA estimated that only about 6,000 drivers annually would qualify under the new restrictions, a roughly 97 percent reduction in the eligible applicant pool. “What our team has discovered should disturb and anger every American,” Duffy said. Licenses to operate a massive, 80,000-pound truck are being issued to dangerous foreign drivers, often times illegally. This is a direct threat to the safety of every family on the road, and I won’t stand for it.” California was given 30 days to comply or face withholding of $160 million in federal highway funds in the first year, with the amount doubling in year two. Washington suspended all non-domiciled CDL processing. Colorado, South Dakota, Oregon, Wisconsin, New Mexico, Georgia, and others followed with pauses of their own. Then the courts intervened. On November 13, 2025, the U.S. Court of Appeals for the D.C. Circuit issued a stay pending review, preventing the interim final rule from taking effect until further notice. States were technically free to resume issuing non-domiciled CDLs under the pre-existing regulatory framework. But many did not. California, Washington, Texas, Colorado, South Dakota, Minnesota, Pennsylvania, and New York remain subject to corrective ac",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/Rob-C-2-6-B.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "USPS quarterly parcel volumes fall 12% as e-commerce plan implemented",
      "url": "https://www.freightwaves.com/news/usps-quarterly-parcel-volumes-fall-12-as-e-commerce-is-plan-implemented",
      "published": "2026-02-06T13:56:08+00:00",
      "summary": "<p>The U.S. Postal Service saw quarterly adjusted operating income tumble by nearly two-thirds as parcel volume fell by double digits and revenue contracted during the peak shipping season.</p> <p>The post <a href=\"https://www.freightwaves.com/news/usps-quarterly-parcel-volumes-fall-12-as-e-commerce-is-plan-implemented\">USPS quarterly parcel volumes fall 12% as e-commerce plan implemented</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "The continued decline in mail and parcel volume contributed to a 64% drop in controllable income for the U.S. Postal Service during the first quarter, underscoring why Postmaster General David Steiner is pushing to grow revenue through higher rates and a new program aimed at attracting retailers to handoff e-commerce shipments for last-mile delivery. More than 1,200 companies have shown interest so far in bidding for last-mile service, Steiner said in a presentation to the USPS Board of Governors on Thursday afternoon, adding that programs for first-mile package collection from retailers, as well as returns, could be established later this year. The fact that results went south during the strongest shipping period of the year, when seasonal surcharges and higher rates are applied, raises questions about the level of progress five years into a transformation plan designed to increase efficiency. Steiner, who took the helm last summer, acknowledged that more work remains to make the organization financially sustainable. Postal Service operating revenue dipped 1.2% to $22.2 billion, while expenses increased 4.6% to $23.5 billion, year over year for the three months ended Dec. 31, according to financial results released Thursday. Transportation costs, which have been heavily targeted by a multi-year transformation strategy, rose 2% to more than $2.4 billion. Controllable income, essentially adjusted operating income that excludes expenses such as workers compensation that are out of management’s control, plunged to $350 million from $968 million. Net loss for the quarter totaled $1.3 billion after the Postal Service posted a $144 million profit in the prior year period. Beyond lower revenues and higher costs, the bottom line was impacted by increases in unfunded employee and retiree benefit costs, such as workers compensation, that are mandated by law. Last year, the USPS lost $9 billion, with a controllable loss of $2.7 billion, despite a short-lived profit during the first quarter. Parcel revenue was essentially flat on a volume decrease of 243 million pieces, or 12.1%. Strong demand for USPS Ground Advantage, the organization’s economy product with two-to-five day service standards, and price increase for package services (catalogs and other large printed media) helped offset revenue decreases in Priority Mail and Parcel Select services resulting from increased last-mile competition for e-commerce delivery, in-sourcing from major customers like Amazon, and the trend away from expedited products, according to the Postal Service. Volumes declined in all parcel categories except Ground Advantage. First-class mail revenue increased 1% on a volume decline of 702 million pieces, or 6.1%, versus the same quarter last year. Marketing mail revenue fell 2.7% on a 10.9% decline in volume. On the positive side, the USPS was able to deliver mail and packages within two and a half days on average compared to 2.8 days and on-time delivery scores were higher across nearly all product types, with the best scores coming at the post office level, according to the financial report. The Postal Service actually demonstrated the largest performance improvement among major parcel carriers, meeting on-time delivery standards 94.1% of the time during December compared to 90.4% in 2024, according to data analytics and consulting firm ShipMatrix . ShipMatrix’s methodology excludes delays caused by weather, but the Postal Service is required to report service performance without regard to circumstances beyond its control, something Steiner said he is working to correct because it doesn’t provide useful information for customers. Compared to last year, the Postal Service recorded a 23% reduction in calls to its customer care center and a 44% decline in package related customer service inquiries, which management attributed to technology investments and better logistics planning. “While we are pleased that the holiday quarter was quite strong with regard to service improvement as measured by our on-time delivery scores and other important service performance metrics, we continue to face difficult systemic financial and business model headwinds,” Steiner said in the earnings announcement. “To right our financial ship, we are aggressively pursuing growth strategies — which include creating new opportunities for businesses to leverage our vast last-mile delivery network – and driving greater efficiencies throughout our operations. We are convinced that these efforts, if combined with needed regulatory, administrative, and legislative changes, can meet the needs of the American public and return the Postal Service to long-term financial stability and strength.” Last-mile e-commerce revenue Leadership says it needs to achieve further operational efficiencies, boost revenue by offering more innovative products that increase demand, and secure legislative and regulatory reforms for the turnaround plan to succeed. Steiner last month launched a revenue initiative aimed at driving greater use of the last-mile delivery network by large e-commerce merchants and logistics intermediaries. Shippers who drop off bulk parcel loads can now digitally bid for access to local post offices for doorstep delivery. Steiner’s predecessor, Louis DeJoy, forced large shippers to deliver parcels to intermediate distribution centers— so the Postal Service could do the sorting itself and charge higher rates — instead of thousands of destination delivery units. But the system was only open to direct shippers, not logistics providers, and was only used by a limited number of very large companies because of the high volumes required to make it economical. “Allowing customers to bid on last mile capacity is building a new win-win partnership model. It improves their service while reducing their costs and builds revenue for the Postal Service,” the Postmaster General told the board. The new way “is more transparent, better adapted to today’s e-commerce landscape and, most of all flexible, to their needs. And to date, more than 1,200 companies and individuals have requested to join the portal. Not all 1,200 will be qualified bidders but the sheer number shows the dramatic interest in our last mile. Why this matters is that we’re giving customers the ability to fit our network to their business. No longer forcing their business to fit our bureaucracy,” Steiner added. The last-mile bid portal is a model for how the USPS can innovate to get better asset utilization and grow. “We must be willing to test new models like last mile bidding and then scale what works,” he said. “As we look at 2026, I see growth priorities in finding and enhancing strategic partnerships that expand reach, volume and relevance, bolstering flagship products that improve service and reliability — improvements that customers can really feel, leveraging our first-mile assets and capabilities from collection to retail to returns to upstream logistics so we can capture value earlier in the pipeline. I believe that these things we can control can help us evolve, help us create and maintain a stronger, more modern posture in today’s market.” Structural hurdles Mail volumes, including bulk marketing mail, have declined 50% since 2007, according to the Postal Service. Despite these declines, mail services still accounted for more than half of operating revenue in 2025. While the postal carrier has received some additional pricing flexibility from the Postal Regulatory Commission in recent years, mail services are still subject to an inflation-based price cap system that officials argue limits their ability to offset declining volumes or generate increased revenue. Steiner last month asked the Postal Regulatory Commission to provide the Postal Service with unlimited power to raise prices for all first-class mail, marketing mail, newspapers and magazines, areas where the agency dominates the market. Direct mailers and other critics warned against granting unrestricted rate increases, saying the recent proliferation of hikes in mailing rates and stamp prices has driven away customers and that further price increases will hurt the public and businesses alike. “USPS cannot afford to continue prioritizing packages over mail and penalizing its biggest revenue generator,” said Kevin Yoder, executive director of Keep US Posted, an advocacy group that includes nonprofit organizations, newspapers, greeting card publishers, magazines, catalogs and small businesses fighting for an affordable Postal Service. “The package growth DeJoy [the previous postmaster general] sought has not, and will not, materialize. While businesses and consumers have many private sector options for package delivery, we all rely on USPS to deliver the mail, and it’s the only service provider that delivers anywhere in the U.S. It’s easy to attribute decreasing mail volume to the growth of digital communication, but the fact is that price increases and productivity declines are pushing even more mail out of the system. The USPS cannot continue to vampirize the mail, its biggest revenue source, and compromise the mail delivery on which both Americans and businesses depend.” One reason costs continue to rise is that the number of delivery points keeps growing. Last year, the USPS delivered to 1.8 million more addresses than in fiscal year 2024. The combination of more daily stops and lower mail volume has resulted in a drop in the average number of pieces delivered per delivery point per day from 5.5 pieces in 2007 to 2.4 pieces in 2025, a decline of 57%, according to the national post. The Postal Service continues to press Congress and regulators to lift onerous retirement benefit and worker compensation requirements that other agencies and private companies don’t face. It also wants the ability to diversify pension investment vehicles beyond bonds, a higher statutory debt ceiling, and more flexibility over pricing to better respond to market conditions and recoup costs. Click here for more FreightWaves/American Shipper stories by Eric Kulisch. USPS proposal requiring small parcel dimensions raises compliance fears USPS solicits retailers to reserve last-mile delivery capacity Canada Post, letter carriers hammer out details on final contract UPS sees higher profits in 2026 from network, Amazon downsizing",
      "cover_image_url": "https://www.freightwaves.com/wp-content/uploads/2026/02/06/USPS-Q2-2026-results_1.jpg"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "When drivers say no: Truckers speak out about unsafe working conditions",
      "url": "https://www.freightwaves.com/news/when-drivers-say-no-truckers-speak-out-about-unsafe-working-conditions",
      "published": "2026-02-06T13:15:00+00:00",
      "summary": "<p>Truck drivers describe being pressured to operate in unsafe environments and explain what drivers can do when safety is put at risk.</p> <p>The post <a href=\"https://www.freightwaves.com/news/when-drivers-say-no-truckers-speak-out-about-unsafe-working-conditions\">When drivers say no: Truckers speak out about unsafe working conditions</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Truck drivers across the U.S. say they are increasingly pressured to operate equipment they believe is unsafe — from dilapidated trailers, to overloaded tankers and malfunctioning braking systems — and some say speaking up can cost them their jobs. Two former truck drivers interviewed by FreightWaves, who requested anonymity due to fear of retaliation, described what they say were repeated attempts by their former employers to push productivity over safety. Their experiences highlight both the risks drivers face on the road and the legal protections available when drivers refuse unsafe work. One former over-the-road truck driver said the Texas-based company he worked for repeatedly attempted to pressure him into hauling damaged or improperly repaired trailers, including equipment with brake defects, alignment problems and visible structural damage. “I told them flat-out, this trailer is not safe to move,” the driver said, describing an incident involving a trailer that had recently rolled over. “They kept trying to push me anyway.” In another exchange, the driver said he made clear he would not attach to unsafe equipment. “I told them, ‘This trailer is not safe to move. I am not going to hook up to this thing,’” he said. “They were trying to push me anyway.” He said dispatchers sometimes urged him to continue driving equipment that should have been taken out of service — even after licensed mechanics warned the carrier that the trailer could not legally return to the road. Ultimately, the driver refused. “Part of my job is to check that equipment before it goes on the road,” he said. “If I touch the road with unsafe brakes and someone gets hurt, that’s on me.” He said his decision to refuse unsafe equipment may have prevented a serious accident and that his motivation was never personal retaliation. “This isn’t about vengeance. It’s about safety,” he said. “There are other companies doing the same thing, and it gives the whole industry a bad name.” “There are other companies doing this,” he added. “And unless drivers know their rights, it keeps happening.” “They counted bathroom breaks against productivity” A driver based in Illinois, who is pursuing an OSHA whistleblower complaint against his former company, described a workplace culture in which drivers were penalized for stopping — even to use the restroom — because non-driving time was treated as unproductive under the carrier’s internal metrics. He said drivers were given a basic reference sheet showing which activities counted toward productivity (i.e. loading, unloading, fueling and similar tasks). “Outside of those listed categories, most on-duty time when the truck wasn’t moving would lower your productivity average,” the driver said. “There was never a clear written explanation of how time spent waiting in line, sitting in traffic, in the shop, calling dispatch, or handling normal needs like restroom breaks was actually calculated. Because of that, drivers were often unsure how much of that time counted and how much did not.” The driver said he raised repeated concerns about basic human needs, weight compliance and safety inspections — all documented in emails and messages — but received no corrective action before being terminated. He has since filed a retaliation complaint under federal whistleblower statutes. Alleged pressure to overload tankers The Illinois-based truck driver said he also faced systemic pressure from his previous employer to overload fuel tankers beyond legal limits to meet productivity and financial targets. “If truck stop shows they only have space for 7,500 gallons, you should load 7,500,” the driver said. “The expectation was to average roughly the maximum legal load (around 7,800 gallons). If a location only had space for less, I would load what fit, but that shortfall affected the running average. Drivers were then expected to bring the average back up on later loads, which created pressure to push higher numbers over time.” He said internal metrics penalized drivers who stayed under legal maximums, while rewarding those who loaded heavier — even when doing so risked violating weight limits. “Internal driver averages were shared, and drivers below target were highlighted while those above target were praised,” the driver said. He said he raised concerns with human resources but received no corrective response. “I asked HR, how is it that drivers are being praised for loading over legal limits?” he said. Brake warnings and productivity pressure The Illinois-based driver said he also experienced pressure to keep operating trucks with unresolved safety warnings, including brake-system alerts. “I got an ABS warning — ‘service now’ — after offloading diesel,” he said. “It was telling me to go to the shop.” Instead, he said he was instructed to keep driving and let a different shift handle repairs. “I told my lead there was an ABS issue, and he told me, ‘No, the night driver will take it later,’” he said. The driver said waiting for guidance on safety concerns was itself treated as a performance problem. “My lead is not a mechanic. He can’t decide what’s safe,” he said. “If there’s a brake issue, the truck has to go to the shop.” He added, “Waiting for an answer about a safety issue also counted against my productivity.” What drivers can do when conditions are unsafe Federal and state laws provide truck drivers with protections when they refuse to operate unsafe equipment or report violations. Drivers facing unsafe conditions are advised to: Document everything , including dispatch messages, repair orders, photos and ELD records Report safety concerns in writing , using internal safety channels Refuse unsafe work , when operating the vehicle would violate safety laws File a whistleblower complaint if retaliation occurs, particularly under the Surface Transportation Assistance Act (STAA) or applicable state laws",
      "cover_image_url": "https://freightwaves.b-cdn.net/wp-content/uploads/2026/02/05/Frances_Hall_sentencing.jpg?width=2309&height=1299"
    },
    {
      "industry": "foreign_trade",
      "source": "FreightWaves",
      "title": "Truck Parking Club hits 4,000 locations, targets 10,000 by year-end",
      "url": "https://www.freightwaves.com/news/truck-parking-club-4000-locations-10000-goal",
      "published": "2026-02-06T13:00:00+00:00",
      "summary": "<p>Chattanooga-based platform adds 1,000 spots in three months as major carriers embrace private parking marketplace</p> <p>The post <a href=\"https://www.freightwaves.com/news/truck-parking-club-4000-locations-10000-goal\">Truck Parking Club hits 4,000 locations, targets 10,000 by year-end</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
      "content_text": "Truck Parking Club, the digital marketplace connecting commercial drivers with private parking spaces, announced it has reached 4,000 Property Member locations across 49 states, with plans to more than double that figure to 10,000 locations by the end of 2026. The Chattanooga, Tenn.-based company added 1,000 locations in just three months and now offers over 66,000 instantly reservable truck parking spaces, addressing a national shortage of 1.7 million spaces that costs the trucking industry more than $100 billion annually. Its rise is meteoric. The platform’s growth has attracted major carriers, with 92 of the top 100 U.S. carriers now using Truck Parking Club. The company was recently ranked No. 24 on the FreightWaves FreightTech 25 list for 2026. To better understand the growth story, FreightWaves spoke with Reed Loustalot, chief marketing officer at Truck Parking Club. Growing from 4,000 to over 10,000 locations would more than double the company’s footprint. The math is straightforward, if daunting: add 6,000 new properties in roughly 11 months. That means recruiting thousands of individual business owners who have never considered parking semi-trucks as a revenue stream. To accomplish this, Loustalot describes the recipe for success as extreme amounts of work and building a community and ecosystem to support it. Loustalot doesn’t want the story to just be about hitting big round numbers. Reaching those numbers has taken Truck Parking Club on an odyssey in search of additional pavement to book. Loustalot noted Truck Parking Club attended over 70 shows last year to expand reach and respond to feedback that the platform solves problems across the supply chain. “That could be a storage company or a repair shop or a trucking company or a warehouse,” Loustalot said. Year to date, the company has already attended seven trade shows by early February. Some of the biggest contributors are trucking companies with yard space, repair shops, self-storage facilities, towing companies and even third-party logistics providers with extra yard space. The variety of potential places to park translates into endless leads. Truck Parking Club’s efforts have taken it to dozens of supply chain conventions, including self-storage shows, trucking conferences, towing shows and retailer conventions — anywhere a company with extra space might consider listing a spot. “You’re going where they go,” Loustalot said. “And there’s a reason we do this.” He described the strategy as a shotgun approach. “It’s a shotgun because it’s literally how wide our market is. And if we’re serious about adding 6,000 locations in 11 months, we have to cast as wide a net as possible while maintaining a high bar for quality and thoroughly vetting what we actually onboard to the app.” There is a method to the madness, and it runs through the community the company has cultivated. The right partners and the value of skin in the game Behind the growth numbers lies a business model that Loustalot describes less as a tech platform and more as stewardship of small-business communities. When a driver books a spot through Truck Parking Club, the majority of every transaction goes directly to the property owner — whether that’s a family-owned repair shop in Akron, Ohio, or a regional trucking company with extra pavement. “When you park at Rick’s Repair Shop in Akron, Ohio, and you pay with Truck Parking Club, you’re paying Rick,” Loustalot said. “In a way, I think we really need to talk more about how we’re building essentially an ecosystem of all these local businesses and drivers and fleets, and they’re essentially transacting and meeting, and we’re kind of the stewards of that community.” The company acts as gatekeeper: handling onboarding, customer service and quality control. But the core is an ecosystem where hosts and drivers transact directly, with built-in incentives to keep standards high. Drawing a comparison to ride-sharing platforms, Loustalot explained how accountability drives quality. The company has accumulated many tens of thousands of reviews across its properties and plans to make ratings affect visibility to drivers. “It’s like Uber,” Loustalot explained. “A good rating keeps quality high because hosts know they need to deliver a great experience to stay visible. Drivers review seriously because they know the next person relies on that information.” Unlike government-funded parking projects that may lack long-term maintenance incentives, property owners on the platform have financial motivation to keep their lots in good condition. If they want to continue earning revenue, they need to maintain positive reviews and provide reliable service. “The only way we provide an excellent experience at that volume is by creating a system where properties are incentivized to improve based on feedback,” Loustalot said. “Bar none, our aim is to provide drivers an excellent experience,” he added. “They know they’re going to have a spot, they can rely on it, they know they can trust the listing page, they know they can trust the photos, they know they can trust the reviews.” Winning over both drivers and their fleets Loustalot noted one recent trend is the nation’s largest trucking fleets warming to the idea of paying for driver parking. “Not many do it yet,” Loustalot admitted, “but more will. We’re removing the traditional reasons they said no.” For large fleets that are onboarded, Truck Parking Club’s biggest champions are often the drivers themselves. Company drivers regularly tell Truck Parking Club that they pay for parking themselves to avoid trading $10 for an extra 50 or more miles of productivity. Parking peace of mind translates into more miles and a larger paycheck. The company is working to convert more fleets into paying for their drivers’ parking, addressing traditional barriers. “If historically what it’s meant for a big fleet to pay for a driver’s parking is either you just blindly trust the random receipt that your driver gave you or you don’t, and then go through the work of building the infrastructure to reimburse that money on paychecks,” Loustalot said. “We remove all of that because a fleet with us has one source of truth for payments and receipts.” Fleet managers can track every location, payment and booking frequency. They can view photos, security features and available amenities for each location their drivers use. It can also be a cash-generating option for fleets with a large real estate footprint. Many large carriers own or lease yards with underutilized space. The platform allows them to monetize that excess capacity while providing solutions where they need additional storage. “I don’t care if it’s five trailers or 500 trailers,” Loustalot said. “I don’t care if it’s one location or 100 locations. We’ve done it all.” The business case for fleet-paid parking extends beyond driver retention. Safety concerns play a role, as drivers parking in unauthorized locations create liability. Asset utilization matters too. When drivers shut down four hours early because they’re uncertain about finding parking, both the company and driver lose money. Loustalot adds that for smaller fleets that can’t afford real estate, temporary or long-term parking can help them grow their business. “We’ve had carriers tell us they have customers asking them to do projects in Ohio, and the carrier says no because they don’t have a yard there,” Loustalot said. “We can literally, on a month-to-month basis, give them access to flexible storage space.” This flexibility allows carriers to take on new business without committing to multi-year leases. Enhancing driver flexibility and the Super Trucker Membership The flexibility theme extends to drivers as well. The company recently launched its first membership subscription, called the Super Trucker Membership, priced at $9.99 per month. Members receive 5% back on every booking compared to the standard 1% return for non-members. The rewards accumulate in what the company calls “Club Cash,” a wallet feature tied to user accounts. The membership also provides five free refunds and five free booking changes per month. Previously, all bookings were non-refundable due to the payment system structure. Now members can cancel and receive their money back in Club Cash for future bookings or move a reservation to a different date, all through the app without calling customer service. “This is ultimately all about providing flexibility, because that’s how drivers are most affected,” Loustalot said. “They have flexible options, they have limitless places to park, and they always know they’re going to have a spot. That’s the world we’re trying to create.” The platform serves diverse use cases beyond standard overnight parking. Drivers use the service for storing trucks near their homes, taking 34-hour resets near attractions and parking during vacation time. “We hear stories like using a spot for five days so we could go to the Macy’s Thanksgiving Day Parade,” Loustalot said. “We’ve got a bobtail location on the beach in Florida, and there’s people there all the time. You think they’re just hanging out in the truck? No, they’re going to the beach.” Looking ahead: Locations as service nodes Loustalot doesn’t shy away from ambitious predictions about Truck Parking Club’s trajectory. Within three years, he expects the company to become the largest single entity parking trucks in the United States — handling millions of bookings annually. “That is where we will be in not a very long time,” Loustalot said. “And if it takes three years, it takes three years. That’s not a long time.” The long-term vision extends beyond parking reservations. Loustalot describes each location as a “node” around which useful services for truckers can aggregate: food, repairs, potentially even electric vehicle charging — whatever the market demands. “Every single one of our locations is its own little node,” Loustalot said. “And the services that are useful to truckers will aggregate around the nodes. Food, repairs, charging, whatever services the market demands will appear.” The company has already seen some electric vehicle charging companies list spaces on the platform — not for charging yet, but because they have unused space while infrastructure is built out. Formal partnerships remain on the horizon. “Any one of those folks is welcome to work with us right now,” Loustalot said. “As time goes on, we’ll pay attention to what there’s demand for, and how it would work, and how it would improve the experience drivers would have with us, and we’ll evaluate it.” The ultimate goal, Loustalot said, is a world where drivers have unlimited, reliable options — where the anxiety of finding a spot disappears entirely. “That’s the world we’re trying to create,” he said. “Drivers have flexible options. They have limitless places to park, and they always know they’re going to have a spot.”",
      "cover_image_url": "https://freightwaves.b-cdn.net/wp-content/uploads/2026/02/05/Truck_Parking_Club_Clubhouse_cropped.jpg?width=1280&height=720"
    }
  ]
}