{
  "industry": "reagents",
  "collected_at": "2026-02-08T10:05:52.572458+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Medtronic steps up with CathWorks buyout",
      "url": "https://www.fiercebiotech.com/medtech/medtronic-steps-half-billion-deal-israeli-devicemaker-cathworks",
      "published": "2026-02-08T10:04:49.722835+00:00",
      "summary": "Just weeks after announcing it would \"step up\" its acquisitions this year, Medtronic said it will shell out up to $585 million to buy privately held partner CathWorks, which focuses on coronary artery disease and its treatment.<br />",
      "content_text": "Just weeks after announcing it would \"step up\" its acquisitions this year, Medtronic said it will shell out up to $585 million to buy privately held partner CathWorks, which focuses on coronary artery disease and its treatment. At the J.P. Morgan Healthcare Conference in early January, Medtronic Chief Financial Officer Thierry Piéton said that after boosting day-to-day operations, the medtech giant was in a position to boost M&A this year, and it was “going to step up in that area.” Less than a month later, and that is ringing true with a new deal to buy out Israel-based CathWorks. The acquisition is valued at up to $585 million, \"with potential undisclosed earn-out payments post-acquisition\" also in the mix, according to a Tuesday, Feb. 3, statement. The buyout spawned from an original 2022 partnership that included co-promotion of its FFRangio system in the U.S., Europe and Japan, where it is commercially available, the company said in a press release. The FFRangio platform gives a comprehensive physiological assessment of a patient’s entire coronary tree using routine coronary angiograms (X-rays). The company said clinical evidence demonstrates excellent diagnostic accuracy and promising clinical outcomes when compared with wire-based FFR. “Through our co-promotion agreement, we've seen how CathWorks can disrupt the traditional wire-based FFR segment and leverage the power of data and AI to deliver innovative solutions that assist physicians at every step of a patient's journey, from diagnosis to treatment,\" Jason Weidman, a Medtronic senior vice president and president of its coronary and renal denervation business, said in a statement. “This acquisition allows Medtronic to transform the cath lab with a technology that provides real-time data, informs individualized treatment approaches, and drives new standards of care.” The platform is touted as the only angiography-derived system that delivers FFR values for the entire coronary tree. Additionally, it provides intraprocedural optimization tools, including assessment of the physiological impact of lesion treatment and interactive sizing tools to measure lesion dimensions. The acquisition is expected to be completed by the end of April, pending clearance from the Federal Trade Commission. CathWorks will then be folded into the Medtronic structure.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2217535736.jpg?VersionId=Voh_UpyyqntWWHuSbPRXgkAEaETMZXAt"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "FDA demands better response from Abbott over Libre inspection violations",
      "url": "https://www.fiercebiotech.com/medtech/abbott-hit-quality-violations-fda-over-freestyle-libre-cgm-products",
      "published": "2026-02-08T10:04:49.722815+00:00",
      "summary": "Abbott has been hit with a slew of complaints from the FDA in a warning letter related to its continuous glucose monitor franchise, FreeStyle Libre.",
      "content_text": "Abbott has been hit with a slew of complaints from the FDA in a warning letter related to its continuous glucose monitor (CGM) franchise, FreeStyle Libre. Last October, an agency inspection of Abbott's diabetes care division in Alameda, California, “revealed that these devices are adulterated,” the FDA said in a warning letter dated Jan. 23 and added to its website Feb. 3. The agency took issue with Abbott's practices surrounding the “manufacture, packing, storage, or installation” of the products. Abbott responded in November and December of last year, but the warning letter contends the company's responses were “inadequate.” The FDA originally said Abbott did not give specific glucose sensor accuracy requirements to third-party manufacturers. Abbott was also accused of failing to ensure proper monitoring of products that are either in the manufacturing process or finished. “We reviewed your firm’s responses and conclude that they are not adequate,” the FDA wrote in its warning letter. The company's proposed “interim monitoring activities and proposed future testing” wouldn't ensure that the devices can meet “validated accuracy performance requirements,” the FDA said. Abbott must “take prompt action to address any violations identified in this letter,” the FDA added. Abbott said in a statement to Fierce MedTech that it is \"committed to maintaining the highest standards of quality and reliability for people living with diabetes who depend on our technology every day. We take this matter seriously and are working diligently to address the FDA’s observations.\" Back in November, Abbott launched an effort to replace some of its FreeStyle Libre 3 CGMs—following reports of hundreds of injuries and seven deaths worldwide—after some sensors showed they may provide incorrect readings that could prompt users to skip insulin doses. Last month, Abbott’s full-year and fourth-quarter results saw its nutrition and diagnostics units drag on sales as the medtech continues to try to escape the headwinds from a China downturn, a post-COVID sales slump and the loss of a government contract for its nutrition business.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/fiercebiotech/1644250057/ABBOTT-SIGN.jpg/ABBOTT-SIGN.jpg?VersionId=zfwQzHQfpu0DVb8BAlItFmS.I8Qcvq1f"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Preclinical stem cell biotech takes SPAC route to Nasdaq",
      "url": "https://www.fiercebiotech.com/biotech/preclinical-stem-cell-biotech-primegen-takes-spac-route-nasdaq",
      "published": "2026-02-08T10:04:49.722798+00:00",
      "summary": "Stem cell therapy biotech PrimeGen US is taking the less-traveled SPAC route to the public markets.",
      "content_text": "Stem cell therapy biotech PrimeGen US is taking the less-traveled special purpose acquisition company (SPAC) route to the public markets. The California biotech, which is working on preclinical stem cell therapies for liver disease and other serious conditions, is merging with DT Cloud Star Acquisition. The SPAC listed on the Nasdaq in 2024 with a $69 million IPO. Since then, Brooklyn-based DT Cloud Star has been on the hunt for a suitable company to merge with. The merger with PrimeGen is expected to complete in the second half of the year, according to a Feb. 4 filing with the Securities and Exchange Commission. “We are thrilled to partner with DT Cloud Star to bring PrimeGen US into the public markets at this pivotal moment,” PrimeGen co-CEO Daniel Chiu said in the filing. “This transaction is expected to enhance our access to capital and resources, supporting the continued development of our stem cell and exosome programs.” “Our team’s scientific focus and innovation position us to further build our presence in the regenerative medicine field,” Chiu added. PrimeGen has been developing triple-activated mesenchymal stem cells as a potential treatment for acute liver injury and related conditions. The company has touted therapeutic activity in animal studies and met with the FDA in December to seek approval to take a candidate for acute alcoholic hepatitis into human trials. In this morning’s filing, DT Cloud Star CEO Sam Zheng Sun said the SPAC has “great confidence” PrimeGen is “uniquely positioned to deliver much-needed regenerative medicine to treat challenging diseases, such as acute liver failure.” “By leveraging PrimeGen’s nearly two decades of research and their triple activated MSC platform, we believe the combined entity will successfully capture large unmet market opportunities and provide significant value to patients and shareholders alike,” the CEO added. SPAC deals have become a rare sight in recent years, despite a number of high-profile announcements as recently as 2022. Last year brought a few examples of biotechs planning to use this route to go public, including German antibody biotech Veraxa , BridgeBio Oncology Therapeutics and Singapore-based Nanyang Biologics .",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-1279507600.jpg?VersionId=oyLmrp3XkzMw1uqzb7FObChGmLhliEyf"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Hims & Hers to sell Grail’s Galleri multi-cancer blood test via its digital health platform",
      "url": "https://www.fiercebiotech.com/medtech/hims-hers-sell-grails-galleri-multi-cancer-blood-test-its-digital-health-plan",
      "published": "2026-02-08T10:04:49.722778+00:00",
      "summary": "Telehealth company Hims &amp; Hers has added Grail’s blood cancer test Galleri to its offerings.",
      "content_text": "Telehealth company Hims & Hers has added Grail’s blood cancer test Galleri to its offerings as the medtech has now sent off data for a potential FDA approval. Galleri works as a simple blood test that can detect a range of cancers and is designed for use in people over the age of 50 years old. The concept is to pick up cancers earlier, potentially before symptoms arise, with annual testing. If a cancer is found, this increases the likelihood of it being treated earlier and with a higher probability of treatments being curative. The test is not yet FDA approved—though Grail just days ago sent off its tranche of data to the FDA for review—but has been available commercially via several telehealth testing services, including Everlywell, since 2021. Now, Hims & Hers will also sell the test. “This multi-cancer early detection (MCED) test combines Hims & Hers’ scale with Grail’s innovative cancer screening technology to dramatically increase access to proactive care,” Hims & Hers said in a Feb. 4 statement . Starting today, the company’s customers can add Galleri onto existing Labs plans at “a $250 discount to the Galleri list price,” Hims & Hers said. The current list price for the test is $949. “We know that cancers found early, before they’ve spread, can potentially have better outcomes than those caught later after the cancer has spread,” Pat Carroll, M.D., chief medical officer at Hims & Hers, said in a release. “With access to this new, innovative screening technology, we’re empowering customers to tackle health challenges when treatment can be more manageable and more successful.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/fiercebiotech/1620062127/Grail.jpg?VersionId=8ErvariWRSThdWdH3o2ZyGfCCjD2AaKM"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Novartis nixes 6 ph. 1 assets, adds 2 new cancer candidates",
      "url": "https://www.fiercebiotech.com/biotech/novartis-shakes-early-pipeline-6-assets-nixed-and-2-new-cancer-candidates",
      "published": "2026-02-08T10:04:49.722760+00:00",
      "summary": "Novartis has nixed six early-stage pipeline programs, swapping in two new phase 1 cancer candidates as replacements.",
      "content_text": "Novartis has nixed six early-stage pipeline programs, swapping in two new phase 1 cancer candidates as replacements. The six assets don’t appear in Novartis’ Feb. 4 earnings presentation (PDF). A company spokesperson confirmed to Fierce Biotech that they have been discontinued. Four of the dropped assets are in solid tumor indications, and include AAA802 in prostate cancer, MGY825 in non-small cell lung cancer and KFA115 and HRO761 in unspecified solid tumors, according to a Novartis presentation (PDF) from the third quarter of 2025. The other two culled candidates are DFV890, an NLRP3 inhibitor in development for low-risk myelodysplastic syndrome, and PIT565 for B-cell malignancies. “We continually assess opportunities within our portfolio to ensure we are advancing only the highest value medicines with transformative potential for patients,” the Novartis spokesperson told Fierce. “A recent review of our R&D projects resulted in decisions to discontinue a select number of research and early clinical projects.” These pipeline culls are “balanced by the addition of new projects entering our pipeline,” the spokesperson added. “We continue to advance approximately 99 projects in clinical development.” The two new phase 1 programs are AMO959, a prostate cancer candidate targeting DNA repair, and a solid tumor candidate of undisclosed mechanism called GCJ904. The Swiss drugmaker recently turned some R&D attention to the brain, inking a $1.7 billion pact with SciNeuro Pharmaceuticals for an antibody program designed to shuttle Alzheimer's disease therapies into the tough-to-reach organ. Novartis is pitching in research funding as the partners work on the program together, with the Big Pharma then set to take over development and advance towards commercialization if all goes well. That brainy deal came not long after Novartis reneged on another , handing two discovery-stage programs back to neurology-focused biotech Voyager Therapeutics in December. Novartis’ CEO Vas Narasimhan, M.D., told Fierce in November that the company wants to be “one of the leaders in neuromuscular diseases,” which is why they swung big to snag muscular dystrophy biotech Avidity Biosciences for $12 billion last October.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-1412148116.jpg?VersionId=ZaX3zaLJZ7GwlrpTUFtOLyFu3CIlJThq"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Lilly drops 3 clinical programs, including Prevail gene therapy",
      "url": "https://www.fiercebiotech.com/biotech/lilly-drops-3-pipeline-drugs-including-gene-therapy-1b-prevail-buyout",
      "published": "2026-02-08T10:04:49.722739+00:00",
      "summary": "As Eli Lilly awaits an FDA approval decision for its oral GLP-1 orforglipron, the pharma has discarded three clinical-stage drugs, including a gene therapy from its $1 billion acquisition of Prevail Therapeutics.",
      "content_text": "As Eli Lilly awaits an FDA approval decision for its oral GLP-1 orforglipron, the pharma has discarded three clinical-stage drugs, including a gene therapy from its $1 billion acquisition of Prevail Therapeutics. The therapy was being studied as a treatment for a specific type of frontotemporal dementia (FTD) that relates to changes in the progranulin (GRN) gene. Aptly named FTD-GRN, the neurodegenerative disease is primarily inherited and can lead to changes in behavior and executive functioning. Lilly’s gene therapy for the condition stems from its $1 billion-plus buyout of Prevail Therapeutics back in 2020. Dubbed LY3884963—and formerly known as PR006—the therapy entered a phase 1/2 trial in 2020 and was in the later stage of the study. The trial included five different treatment cohorts across various doses, dosing manners and phases of disease. “Lilly discontinued GRN gene therapy in frontotemporal dementia due to a lack of compelling efficacy in the studied patient population. The decision was not due to any safety concern,” a spokesperson told Fierce. The study was slated for a primary readout in 2031, according to ClinicalTrials.gov . The trial’s main goal was to assess the safety and effect of the therapy on GRN levels. Patients already enrolled in the study will be included in a safety follow-up period, according to the Lilly spokesperson. “We aim to leverage insights gained from this program in upcoming interventions and are planning to share the data at a forthcoming scientific meeting,” the spokesperson added. The big pharma is still continuing development for several other gene therapies, including a mid-stage GBA1 gene therapy that Prevail had touted as its lead asset. The candidate is being studied in trials for both Parkinson’s disease and Gaucher disease type 1. And just last week, Lilly inked a deal potentially worth more than $1 billion to get in on the development of a genetic medicine for hearing loss from Seamless Therapeutics. Next on the chopping block is LY3541860, an anti-CD19 antibody tested out in mid-stage studies for both multiple sclerosis (MS) and rheumatoid arthritis (RA). In the RA trial, the autoimmune asset was being evaluated for its ability to impact disease activity compared to baseline among 35 patients, according to ClinicalTrials.gov . The phase 2a study’s primary readout was scheduled for November of last year. “The termination was not safety-driven,” Lilly’s spokesperson said. “The asset did not meet Lilly’s high bar for continued development.” Meanwhile, the MS phase 2a/2b trial for LY3541860 is slated to readout in August of 2027, according to the federal database. The expected four-year study aimed to enroll 200 patients and was most recently listed as \"recruiting.\" Previously, preclinical models demonstrated that the anti-CD19 antibody was a “highly potent B cell inhibitor that may have potential to demonstrate improved efficacy over currently available B cell-targeting therapies in treatment of autoimmune conditions without causing B cell depletion.” Lastly, Lilly is ditching AC-225-PSMA-62, an investigational radioligand therapy that was being studied in a phase 1/2 trial for prostate cancer. More specifically, the trial enrolled patients with prostate-specific membrane antigen (PSMA)-positive cancer with limited spread. The study’s primary readout was scheduled for September 2027. AC-225-PSMA-62 didn’t meet Lilly’s “bar for differentiated efficacy to advance to phase 2,” according to the spokesperson. The termination wasn’t related to “any new or unexpected safety findings,” they added. When asked if any layoffs were associated with the pipeline cuts, the spokesperson said, “There are no large-scale workforce reductions underway at Lilly. We continuously evaluate our business model and routinely make workforce adjustments to enhance our speed, agility and ability to deliver the best medicines to patients.” In the most recent quarter, Lilly’s R&D spend rose 26% to $3.8 billion, or 20% of revenue, according to the company’s earnings report. Over the last few years, the tirzepatide developer has zeroed in on its next-gen obesity candidates, including small molecule orforglipron. Lilly has snared a Commissioner’s National Priority Voucher that could accelerate an approval decision for orforglipron.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2167259447.jpg?VersionId=ccE6ffaZ.I2p7gMV.vYOROzUpFc.XBqQ"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "FDA’s rare pediatric voucher program revived by funding bill",
      "url": "https://www.fiercebiotech.com/pharma/fdas-rare-pediatric-disease-voucher-program-revived-2026-government-funding-bill",
      "published": "2026-02-08T10:04:49.722716+00:00",
      "summary": "By signing a government funding bill that ended a partial shutdown, President Donald Trump has also reauthorized a beloved program meant to speed the development of new drugs for rare childhood diseases.",
      "content_text": "By signing a government funding bill that ended a partial shutdown, President Donald Trump has also reauthorized a beloved program meant to speed the development of new drugs for rare childhood diseases. The Consolidated Appropriations Act of 2026, signed by Trump on Feb. 3, includes a provision reinstating the Mikaela Naylon Give Kids a Chance Act and reviving the rare pediatric disease (RPD) priority review voucher program. The program will now be funded through September 2029. These vouchers slash the FDA’s review time of new drug applications and can also be sold by recipients for steep prices . Established in 2012, 63 RPD vouchers have been awarded across 47 rare diseases, ranging from Duchenne muscular dystrophy to hemophilia A, according to the National Organization for Rare Disorders (PDF). The program’s initial authorization expired on Dec. 20, 2024, and Congress has struggled to reauthorize it since then. “The passage of the Mikaela Naylon Give Kids a Chance Act is a bipartisan victory for children and families living with rare diseases,” John Crowley, president and CEO of the Biotechnology Innovation Organization, said in a Feb. 3 statement. The Rare Disease Company Coalition (RDCC), a group of biopharmas including Kyowa Kirin, BioMarin, BridgeBio, Alkermes, argenx, Sarepta Therapeutics and more, also expressed excitement at the act’s passage. “This milestone brings renewed hope to families awaiting lifesaving treatments for children with rare diseases and reaffirms a bipartisan commitment to advancing innovation for pediatric patients who urgently need therapeutic breakthroughs,” Stacey Frisk, executive director of the RDCC, said in a Feb. 3 statement . U.S. Representative Michael McCaul, R-Texas, introduced legislation to bring back the vouchers in February 2025, with the House finally okaying the measure by unanimous assent in December. But that victory was short-lived, with the bill ultimately stalled in the Senate.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/Featured%20Images%20-%20Fierce%20Healthcare%20-%202024-09-25T135647.552.jpg?VersionId=lq570SshFNMgqy.J23tNIGUCUD07vAS9"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Eikon upsized $381M listing marks largest biotech IPO since 2024",
      "url": "https://www.fiercebiotech.com/biotech/eikons-upsized-381m-nasdaq-listing-marks-largest-biotech-ipo-2024",
      "published": "2026-02-08T10:04:49.722696+00:00",
      "summary": "Eikon Therapeutics is heading to the Nasdaq this morning with an upsized $381 million IPO in a further sign of the renewed appeal of the public markets.",
      "content_text": "Eikon Therapeutics is heading to the Nasdaq this morning with an upsized $381 million IPO in a further sign of the renewed appeal of the public markets. The oncology biotech will offer 21.2 million shares for the IPO—above the 17.6 million shares the company had expected to offer when it sketched out its plans last week. Those shares will be priced at $18 apiece, at the upper end of the $16 to $18 range it had predicted. The IPO should bring in gross proceeds of $381 million, above the $273.5 million net proceeds Eikon had been banking on last week. This windfall could rise by a further $57.2 million should underwriters fully take up their 30-day option of buying an additional 3.2 million shares at the same price. At $381 million, Eikon looks set to be the largest biotech IPO since 2024, overtaking Aktis Oncology’s $318 million offering last month. The California-based company has already set out its plans for spending the proceeds, with the biggest priority labeled as the clinical development of EIK1001. The toll-like receptor 7 and 8 agonist immune modulator, which Eikon acquired from Seven and Eight Biopharmaceuticals, is currently being tested in a phase 2/3 trial in combination with Keytruda for advanced melanoma and a phase 2/3 study for non-small cell lung cancer. Behind EIK1001 is a pair of PARP1 inhibitors, dubbed EIK1003 and EIK1004, which Eikon licensed from Chinese biotech Impact Therapeutics. These candidates are being trialed in phase 1/2 studies for ovarian, breast, prostate and pancreatic cancers, with EIK1004 also being assessed against brain metastases and primary brain malignancies due to its ability to cross the blood-brain barrier. The fourth clinical candidate is an in-house WRN helicase inhibitor called EIK1005, which is in phase 1/2 development for solid tumors. Eikon announced itself in 2021 with former Merck & Co. exec Roger Perlmutter, M.D., Ph.D., at the helm and quickly established itself as an energetic fundraiser. The biotech corralled $517 million in 2022, $106 million in 2023 and $350 million in February 2025. Eikon will be the second biotech working on new drugs to go public in 2026. The company’s leadership will likely be hoping to enjoy similar success to Aktis—the radiopharmaceutical developer’s shares continued to trade this week above their $18 debut price. So far this year, eye-focused SpyGlass Pharma and Belgian immunology biotech Agomab Therapeutics have also announced IPO plans. The string of announcements in recent weeks give credence to the predictions made by industry observers to Fierce last year that the IPO window could finally be reopening in 2026.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-502001684.jpg?VersionId=I2Rgu0ckI3Tp02ilr7awmna5nQpUbZ8G"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Quell halts transplant trial to focus on 'chill not kill' Treg",
      "url": "https://www.fiercebiotech.com/biotech/quell-halts-liver-transplant-treg-trial-focus-preclinical-chill-not-kill-candidate",
      "published": "2026-02-08T10:04:49.722675+00:00",
      "summary": "Quell Therapeutics is pressing pause on an engineered regulatory T-cell therapy for liver transplant patients in order to focus resources on a preclinical autoimmune candidate.",
      "content_text": "Quell Therapeutics is pressing pause on an engineered regulatory T (Treg) cell therapy for liver transplant patients in order to focus resources on a preclinical autoimmune candidate. The London- and Boston-based biotech had been evaluating QEL-001, an autologous engineered CAR-Treg therapy, in a phase 1/2 trial to see whether the candidate can stop organ rejection and end the need for lifelong immunosuppression among liver transplant patients. At one point, the company had touted QEL-001 as a “potentially transformational paradigm for these patients” that could “bring targeted and durable immune tolerance and eliminate their need for chronic immunosuppression.” But Quell has decided to pause the study, according to an quarterly update from life sciences investor Syncona, which owns a 33.7% stake in the biotech. Instead, the capital earmarked for QEL-001 has been rerouted to another CAR-Treg called QEL-005. Quell has previously branded QEL-005 as “pipeline-in-a-product for complex rheumatic autoimmune diseases.” QEL-005 has yet to enter the clinic, although Quell has plans to launch a phase 1 study in patients with rheumatoid arthritis and systemic sclerosis in the first half of this year. Quell describes the approach of QEL-005, which uses a CD19 CAR and is intended to reduce modulating multiple immune cell types rather than simply kill B cells, as “chill not kill.” While QEL-001’s future looks in doubt, Quell said data from the phase 1 study had “provided the company with key insights that de-risk the QEL-005 [program], which could access a potentially larger commercial opportunity.” Syncona noted that the switch in strategy would push back Quell’s key inflection point from this year into 2027, but the investor said it is “encouraged by the technical progress in the field and supports management’s decision to allocate capital to the [program] with the best risk adjusted return.” Quell’s founding hypothesis is that Treg cell therapies can stop immune attacks in a targeted way. The idea combines the role Tregs play in the body, where they calm unwanted immune responses, with CARs like the targeting technology that enables cancer cell therapies. The biotech has found a willing Big Pharma partner in the form of AstraZeneca, which paid $85 million upfront in 2023 to enter into an exclusive option and license agreement for assets in Type 1 diabetes and inflammatory bowel disease.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/QUELL-4.jpg?VersionId=rmCwQj47MbLMha3B1OJmzepwcy_XFA2k"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Flagship-founded antibody biotech Generate is latest to mull IPO",
      "url": "https://www.fiercebiotech.com/biotech/flagship-founded-antibody-biotech-generate-latest-mull-ipo",
      "published": "2026-02-08T10:04:49.722657+00:00",
      "summary": "Clinical-stage antibody company Generate:Biomedicines is the latest biotech to mull going public as momentum for IPOs continues to build.",
      "content_text": "Clinical-stage antibody company Generate:Biomedicines is the latest biotech to mull going public as momentum for IPOs continues to build. The Flagship-founded biotech has yet to set out how many shares it plans to offer—or at what price. But Generate used a filing with the Securities and Exchange Commission yesterday to explain that top of the list of priorities for the IPO proceeds will be GB-0895. The anti-TSLP antibody is currently being evaluated in a pair of phase 3 studies aiming to enroll about 1,600 patients with severe asthma as well as in a phase 1 trial for chronic obstructive pulmonary disease. The asset has been engineered with the help of artificial intelligence to give it an extended half-life, with the aim of developing a long-acting therapy that only needs to be dosed every six months. Announcing the launch of those phase 3 trials in December, Generate CEO Mike Nally said GB-4362 demonstrated “the potential of programmable biology to design optimal molecular solutions for patients with unprecedented speed and intentionality—in this instance, showing how an antibody engineered with AI can achieve a potentially best-in-class profile and advance into phase 3 studies within just four years.” Funds will also be set aside to continue to take two less advanced candidates into the clinic. One of these, dubbed GB-4362, is a monoclonal antibody designed to neutralize free monomethyl auristatin E (MMAE) as an adjunctive therapy to antibody-drug conjugates with an MMAE payload. The other, called GB-5267, is an armored, MUC16-directed CAR-T cell therapy developed in collaboration with Roswell Park Comprehensive Cancer Center and initially being aimed at platinum-resistant ovarian cancer. Founded by Flagship in 2018 as a machine-learning-enabled drug discovery player under the leadership of Merck & Co. veteran Nally, Generate has had no problem attracting both investor interest and Big Pharma backing. In 2022, Amgen inked an agreement worth up to $1.9 billion biobucks to develop five initial programs, leaving room for the potential to nominate up to five more programs later. Amgen has already taken up its option in part, with the pair currently working on six undisclosed programs together. Then, in 2024, Novartis inked a deal potentially worth more than $1 billion to develop protein therapeutics across multiple indications. The biotech brought in $370 million via a series B back in 2021 followed by $273 million in a series C in 2023. The opening weeks of 2026 have seen a renewed enthusiasm by biotechs for going public. Aktis Oncology kicked off the proceedings with a $318 million IPO last month, while Eikon Therapeutics listed on the Nasdaq this morning with a $381 million offering—both of which exceeded any of the handful of IPOs last year. Tuesday, Veradermics said it in IPO proceeds, and its share price jumped more than 100% in subsequent trading. The company is focused on common aesthetic and dermatological conditions; its lead program is an oral, extended-release version of the popular hair loss brand Rogaine. As for Generate, the company is joining a queue of other biotechs that have announced an interest in a public listing, including eye-focused SpyGlass Pharma and Belgian immunology biotech Agomab Therapeutics.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/IPO.jpg?VersionId=_cpqW9EhbIouF4SWLEJJdiUntOWDYNqc"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Fierce Biotech Fundraising Tracker 2026",
      "url": "https://www.fiercebiotech.com/biotech/fierce-biotech-fundraising-tracker-26",
      "published": "2026-02-08T10:04:49.722638+00:00",
      "summary": "The Fierce Biotech Fundraising Tracker records venture capital rounds of $50 million or more secured by biotechs.",
      "content_text": "A new year brings a fresh Fierce Biotech Fundraising Tracker designed to record the significant amount of venture capital that flows into biopharma. We’re keeping the same guidelines used for last year’s tracker and will only include financing rounds of $50 million and above. February Feb. 5—Angitia Biopharmaceuticals Series: D Amount: $130M Investors: Frazier Life Sciences, Venrock Healthcare Capital Partners, Ascenta Capital, certain funds and accounts managed by Blackrock, BVF Partners, Logos Capital, RA Capital Management, Wellington Management. Bain Capital Life Sciences, Elikon Venture, Janus Henderson Investors, 3H Health Investment, Hillhouse Investment, Legend Capital, Morningside Group, OrbiMed, TF Capital and Yonghua Capital. Angitia has unveiled its second mega-round in 14 months, revealing a $130 million series D financing that positions the biotech to take three bone disease prospects deeper into the clinic. The biotech has advanced three candidates into phase 2 and 3 clinical trials. The pipeline is spearheaded by AGA111, a recombinant human BMP-6 protein that is in a phase 3 trial in patients undergoing lumbar interbody fusion. Story Feb. 4—Third Arc Bio Series: A extension Amount: $52M Investors: New investor Andreessen Horowitz (a16z) leads the extension with Omega Funds; additional investors include Life Sciences at Goldman Sachs Alternatives, BVF Partners, funds managed by abrdn, accounts advised by T. Rowe Price Associates, Marshall Wace, Hillhouse Investment, Galapagos, AbbVie Ventures and Alderline Group. Third Arc is extending its $165 million series A financing raised in 2024, adding on a $52 million extension for a total of $217 million. The biotech will use the new cash infusion to continue developing multifunctional antibodies for oncology and immunology & inflammation conditions. The biotech's lead program, coded ARC101, is a bispecific T cell engager currently in a phase 1 trial for solid tumors. Release January Jan. 29—Tenpoint Therapeutics Series: B Amount: $85M Investors: Janus Henderson, EQT Nexus, Hillhouse, British Business Bank, EQT Life Sciences, Sofinnova Partners, F-Prime, Eight Roads, Qiming Venture Partners USA, AdBio and Wille. With its eye drops for the age-related eye disease presbyopia just approved on Jan. 28, Tenpoint is now taking in $85 million to help launch the product, called Yuvezzi. The company plans to release the recently approved med in the second quarter of 2026. Story Jan. 29—Breakthru Medicine Series: A Amount: $60M Investors: N/A Breakthru has emerged from stealth with $60 million, a molecular glue platform, and a pipeline of small molecules and antibody-drug conjugate payloads. The biotech was formed by Steve Potts, Ph.D.; Mark Mulvihill, Ph.D.; and Brian Barnett, M.D., in efforts to develop \"disruptive therapeutic modalities\" for cancer patients with high unmet need. Breakthru did not share any information about its investors or further details regarding its programs. Release Jan. 27—TRexBio Series: N/A Amount: $50M Investors: Janus Henderson Investors, Balyasny Asset Management, Affinity Asset Advisors, Alexandria Venture Investments, Avego BioScience Capital, Delos Capital, Eli Lilly, Johnson & Johnson Innovation – JJDC, Pfizer Ventures, Polaris Partners and SV Health Investors. TRexBio has raised $50 million to support its Treg platform, which is designed to develop treatments for autoimmune and inflammatory diseases. These include TRB-061, a TNFR2 agonist currently being tested in a phase 1a/b trial for atopic dermatitis. The new cash will also go toward TRB-071 and TRB-081, which are both expected to launch in separate phase 1 trials in 2027. Release Jan. 22—Corxel Pharmaceuticals Series: D Amount: $287M Investors: SR One, TCGX, RA Capital Management, HBM Healthcare Investments, SymBiosis, Adage Capital Management, Invus, SilverArc Capital, RTW Investments, Hengdian Group Capital and others. In a reminder of the money still on the table for enticing obesity assets, Corxel Pharmaceuticals has raised $287 million to bankroll phase 2 studies of its oral GLP-1 receptor agonist. Shanghai-headquartered Corxel licensed the ex-China rights to the drug, dubbed CX11, from biotech Vincentage in late 2024. Vincentage has already launched a phase 3 study of CX11 in China, while Corxel is running a phase 2 trial in the U.S. in patients with overweight and obesity. The series D will be used to finance a planned global phase 2 study in patients with Type 2 diabetes as well as support Corxel’s plans for its own phase 3 trials. Story Jan. 22—Mendra Series: A Amount: $82M Investors: OrbiMed, 8VC, 5AM Ventures, Lux Capital and Wing VC. A new AI biotech with a focus on rare disease is taking off in the Bay Area. The company is co-founded and led by BioMarin vet Joshua Grass, who previously served as CEO at Modis Therapeutics and Escient Pharmaceuticals. Mendra will use the series A haul to buy rare disease candidates for its portfolio and then plans to use AI to speed up clinical development. Release Jan. 21—Think Bioscience Series: A Amount: $55M Investors: Regeneron Ventures, Innovation Endeavors, Janus Henderson Investors, T.A. Springer, CE-Ventures, MBX Capital, YK Bioventures, AV8 Ventures, CU Innovations and Buff Gold Ventures. The Colorado-based biotech will harness the cash to push forward its lead small molecule program for Noonan syndrome, a genetic developmental disorder characterized by atypical facial features that often comes with congenital heart disease, learning disabilities and other complications. There are currently no treatments for the disease that target the biology underpinning it. Release Jan. 20—Exciva Series: B Amount: $59M (€51M) Investors: Gimv, EQT Life Sciences, Fountain Healthcare Partners, LifeArc Ventures, Carma Fund, Modi Ventures, Andera Partners and LBBW. The German biotech will use the funds to bankroll a phase 2 study of its lead neuropsychiatric candidate for treating agitation in patients with Alzheimer’s disease. The therapy, called deraphan, is a combination of the cough suppressant dextromethorphan with a CYP2D6 inhibitor and a 5-HT2A/2C receptor inverse agonist. Release Jan. 16—Cytotheryx Series: A Amount: $60M Investors: Ouroboros Family Founders Fund I, LP Cytotheryx, a preclinical cell therapy biotech, has circled up $60 million to advance its liver disease programs toward the clinic. The new cash infusion will also help the platform company grow its manufacturing infrastructure, according to the Minnesota business. Release Jan. 13—Proxima Series: Seed Amount: $80M Investors: DCVC, NVentures (NVIDIA’s venture capital arm), Braidwell, Roivant, AIX Ventures, Yosemite, Magnetic Ventures, Alexandria Venture Investments, Modi Ventures and others. AI drug discovery outfit VantAI is rebranding to Proxima as it pockets $80 million to build a pipeline of \"proximity therapeutics,\" based on interactions between proteins. Release Jan. 12—Vibrant Therapeutics Series: N/A Amount: $61M Investors: Pfizer Ventures, Apricot Capital, Bayland Capital, HSG, Northern Light Venture Capital and First Principle Venture China and U.S.-based Vibrant will use the cash to advance a pipeline led by VIB305, a masked T-cell engager prodrug designed to treat EGFR-expressing solid tumors. VIB305 is alerady being evaluated in phase 1 clinical trials in Australia and China. Release Jan. 12—Cytotheryx Series: A Amount: $60M Investors: Ouroboros Family Founders Fund I The Minnesota-based biotech will use the financing to \"advance multiple programs into the clinic.\" Cytotheryx is using its bio-incubator platform for scalable liver cell production, as well as to develop a bioartificial liver support system for the treatment of acute liver failure, and a universal liver cell therapy designed for transplantation in patients with rare genetic and chronic liver diseases. Release Jan. 10—Kinaset Therapeutics Series: B Amount: $103 million Investors: RA Capital Management, Forge Life Science Partners, EQT Life Sciences, Vivo Capital, Schroders Capital, Willett Advisors, Pictet Alternative Advisors, Sixty Degree Capital, Atlas Venture, 5AM Ventures and Gimv. The respiratory disease-focused biotech will use the funds to finance a phase 2 dose-ranging study of frevecitinib, an inhaled dry powder pan-JAK inhibitor in development for patients with asthma. Release Jan. 9—AirNexis Therapeutics Series: A Amount: $200 million Investors: Frazier Life Sciences, OrbiMed, Life Sciences at Goldman Sachs Alternatives, SR One, Longitude Capital and Enavate Sciences, among others. AirNexis is taking flight with $200 million and a clinical-stage asset from Haisco Pharmaceutical Group that aims to treat lung disease. The PDE3/4 inhibitor is designed to expand the airways and reduce the release of inflammatory factors for patients with for chronic obstructive pulmonary disease. AirNexis paid $40 million cash for development rights to the program outside of China and Haisco now holds a 20% equity stake in the biotech. Story Jan. 9—Medipost Series: N/A Amount: $140 million Investors: Skylake Equity Partners, Crescendo Equity Partners and a Korean growth equity fund. Stem cell therapy-focused Medipost's parent company, also called Medipost, has raised $140 million to launch a phase 3 trial for its investigational mesenchymal stem cell (MSC) therapy. The trial will enroll patients with symptomatic cartilage defects and knee osteoarthritis, an inflammation-driven degenerative disease. Release Jan. 8—Parabilis Medicines Series: F Amount: $305 million Investors: RA Capital Management, Fidelity Management & Research Company, Janus Henderson Investors, Frazier Life Sciences, Soleus Capital, a life science-dedicated investment fund, venBio Partners, Cormorant Asset Management, Nextech Invest, ARCH Venture Partners, Milky Way Investments, GV, accounts advised by T. Rowe Price Associates, Inc., Marshall Wace, General Catalyst, Invus, Farallon Capital Management, Foresite Capital, Rock Springs Capital, HBM Healthcare, Samsara BioCapital, Catalio Capital Management, Sixty Degree Capital, Alderline Group and others. The Massachusetts biotech, formerly known as FogPharma, will harness the new cash to advance FOG-001, recently renamed zolucatetide, toward a pivotal phase 3 trial in desmoid tumors. Parabilis will also use the large fundraise to support the rest of its pipeline—all preclinical—as well as to build out its platform capabilities. Story Jan. 8—Alveus Therapeutics Series: A Amount: $160 million Investors: Andera Partners, New Rhein Healthcare Investors, Omega Funds, Sanofi Capital, Kurma Partners, Avego BioScience Capital and others. Looking to overcome some of the limitations of existing obesity drugs, Alveus has debuted with an impressive roster of executives ready to take the biotech’s mission forward. Launched under the stewardship of former I-Mab CEO Raj Kannan, Alveus aims to advance an undisclosed number of obesity candidates, with the dual-acting asset ALV-100 leading its current development roster. Story Jan. 8—Diagonal Therapeutics Series: B Amount: $125 million Investors: Sanofi Ventures, Janus Henderson Investors, Deep Track Capital, EcoR1 Capital, Logos Capital, Balyasny Asset Management L.P., Woodline Partners LP, Atlas Venture, BVF Partners, Lightspeed Venture Partners, RA Capital Management, Frazier Life Sciences, Viking Global Investors, RV Invest, Velosity Capital, Biovision Ventures and Checkpoint Capital. Diagonal will use the raise to move its first-in-class rare disease drug DIAG723 into a first-in-human trial, which is set to begin in the first half of this year in patients with hereditary hemorrhagic telangiectasia. The new investment will also help advance the biotech's earlier pipeline of assets, which are designed to selectively address the underlying causes of disease in conditions spanning hematology, hepatology and nephrology. Story Jan. 8—EpiBiologics Series: B Amount: $107 million Investors: Google Venture, Johnson & Johnson, Novartis Venture Fund, Aulis Capital, Avego BioScience Capital, Samsara BioCapital, Polaris Partners, Digitalis Ventures, Taiho Ventures, Vivo Capital, Codon Capital and Mission BioCapital. The San Francisco Bay Area-based biotech plans to use the cash is to take its lead bispecific antibody, dubbed EPI-326, into the clinic. The goal is to launch a clinical trial of the EGFR degrader in non-small cell lung cancer and head and neck squamous cell carcinoma early this year. Story Jan. 8—Beacon Therapeutics Series: C Amount: $75 million-plus Investors: Life Sciences at Goldman Sachs Alternatives, the Retinal Degeneration Fund, the venture arm of Foundation Fighting Blindness, Syncona Limited, Forbion, Oxford Science Enterprises and Advent Life Sciences. As the biotech awaits phase 3 data in X-linked retinitis pigmentosa for its lead candidate laru-zova, Beacon is bringing in more than $75 million to get the gene therapy across the finish line and potentially to market. The funds will also support preclinical programs in geographic atrophy, an inherited cone rod dystrophy and another undisclosed asset. Release Jan. 7—Soley Therapeutics Series: C Amount: $200 million Investors: Surveyor Capital, HRTG Partners, RWN Management, Doug Leone Family Fund, Breyer Capital and GordonMD Global Investments The South San Francisco-based company’s pipeline uses a cell stress sensing platform that harnesses artificial intelligence and “computer vision” to analyze thousands of responses in human cells. The fresh funds have been earmarked to take two of Soley’s oncology drugs into the clinic, led by an acute myeloid leukemia asset. Story Jan. 7—Rakuten Medical Series: F Amount: $100 million Investors: TaiAx Life Science Fund, Daiwa Securities, Mitsui Sumitomo Insurance, Sumitomo Mitsui Banking, ABIES Capital, Nexus CVC, OEP Group, SBI Group, Rakuten Group and Rakuten Medical CEO Mickey Mikitani San Diego-based Rakuten Medical is focused on a global phase 3 trial evaluating ASP-1929 in combination with Merck & Co.’s Keytruda as a first-line treatment for recurrent head and neck cancer. ASP-1929 consists of the anti-epidermal growth factor receptor antibody cetuximab conjugated to the light-activatable dye IRDye 700DX. Story Jan. 7—Corsera Health Series: A Amount: $80 million Investors: Forbion, Population Health Partners and others. RNAi outfit Corsera will use the raise to support its first clinical trial, a phase 1 study of PCSK9-targeting siRNA COR-1004 that just began dosing patients. The company's lead cardiovascular program also includes COR-2003, which is designed to target angiotensinogen and is set to enter a clinical trial of its own in mid-2026. The biotech's goal is to develop preventative RNAi medicines for cardiovascular health that are taken yearly. Release Jan. 7—Poplar Therapeutics Series: A Amount: $50 million Investors: SR One, Vida Ventures and Platanus The immunology company, previously known as Phylaxis Bioscience, will use the series A funds to advance its pipeline of anti-IgE therapies for food allergy and other atopic conditions. Poplar hopes its lead asset PHB-050, which is already in phase 1 trials, will offer a treatment for patients with highly elevated IgE levels who can't benefit from existing therapies. Release",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-474045836.jpg?VersionId=ZrON.9gb_kdB6Eg3v6PzrOmMBLN2o4F4"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Veradermics locks in $256M IPO, shares spike",
      "url": "https://www.fiercebiotech.com/pharma/cut-above-hair-regrowth-biotech-veradermics-locks-oversubscribed-256m-ipo",
      "published": "2026-02-08T10:04:49.722615+00:00",
      "summary": "In its initial public offering, Veradermics sold a little over 15 million shares of common stock at $17 apiece, raising a total of $256.3 million in its entry onto the New York Stock Exchange, according to a Securities and Exchange Commission filing. Veradermics is trading under the symbol \"MANE.\"",
      "content_text": "With an oversubscribed trading debut now in the books, Veradermics—developing an oral version of the molecule behind Rogaine—is well coiffed to tap into the increasingly lush opportunity for hair regrowth drugs. In its initial public offering, the Connecticut biotech sold a little over 15 million shares of common stock at $17 apiece, raising a total of $256.3 million in its entry onto the New York Stock Exchange, according to a Securities and Exchange Commission (SEC) filing. Veradermics is trading under the symbol \"MANE.\" Shares of the company soared on its public debut, closing at $37.75 a pop on Wednesday, Feb. 4—more than double the price Veradermics set for its IPO. Veradermics joins a growing class of biotechs striking out on stock markets this year, and the enthusiasm behind its public market arrival comes amid a series of broader moves by biotechs looking to develop drugs for pattern hair loss. In a sign of the growing support behind Veradermics, the company noted in its SEC filing that Eli Lilly telegraphed an interest in purchasing up to 4.9% of the number of shares issued, while investment management firm Wellington Management said it was interested in buying up to $30 million in shares at Veradermics’ IPO price point. Veradermics’ IPO comes several months after the biotech locked in a $150 million series C financing round, which the company said it would use to bolster ongoing phase 3 studies for its lead program VDPHL01, an extended-release oral formulation of minoxidil. Minoxidil was first approved in the 1980s and is more commonly known as the ubiquitous hair regrowth treatment Rogaine. Rogaine is a topical treatment, however, and nearly 90% of patients discontinue its use due to the product’s “messy” application, Veradermics has argued. The company figures this formulation gap could give its oral candidate a fighting chance in the massive market for hair loss treatments. Still, Veradermics already has some competition looming. Around the same time it closed its last financing round, Pelage Pharmaceuticals—developing its own, topical asset for pattern hair loss— secured a $120 million series B round led by Arch Venture Partners and Google Ventures. And, toward the end of 2025, Cosmo Pharmaceuticals benefited from a share price bump after it unveiled a pair of phase 3 wins for its topical cream clascoterone in male-pattern hair loss. Cosmo’s subsidiary Cassiopea won FDA approval for clascoterone in 2020 as an acne treatment under the brand name Winlevi. Veradermics is one of several biotechs to go public or plot an IPO in early 2026. Thursday, Eikon Therapeutics embarked onto the Nasdaq with an upsized $381 million IPO. The oncology drug developer is offering 21.2 million shares in its debut, above the 17.6 million shares it had said it planned to offer last week. Meanwhile, Flagship Pioneering-founded Generate:Biomedicines is also weighing going public. While the biotech has yet to determine the number of shares it will offer, or at what price, Generate noted in a SEC filing Wednesday that the proceeds would primarily be used to support its anti-TSLP antibody GB-0895, which is currently running through two phase 3 studies in severe asthma, plus an early-stage trial in chronic obstructive pulmonary disease. In a further sign of the brightening appeal of the public markets, Aktis Oncology also pulled off an IPO last month, while outfits like ophthalmology-focused SpyGlass Pharma and immunology biotech Agomab Therapeutics have expressed a recent interest in doing so.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-462756183%20%281%29.jpg?VersionId=RwO47rmBQk9RuSW33NvTg_hQQQqznKsh"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Angitia raises $130M to advance bone-building bispecifics",
      "url": "https://www.fiercebiotech.com/biotech/angitia-raises-130m-challenge-amgen-bone-building-bispecifics",
      "published": "2026-02-08T10:04:49.722594+00:00",
      "summary": "Angitia Biopharmaceuticals has unveiled its second mega-round in 14 months, revealing a $130 million series D financing that positions the biotech to take three bone disease prospects deeper into the clinic.",
      "content_text": "Angitia Biopharmaceuticals has unveiled its second megaround in 14 months, revealing a $130 million series D financing that positions the biotech to take three bone disease prospects deeper into the clinic. Led by people who learned the bone business at companies including Amgen, Eli Lilly and Pfizer, Angitia has advanced three candidates into phase 2 and 3 clinical trials. The pipeline is spearheaded by AGA111, a recombinant human BMP-6 protein that is in a phase 3 trial in patients undergoing a spinal fusion. A Chinese study of the candidate has a final completion date of November on ClinicalTrials.gov, while the primary completion date was scheduled for the end of last year. Yet, like when the company raised a $120 million series C round in 2024, Angitia gave top billing in its press release to a pair of earlier-phase prospects, AGA2118 and AGA2115. Both assets are bispecific antibodies targeting sclerostin and DKK1, key negative regulators of Wnt signaling in bone. Sclerostin is the target of Evenity, an Amgen product the FDA approved in 2019 to treat osteoporosis in postmenopausal women at high risk of fracture. DKK1 has been recognized as a potential bone disease target for years—Pfizer trialed an inhibitor of the protein in 2011—but Leap Therapeutics and Junshi Biosciences have shifted the focus to its role in cancer in recent years. Neutralizing sclerostin and DKK1 could boost bone formation and suppress bone resorption. Combined, the mechanisms could drive increases in bone mineral density. Angitia recently completed enrollment in a phase 2 study of AGA2118 in osteoporosis, and dosed the first patient with AGA2115 in a phase 2 trial in osteogenesis imperfecta. Phase 2 osteoporosis data are due next year. Osteogenesis imperfecta, colloquially called brittle bone disease, has thwarted earlier R&D programs. A pair of late-phase trials of Ultragenyx Pharmaceutical and Mereo BioPharma’s setrusumab missed their primary endpoints at the end of 2025. Setrusumab inhibits sclerostin. Amgen is testing its sclerostin inhibitor, Evenity, in a phase 3 osteogenesis imperfecta trial. The biotech terminated a phase 3 osteogenesis imperfecta trial of Xgeva over safety concerns in 2022. Angitia could face competition in both the indications targeted by its bispecifics, with multiple companies already vying for the osteoporosis market, but its dual mechanism of action could provide an edge. Frazier Life Sciences and Venrock Healthcare Capital Partners see the programs’ promise, co-leading the series D round with assists from new investors including Ascenta Capital, BVF Partners, Logos Capital, RA Capital Management and Wellington Management. Bain Capital Life Sciences, which led the series C, and other existing investors returned for the latest financing round.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2150330615.jpg?VersionId=EnMJ_vwuH9likFiyo5DRsIXhesixuvmt"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "GE Healthcare posts higher full-year revenues amid turbulent tariff times",
      "url": "https://www.fiercebiotech.com/medtech/ge-healthcare-posts-higher-full-year-revenues-amid-turbulent-tariff-times",
      "published": "2026-02-08T10:04:49.722572+00:00",
      "summary": "GE HealthCare posted higher revenues for the fourth quarter and year-end as backlog orders stack up and the impact of an ongoing tariff battle initiated by the White House appears to be decreasing.<br />",
      "content_text": "GE HealthCare posted higher revenues for the fourth quarter and year-end as backlog orders stack up and the impact of an ongoing tariff battle initiated by the White House appears to be decreasing. Revenues for the quarter jumped 7.1% to $5.7 billion from $5.3 billion for the same period a year ago. Total revenues for the year rose 4.8% to $20.6 billion from $19.7 billion in 2024. Fourth-quarter adjusted earnings were $1.44 per share, beating Wall Street estimates of $1.43. For the full year, adjusted earnings per share rose 2.2% to $4.59. The company also released its full-year guidance for 2026, forecasting year-over-year organic growth of between 3% and 4% and an adjusted earnings per share falling in a range of $4.95 to $5.15. The company said it expects the impact from tariffs to be lower than what it experienced last year. It previously pegged that bite to be around $265 million. “When tariffs hit, we took action not only to reduce tariff exposure, which is something we spent a lot of energy and effort on, but we also did some self-help cost management across the business,” James Saccaro, GE HealthCare’s chief financial officer and a vice president, said during its earnings call Wednesday, Feb. 4 “Now moving to '26, we're going to see many of those things (such as cost management and improved product business) resulting in positive impacts in our numbers again without the drag of incremental tariffs because now tariffs are neutral to positive to our financial performance.” As part of its efforts to mitigate the impact of tariffs imposed by the Trump administration, the company trimmed shipments between the U.S. and China to help offset most of its 2025 tariff costs and focus on more local-for-local manufacturing across its 43 international sites. During the earnings call, the company said it is taking a cautious approach to China this year and expects to see a decline in business there. “I think it's a good perspective on how we're thinking about China early in the year as this prudent approach,” Peter Arduini, president, CEO and director of GE HealthCare, said during the call. “We’re seeing improved commercial execution I think (the company has) pivoted to focus more on how we think about provincial interactions as well as the clinical selling. The Imaging division reported a 6.6% revenue gain on the year, posting $2.55 billion. Advanced Visualization Solutions tallied gained 5.9% at $1.5 billion, and Pharmaceutical Diagnostics were up 22.3% at $790 million. Patient Care Solutions fell 0.3% to $825 million on the year. Total orders rose 5.2% organically with a book-to-bill of 1.07 times. The company currently anticipates it will launch about nine products this year that Arduini described as being the biggest they’ve had in a decade. “So once we get the right global regulatory approvals, we'll be able to start bringing those into the order book,” he said. “So from that standpoint, the size of our backlog, I mean, we feel very good where we're positioned here as we start the year.”",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2022152397.jpg?VersionId=gWqoey6ndF4bM5noCvVPaI0T6MjS.0Zy"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Astellas lifts forecast as Vyloy surge counters trial miss",
      "url": "https://www.fiercebiotech.com/pharma/astellas-tops-expectations-vyloy-sales-surge-outshines-trial-setback",
      "published": "2026-02-08T10:04:49.722553+00:00",
      "summary": "Astellas surpassed market expectations in its third-quarter fiscal year 2025 results, as first-in-class cancer drug Vyloy defied a trial setback to deliver quadrupled sales.",
      "content_text": "Astellas surpassed market expectations in its third-quarter fiscal year 2025 results, as first-in-class cancer drug Vyloy defied a trial setback to deliver quadrupled sales. As the first CLDN18.2 agent to reach the market, Vyloy saw sales swell (PDF) 426% to 19.5 billion Japanese yen ($125 million) during the last three months of calendar year 2025, which marked Astellas’ Q3. In a Wednesday note, Jefferies analysts said they were “impressed by the rapid rise in demand” for the stomach cancer treatment. The strong performance from Vyloy helped Astellas beat analysts’ expectations for total third-quarter sales by 8%, according to Jefferies. Vyloy’s commercial surge comes after Astellas reported a midstage trial failure for the antibody in pancreatic cancer in October. At that time, Astellas said the impact of the trial setback on its financial results for the year was expected to be minor. Moving into the earnings report, Astellas booked a loss of 12.8 billion yen ($82 million) in Q3, tied to the discontinuation of the pancreatic cancer program. Also in pancreatic cancer, Astellas terminated ASP4396, a phase 1 KRAS G12D program, to focus on setidegrasib (ASP3082), another KRAS G12D protein degrader. The difference between the two drugs lies in their E3 ligase design. The prioritization decision was made because ASP4396’s data have yet to top its counterpart’s, despite being later in development, Astellas’ R&D chief Tadaaki Taniguchi said on a Feb. 4 earnings call. A combination of setidegrasib and chemo recently posted a 58.3% objective response rate among 12 patients in first-line pancreatic cancer. Based on the results, Astellas plans to launch a phase 3 study in the indication by March, and it’s also planning registrational studies in non-small cell lung cancer. Astellas would like to accelerate the development of setidegrasib in pancreatic cancer, Taniguchi said, noting that its competitor, Revolution Medicines , has not started a first-line pivotal study. Last year’s clinical setback apparently didn’t dampen enthusiasm around the use of Vyloy in the closing months of 2025. During an investor call Wednesday, Astellas CFO Atsushi Kitamura attributed the drug’s commercial progress to “high Claudin 18 testing rates and lower-than-expected discontinuation rates.” “By focusing on the prevention of nausea and vomiting, particularly in the initial cycle, we believe we can reduce discontinuation and enhance treatment continuation rate,” he said, according to a call transcript provided by Astellas. Astellas is now testing Vyloy in combination with Merck & Co.’s Keytruda and chemotherapy in the phase 3 Lucerna trial in first-line stomach cancer. Enrolled patients have CLDN18.2-high, PD-L1-positive tumors. The company expects an interim readout in its fiscal year 2027 or later. Besides Vyloy, Pfizer-partnered Padcev contributed about a third of Astellas’ overall Q3 sales growth. Sales of the star antibody-drug conjugate jumped 45% during the quarter, reaching 60.1 billion yen ($383 million). In November, the FDA handed down a groundbreaking approval for a combination of Padcev and Keytruda as the first perioperative treatment for patients with muscle-invasive bladder cancer (MIBC) who can’t receive cisplatin-based chemotherapy. The indication was approved just a month after the FDA accepted Astellas and Pfizer’s application. On a winning streak, the Padcev-Keytruda perioperative regimen was also said to have extended the lives of MIBC patients who are cisplatin-eligible in the phase 3 Keynote-B15 (EV-304) trial. Doctors have already started using Padcev in perioperative MIBC, Claus Zieler, Astellas’ chief commercial and medical affairs officer, said during the Feb. 4 investor call. But he cautioned that, based on Astellas’ experience with past Padcev indications, there will be “a very sharp plateau” after “a very fast uptake” in the first six months of rollout as the company tries to penetrate the new patient population completely. Thanks to the strong performance of Padcev and Vyloy, Astellas raised its full-year fiscal 2025 revenue forecast by 10% to 2.1 trillion yen. The company collected 1.6 trillion in the nine months that ended in December. Padcev and Vyloy are two of Astellas’ five strategic brands, which together are nearing 500 billion yen sales on a full-year basis, Kitamura said. Astellas is pinning its future on the strategic brands—which also include menopause therapy Veozah, eye med Izervay and leukemia drug Xospata—as its Pfizer-partnered prostate cancer juggernaut Xtandi nears a 2027 U.S. patent cliff. In Q3, Veozah and Izervay expanded sales by 28% and 33%, respectively, while Xospata was relatively flat. In the pipeline, Astellas has highlighted four “primary focus flagship programs.” Besides setidegrasib, the group also includes ASP2138, a CLDN18.2xCD3 bispecific; AT845, a gene therapy designed for Pompe disease; and ASP7317, a cell therapy for geographic atrophy. In Q3, Astellas reports that it achieved proof of concept for ASP2138 in first-line stomach cancer and is now preparing to launch a phase 3 trial. “This is very good news because it means that Astellas now has a healthy-looking late-stage R&D pipeline,” the Jefferies analysts said. “This, matched with its fast-growing portfolio of on-market products, is likely to broaden the appeal of Astellas' stock to a broader group of investors.”",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/ASTELLAS2.jpg?VersionId=2r7JGxK4FSaTI7B2J5eOxdRDhojU9U9_"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Racing BMS and J&J, Bayer ties asundexian to 26% stroke decrease",
      "url": "https://www.fiercebiotech.com/biotech/racing-bms-and-jj-bayer-links-asundexian-26-stroke-reduction-unblock-path-fda",
      "published": "2026-02-08T10:04:49.722529+00:00",
      "summary": "Bayer has linked asundexian to a 26% reduction in stroke in a phase 3 study, setting the bar for Bristol Myers Squibb and Johnson &amp; Johnson’s rival factor XIa inhibitor in a blockbuster indication.",
      "content_text": "Bayer has linked asundexian to a 26% reduction in stroke in a phase 3 study, setting the bar for Bristol Myers Squibb and Johnson & Johnson’s rival factor XIa inhibitor in a blockbuster indication. The German drugmaker reported the study met its primary endpoint in November, providing a boost for the program and factor XIa inhibition more broadly after setbacks to asundexian and BMS and J&J’s rival drug candidate milvexian . Yet the lack of data in Bayer’s top-line release left unanswered questions about the clinical significance of the statistical success. Bayer answered the questions Thursday, using the International Stroke Conference 2026 in New Orleans to present data from the trial. The headline finding is that asundexian cut ischemic stroke by 26% after a noncardioembolic ischemic stroke or high-risk transient ischemic attack (TIA), also called a mini-stroke. On an earnings call in May, Stefan Oelrich, head of Bayer’s pharma division, said the company focused the phase 3 trial on the subgroup in which it saw the biggest effect in phase 2. The company reported a 36% reduction in the risk of recurrent symptomatic ischemic stroke and TIA in the phase 2 subgroup. For comparison, BMS and J&J saw a 30% relative risk reduction in symptomatic ischemic strokes in their phase 2 trial. Asundexian reduced the stroke rate in the phase 3 trial without increasing major bleeding, which affected 1.9% of people on the study drug and 1.7% of their counterparts on placebo. Bayer said the risks of minor bleeding, hemorrhagic stroke, symptomatic intracranial hemorrhage and fatal bleeding were similar on asundexian and placebo. The potential to clear clots without raising bleeding risk is central to the promise of factor XIa inhibitors. While other anticoagulants affect hemostasis and thrombosis, factor XIa inhibition could decouple the mechanisms to deliver at least comparable efficacy and better safety than existing treatments. Bayer reported the phase 3 trial met multiple secondary endpoints, including by linking asundexian to a 26% reduction in the risk of a stroke of any kind compared to placebo. The secondary analysis included hemorrhagic strokes. Bayer also hit a composite endpoint of cardiovascular death, myocardial infarction (MI) or stroke as well as the composite of death from any cause, MI or stroke. Ashkan Shoamanesh, M.D., the trial’s co-principal investigator, said in a statement that the consistent reduction in secondary events with asundexian across all types of strokes is particularly striking. The results provide confidence that asundexian, if approved, could be an important option for secondary stroke prevention across a broad range of patients, Shoamanesh said. At the J.P. Morgan Healthcare Conference in January, Bayer's Oelrich said the pharma was engaging with health authorities and aiming to win approval this year. The timeline would put Bayer “well ahead of any competitor in this space, which will allow us to clearly set the scene and once again prove what I call our secret sauce in cardiovascular because we believe that we're a true leader in this space,” Oelrich said. BMS and J&J expect to publish phase 3 results for milvexian in secondary stroke prevention in the second half of 2026. The companies are gearing up to compete for a stroke market that Guggenheim Securities analysts valued at $3 billion to $4 billion in a note to investors in November. The analysts estimated atrial fibrillation, where Bayer has already failed, is a $15 billion opportunity.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-1472458060.jpg?VersionId=X_MXn7FAd8X4zoL6U74kT7vYfH0weq7f"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Fierce Biotech Layoff Tracker 2026",
      "url": "https://www.fiercebiotech.com/biotech/fierce-biotech-layoff-tracker-2026",
      "published": "2026-02-08T10:04:49.722511+00:00",
      "summary": "As always, if you know of layoffs occurring at a biotech, please reach out to the Fierce Biotech editorial team.",
      "content_text": "Welcome to Fierce Biotech's fifth annual layoff tracker, a resource designed to keep pace with the sector's steady stream of workforce reductions. In 2025, industry layoffs continued to rise year over year, prompting the need for another edition of this article. As always, please reach out to the Fierce Biotech editorial team with any news of a biopharma workforce reduction. We are committed to protecting the anonymity of all tips, but we do conduct further reviews to verify all information we receive. Editor's note about the numbers: Layoff rounds that are part of a company's larger, already-announced reorganization are not included in the monthly total count. February Feb. 5 - ARPA-H: The federal research agency, which is designed to drive medical breakthroughs, has laid off an undisclosed number of staffers. \"To ensure the agency remains focused on this, ARPA-H continuously evaluates its operations and has adjusted the term appointments of certain staff to better align with mission needs and research priorities,\" HHS spokesperson Andrew Nixon told Fierce Biotech. \"These steps better position ARPA-H to deliver transformational health innovations.\" Feb. 2 - GSK: The U.K. pharma is trimming its R&D team, a move expected to affect fewer than 50 workers in the U.K. and fewer than 70 staffers in the U.S. The ultimate number of cuts is still subject to change as the reorganization is finalized, but no more than 350 jobs total will be affected, a company spokesperson told Fierce. Story Feb. 2 - Thermo Fisher Scientific: An ongoing layoff spree now includes a fresh set of cuts tied to a site that is shuttering in Franklin, Massachusetts. A company spokesperson told Fierce Pharma that the number of layoffs will be capped at 80 staffers. The site currently employs approximately 200 people. Following the cuts, the company expects the remaining roughly 120 employees to relocate to other facilities within the state. Story January—11 companies Jan. 30 - Bitterroot Bio: The California cardio-immunology company is restructuring as it goes from the clinic back to preclinical work, according to a post from departing CEO Pavan Cheruvu, M.D. The leader, alongside \"many\" other team members, will be impacted as Bitterroot turns \"to focus on discovery biology and translational research,\" according to the post. Last year, the biotech had launched a phase 2a trial for an immunomodulating protein drug designed to target CD47. It now appears to have abandoned the program, with Cheruvu writing that \"in biotech, even with flawless execution, biology doesn't always go according to plan.\" LinkedIn Jan. 30 - IO Biotech: The cancer vaccine specialist has brought in a financial advisor to aid in a strategic review while also implementing a \"significant reduction\" of the biotech's global workforce. At the same time, the biotech is letting go of Chief Medical Officer Qasim Ahmad, M.D., effective by the end of the day Feb. 15. Release Jan. 20 - Takeda: After a series of headcount reductions in recent years, Takeda has disclosed a new round of cuts expected to affect 243 field-based employees in 47 states and the District of Columbia tied to the looming patent cliff for antidepressant Trintellix (vortioxetine). The Japanese pharma is shifting resources to prepare for multiple potential medicine launches in the U.S., which could lead to 400 new commercial field roles. Story Jan. 16 - Vedanta Biosciences: The Massachusetts biotech is “significantly” reducing its headcount to channel resources toward its lead live bacteria cocktail program, a spokesperson confirmed with Fierce. The move follows a 20% workforce reduction last summer after a separate treatment for Enterobacteriaceae failed to reduce disease severity in a phase 2 study. Story Jan. 13 - Merck KGaA's EMD Serono: Merck KGaA's North American division has laid off an undisclosed amount of employees from its research team at a site in Durham, North Carolina. The move follows last year’s acquisition of SpringWorks Therapeutics and is part of a decision to streamline research operations, a spokesperson confirmed with Fierce. Jan. 13 - Sonoma Biotherapeutics: The regulatory T cell-focused biotech confirmed to Fierce that the company is reducing its workforce. While Sonoma wouldn't confirm how many employees will be affected, the biotech said roles across the organization and at \"all levels and functions\" would be impacted, including those based in South San Francisco, Seattle and remotely. The decision was made to \"right-size the organization and align resources with SonomaBio’s highest priorities,\" such as a phase 1 study of its lead rheumatoid arthritis asset . Jan. 12 - Lyra Therapeutics: The Massachusetts-based biotech has “decided to suspend further development” of its chronic rhinosinusitis treatment. All 28 of Lyra’s remaining employees will be impacted by a “workforce reduction,” which is one of a number of “cost-saving actions to preserve capital.” Story Jan. 8 - InflaRx: The German inflammatory and immunology-focused biotech will reduce its headcount by about 30% and chart \"substantial spending reductions\" as it looks to channel resources toward its new lead asset, izicopan. It's unclear exactly how many employees will be affected; online sources put the company's total headcount at 74 about a year ago. Story Jan. 8 - Rampart Bioscience: After raising $125 million near the end of 2023, the genetic medicine biotech has appeared to wind down, Endpoints News reported after speaking with two former staffers. The U.S. biotech's website is no longer available. As of publication, Rampart's CEO Louis Breton has not responded to Fierce Biotech's request for comment. Source Jan. 8 - Tessera Therapeutics: The Flagship-founded company is planning to lay off 90 employees across a number of states starting March 8. The Massachusetts-based biotech isn’t expecting to close any of its facilities in connection with the layoffs. Story Jan. 2 - Nido Biosciences: After its lead neurological disease candidate disappointed in a midstage study, the neurobiotech is closing its doors. “Just a handful of employees” will be impacted, a Nido spokesperson told Fierce. Story",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-1682014762_0.jpg?VersionId=dkIDyc0B.4ZnasKOzZx1Wdhp7SxM2jV8"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Agomab, SpyGlass head to Nasdaq with IPOs totaling $350M",
      "url": "https://www.fiercebiotech.com/biotech/agomab-spyglass-head-nasdaq-ipos-totalling-350m",
      "published": "2026-02-08T10:04:49.722491+00:00",
      "summary": "Belgian biotech Agomab Therapeutics and eye-focused drug delivery company SpyGlass Pharma both headed to the Nasdaq this morning as momentum continues to build for biopharma IPOs.",
      "content_text": "Belgian biotech Agomab Therapeutics and eye-focused drug delivery company SpyGlass Pharma both headed to the Nasdaq this morning as momentum continues to build for biopharma IPOs. Agomab is offering 12.5 million shares priced at $16 apiece—in the middle of the $15 to $17 range the company set out last week . The stock will list under the ticker “AGMB.” The offering is set to bring in $200 million in gross proceeds, the immunology company explained in a Feb. 5 post-market release . These proceeds could rise by about $30 million if underwriters take up their 30-day option to buy an additional 1.9 million shares. The immunology company plans to channel the proceeds toward its two clinical-stage candidates, including ontunisertib, an ALK5 inhibitor that demonstrated its ability to target the correct part of the intestine in a phase 2 trial of fibrostenosing Crohn’s disease last year. Agomab plans to use the IPO money to launch a global phase 2b study of the oral small molecule in the same indication. The Antwerp, Belgium-based company secured ontunisertib back in 2021 through its buyout of Spain’s Origo Biopharma. Agomab is hoping the drug can be used in combination with other Crohn’s drugs to help tamp down the disease and stop the scarring in those with fibrostenotic disease. Some of the IPO proceeds are earmarked for launching a midstage study of AGMB-447, another ALK5 inhibitor from Origo. Agomab is already running a phase 1 study of AGMB-447 in healthy volunteers as well as patients with idiopathic pulmonary fibrosis, with a top-line readout expected later this year. Joining Agomab on the Nasdaq this morning is SpyGlass, which is offering 9.4 million shares at $16 apiece. This is due to bring in gross proceeds of $150 million, according to a Feb. 5 release , although this could rise by around a further $22.5 million should underwriters exercise their option to buy an additional 1.4 million shares at the same price. The stock will trade under the ticker “SGP.” The California-based biotech is working on long-acting versions of approved medicines for chronic eye conditions. SpyGlass’ lead product is a drug-eluting intraocular lens designed to deliver multiple years of bimatoprost and thereby free patients from the need to administer eye drops. The device features drug-eluting pads attached to a single-piece, hydrophobic acrylic intraocular lens, and SpyGlass envisages physicians implanting the device during routine cataract surgery. Proceeds from the IPO are set to fund this product—called the Bimatoprost Drug Pad-IOL System—in a pair of ongoing phase 3 trials. If those studies are a success, the IPO funds would also be used to bankroll a commercial launch. A phase 1/2 study of the BIM-IOL System has previously tied 78-mcg and 39-mcg dose cohorts to intraocular pressure reductions of 37% and 36%, respectively. Based on these data, SpyGlass launched the two phase 3 studies for open-angle glaucoma and ocular hypertension in July 2025, with readouts penciled in for 2027. After a tough year for biotech IPOs, Agomab and SpyGlass are part of a growing roll call of biopharmas that are considering going public. Aktis Oncology led the way in January, while this week alone has also seen Eikon Therapeutics and Veradermics list on the Nasdaq.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/IPO.jpg?VersionId=_cpqW9EhbIouF4SWLEJJdiUntOWDYNqc"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "NICE greenlights Abbott's cardiac sensor implant for NHS",
      "url": "https://www.fiercebiotech.com/medtech/nice-greenlights-abbotts-cardiac-sensor-implant-nhs",
      "published": "2026-02-08T10:04:49.722469+00:00",
      "summary": "Abbott’s wireless, paperclip-sized cardiac sensor has received the blessing of the National Institute for Health and Care Excellence, paving the way for coverage of the device in England’s National Health Service.",
      "content_text": "Abbott’s wireless, paperclip-sized cardiac sensor has received the blessing of Britain’s National Institute for Health and Care Excellence (NICE), paving the way for coverage of the device in England’s National Health Service (NHS). In final guidance published Feb. 5 , the cost-effectiveness watchdog recommended the company’s CardioMEMS HF System for adults with later-stage heart failure who have been previously hospitalized for the condition and are at risk of future admission. The agency, which decides the drugs and medical technology that should be paid for by the taxpayer-funded NHS, said it based its decision on evidence from three randomized controlled trials showing the device could lower heart failure hospitalizations by about one-third. “By enabling early detection of problems and timely medication adjustments, [the sensor] has the potential to reduce emergency hospital admissions and help people manage their condition more effectively from the comfort of their own home,” Anastasia Chalkidou, M.D., Ph.D., NICE’s healthtech program director, said in a news release. The sensor is implanted in the pulmonary artery through a minimally invasive procedure. Once implanted, it remotely monitors changes in pulmonary artery pressure, which can be an early sign of worsening heart failure. Patients lie on a special pillow and press a button to take the readings, which are sent wirelessly to their healthcare providers, who can adjust their medication before the disease progresses. Chalkidou said the technology can help patients avoid trips to the emergency room while helping the NHS manage “a condition that places significant demands on hospital resources.” According to NICE, nearly 920,000 people in the U.K. are affected by chronic heart failure, and the condition costs the NHS around 2 billion pounds sterling annually. It accounts for roughly a million hospital bed days each year, according to the agency. The NICE guidance limits its recommendation to patients with New York Heart Association class 3 chronic heart failure, which is marked by fatigue, palpitations and shortness of breath during minimal physical activity. The sensor received expanded FDA approval in the U.S. in 2022 for patients suffering from class 2 heart failure, which causes milder symptoms. The FDA first approved the implant for class 3 heart failure patients in 2014.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2217535736.jpg?VersionId=Voh_UpyyqntWWHuSbPRXgkAEaETMZXAt"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Priovant will move brepocitinib to phase 3 after midstage win",
      "url": "https://www.fiercebiotech.com/biotech/pfizer-backed-priovant-scores-again-fast-rising-brepocitinib-mid-stage-study",
      "published": "2026-02-08T10:04:49.722447+00:00",
      "summary": "As Priovant works toward approval of potential blockbuster brepocitinib as a treatment for dermatomyositis, the North Carolina biotech has presented promising results for the TYK2/JAK1 inhibitor in another rare skin condition.",
      "content_text": "As Priovant works toward approval of potential blockbuster brepocitinib as a treatment for dermatomyositis, the North Carolina biotech has presented promising results for the TYK2/JAK1 inhibitor in another rare skin condition. A phase 2 study evaluating brepocitinib in patients with cutaneous sarcoidosis (CS) has become the first industry-sponsored, placebo-controlled trial to generate a positive readout in the indication, according to Priovant. And, based on the results, Priovant plans to initiate a phase 3 study this year, after consultation with the FDA, the four-year-old company said. Analysts at Leerink Partners deemed the results “exceptional” and said the findings “substantially” exceeded expectations, according to a Feb. 6 note. The Beacon trial enrolled 31 patients, randomizing them at a rate of 3:2:2 to receive a daily 45-mg oral dose of brepocitinib, a 15-mg daily dose or placebo for 16 weeks. The 45-mg arm achieved a 100% response rate in multiple endpoints. While patients in the placebo group achieved close to no benefit, those in the 15-mg arm “improved considerably, with numerically similar improvement to the 45 mg arm on lower-bar endpoints,” Priovant said. There also was evidence of dose-dependent benefit seen on higher-bar endpoints, the biotech added. On the Cutaneous Sarcoidosis Activity and Morphology Instrument Activity (CSAMI-A) score, brepocitinib 45 mg achieved a 22.3-point mean improvement at Week 16 compared to a 0.7-point improvement in the placebo arm, with statistically significant separation of treatment effect observed as early as Week 4. All brepocitinib 45-mg patients achieved a clinically meaningful 10-point improvement. The CSAMI-A scores range from 0 to 165, evaluating the severity of skin lesions in sarcoidosis. Another measurement tool used in the trial was the Investigator’s Global Assessment, which measures overall disease severity in dermatological studies, with scores ranging from 0 (clear) to 5 (very severe). In Beacon, 69% of the patients in the 45-mg arm achieved a two-point improvement to a score of 0 or 1 (almost clear). Misha Rosenbach, M.D., the director of the CS program at the Hospital of the University of Pennsylvania, called the study a “watershed moment for the sarcoidosis field.” “This is an incredible milestone for a historically neglected disease,” Rosenbach added. “The study drug showed a clear difference in patients who received the medication compared to placebo, both from the patient and the physician perspective, and appeared to be well tolerated. This is the sort of data you dream of seeing when you look at trial results.” CS is an inflammatory skin disease affecting approximately 40,000 adults in the U.S. CS lesions are often profoundly disfiguring, Priovant said, leading to substantial psychosocial distress. With no treatments approved for CS, many patients rely on off-label corticosteroids, immunosuppressants and biologics, which provide limited efficacy and can become toxic. This is another significant step in the progression of brepocitinib, which scored last year in a phase 3 trial of patients with dermatomyositis. The study showed brepocitinib to be a best-in-class treatment, according to TD Cowan, and Priovant has submitted a new drug approval request to the FDA. The company also is running a phase 3 trial of brepocitinib for patients with the inflammatory eye condition noninfectious uveitis. Priovant was created in 2022 through a partnership between Pfizer and Roivant Sciences to advance brepocitinib and the TYK2 inhibitor ropsacitinib. The New York City pharma giant holds a 25% stake in the new company. Evaluate has forecast sales of brepocitinib to reach $2.3 billion by 2032.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2162108938.jpg?VersionId=9axyOnr8rofXdX5VXVYHpXrPRybMf0d1"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Moderna CMO steps down in leadership mix-up-Chutes & Ladders",
      "url": "https://www.fiercebiotech.com/biotech/chutes-ladders-moderna-cmo-steps-down-leadership-mix",
      "published": "2026-02-08T10:04:49.722421+00:00",
      "summary": "Moderna Chief Medical Officer Jacqueline Miller, M.D., is stepping down after a little more than a year in the role. Miller held the role since November 2024 and will stay on as a consultant “to assist with the transition.”",
      "content_text": "Welcome to this week's Chutes & Ladders, our roundup of significant leadership hirings, firings and retirings across the industry. Please send the good word—or the bad—from your shop to Darren Incorvaia or Zoey Becker and it will be featured here at the end of each week. Moderna CMO steps down in leadership mix-up Moderna Jacqueline Miller, M.D. (Moderna) Moderna Chief Medical Officer Jacqueline Miller , M.D., is stepping down after a little more than a year in the role. Miller held the role since November 2024 and will stay on as a consultant “to assist with the transition.” Along with Miller’s departure from the C-suite, a new executive is coming on board; David Berman , M.D., Ph.D., is joining the mRNA outfit from Immunocore, where he led R&D and shepherded T-cell engager Kimmtrak to approval. Berman fills the chief development officer seat most recently held by Melanie Ivarsson , Ph.D., who left the job at the end of 2024 and served as an advisor for Moderna until mid-2025. Story Novo adds fresh leadership as 2 execs head out Novo Nordisk Novo Nordisk will have to navigate what it says will be a lackluster year for revenue growth without the help of two of its key executives, as EVP of U.S. operations Dave Moore and EVP of product and portfolio strategy Ludovic Helfgott hit the exit. Moore’s departure was attributed to “personal reasons” and comes after eight years at the company, where he is credited with creating its global business development function before moving to the U.S. business side early last year. Helfgott, meanwhile, is out after seven years with Novo, most of which was spent in the rare disease sector before pivoting to the broader strategy role in mid-2025. The company has already mapped out a succession plan for the departing executives, both of whom will ensure a “successful transition” to their respective successors through the end of the first quarter. Coming in to take over for Moore is Jamey Millar , who joins Novo after a stint as the CEO of UnitedHealth Group’s Optum Specialty Holdings, a move that followed a 20-year career with GSK. Helfgott’s role will be filled by Hong Chow , Merck KGaA's former executive vice president and head of China and international. Story | Release Pyxis picks interim CEO Pyxis Oncology Lara Sullivan , M.D., the president, CEO and chief medical officer of Pyxis Oncology who has been with the company since 2019, is pivoting away from the cancer biotech. Board member and experienced CEO Thomas Civik is stepping in in her stead as interim CEO while a search is conducted for a permanent successor. Civik previously led Five Prime Therapeutics, which was bought by Amgen for $1.9 billion in 2021. Pyxis has winnowed down its workforce and shed most of its pipeline in recent years, putting all its efforts behind solid tumor antibody-drug conjugate micvotabart pelidotin. Release > Seasoned physician-executive Geoff McDonough , M.D., is heading over to NodThera to take over as CEO as the company approaches key milestones on its way toward phase 3 development. Release > Bitterroot Bio is sprouting toward discovery biology and translational research in a restructuring that sees the exit of CEO Pavan Cheruvu , M.D., who will soon move on to pursue a new chapter. LinkedIn > Leonardo Faoro , M.D., is leaving his spot as Quanta Therapeutics’ chief medical officer to take on the same role at precision oncology biotech Alterome Therapeutics. Release > With IO Biotech shrinking its global workforce under a cost-saving restructuring plan, Chief Medical Officer Qasim Ahmad , M.D., is out, effective Feb. 15. Securities and Exchange Commission filing > Auro Nair , Ph.D., is moving from the board to the CEO chair at BioIVT, replacing outgoing CEO Richard Haigh , Ph.D., to unlock the company’s next phase of strategic growth. Release > Bicycle Therapeutics is promoting some of its key spokes, with Chief Accounting Officer Travis Thompson moving up to the chief financial officer role, Head of Clinical Development Michael Method , M.D., taking on the chief medical officer title and current Chief Technology Officer Michael Skynner , Ph.D., climbing ranks to the chief scientific officer role. Release > AI drug discovery company Valo Health selected 2024 Fiercest Women in Life Sciences honoree Karin Conde-Knape , Ph.D., to join the team as chief scientific officer following her lengthy career at Novo Nordisk. Release > Clinical research organization MMS is bringing in FDA vet Somya Dunn , M.D., to help bolster its regulatory expertise as senior medical director, safety risk management. Release > AstraZeneca’s Andy Barnett is taking over as head of the pharma’s Japanese operations, replacing Takashi Horii . Joris Silon , meanwhile, is assuming Barnett’s former title of head of investor relations. Release (Japanese) | Release > CDR-Life looks to jump-start its pipeline of T-cell engagers with new Chief Medical Officer Dimitrios Chondros , M.D. Release > Donald Fong , M.D., is now the chief medical officer of siRNA company ADARx Pharmaceuticals, a role he previously held at BioCryst Pharmaceuticals. Release > Rivus Pharmaceuticals has reined in Stefanie Mason , M.D., as vice president of clinical development to power a phase 2 trial of MASH candidate HU6. LinkedIn > Natural killer cell therapy biotech Zelluna has promoted Emilie Gauthy , Ph.D., to chief technology officer. Release > Levicept is looking to new Chief Development Officer James Sandy to advance its lead osteoarthritis candidate. Release > Experienced oncologist Andrew Sharabi , M.D., Ph.D., is now the top doctor at Primmune Therapeutics, where he’ll oversee clinical development of oral solid tumor candidate PRTX007 as chief medical officer. Release > Braveheart Bio is bumping Marc Evanchik up to chief scientific officer while also bringing in Brittany de Temple as SVP of development operations. Release > Joseph Arron , M.D., Ph.D., has split from Sonoma Biotherapeutics and settled down as head of human biology and genetics at Calico Life Sciences, an anti-aging startup launched by Google parent company Alphabet. Release",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-174746448.jpg?VersionId=juo5BIdrA33r0BvbATPftn..zHpCevY_"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Qiagen 'open for discussion' on shareholder value",
      "url": "https://www.fiercebiotech.com/medtech/qiagen-open-discussion-shareholder-value-ceo-stays-mum-takeover-talk",
      "published": "2026-02-08T10:04:49.722398+00:00",
      "summary": "Qiagen’s outgoing chief executive Thierry Bernard, M.D., told investors the company does not “comment on rumors” as takeover talks swirl around the diagnostics specialist.",
      "content_text": "Qiagen’s outgoing chief executive Thierry Bernard, M.D., told investors the company does not “comment on rumors” as takeover talks swirl around the diagnostics specialist. Buyout speculation has been gathering pace in recent weeks, with Bloomberg News reporting in mid-January that the Netherlands company is “weighing strategic options, including a potential sale,” citing people with knowledge of the matter. During its full-year and fourth-quarter financial results call on Feb. 5, investors pressed the CEO on takeover rumors. “I was expecting a question on this,” Bernard said. “I mean, it's fair to say that our market is still ... going through consolidation. That's point No. 1. At the same time, Qiagen is delivering and focusing on delivering on our solid plan for the coming years.” He added that the company doesn't “comment on rumors” but remains “open for discussion” that could create shareholder value. He declined to elaborate further. These rumors have sped up since Bernard announced last November he would step down once a successor is found. When asked about his position on the investor call, Bernard said, “What is important for the board and for the company is to find the best person for the job. So, we have a search ongoing. It's advancing very well, but we need to take the necessary time once again to find the best person for the job. In the meantime, we do have the management fully dedicated to Qiagen.” Qiagen recorded 2025 sales of $2.09 billion, up 5% at constant exchange rates, “which was at the high end of the outlook for about +4-5% CER growth,” the company noted in its results release . Net sales for the fourth quarter were up 1% at CER to $540 million. For 2026, the company is guiding net sales growth of at least 5% CER from last year.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/Featured%20Images%20-%20Fierce%20Healthcare%20-%202024-11-06T104522.398.jpg?VersionId=IRWkcHkmYQFpf2vo71Z4jrTJAWsriVa1"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Medtronic hit with $382M antitrust ruling",
      "url": "https://www.fiercebiotech.com/medtech/medtronic-hit-382m-antitrust-ruling-over-surgical-device-monopoly",
      "published": "2026-02-08T10:04:49.722374+00:00",
      "summary": "Applied Medical has been awarded $382 million in damages from Medtronic after a U.S. District Court jury in California unanimously found the medtech giant liable for suppressing competition of blood-vessel-sealing surgical devices.",
      "content_text": "Applied Medical has been awarded $382 million in damages from Medtronic after a U.S. District Court jury in California unanimously found the medtech giant liable for suppressing competition of blood-vessel sealing surgical devices. The case dates back to 2023, when Medtronic rival Applied Medical took the company to court alleging it had “engaged in exclusionary unlawful bundling and exclusive dealing practices to suppress competition in the market for advanced bipolar vessel sealing devices,” Applied explained in a Feb. 6 release . Thursday, Feb. 5, the jury agreed, finding that Medtronic had been selling its LigaSure device at low prices and bundling it with other products in contracts to make the company's offerings more appealing. This essentially monopolized the market and hurt competition for Applied’s rival device Voyant. The jury found Medtronic liable and told it to pay $381.7 million in damages to Applied. \"We are profoundly grateful to the jury for their time, their attention to the evidence, and their decisive verdict,” Gary Johnson, group president, advanced energy, who represented Applied Medical throughout the trial, said in a statement. “This is not just a legal victory for Applied; it is a validation of fair competition,” Johnson added. “We believe this decision marks a turning point for hospitals and healthcare providers struggling to dismantle complex contractual barriers that have long prevented them from access to innovation, choice and value.” Medtronic said it plans to appeal, according to Reuters , adding that surgeons “choose Medtronic’s LigaSure device time and again because it outperforms Applied’s Voyant.”",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/fiercebiotech/1643123075/ohq-close.jpg/ohq-close.jpg?VersionId=9WLOYR_YdvJUMMxQy8UtXeJWWvrSsovE"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "UniQure halts mid- to high-dosing for AAV gene therapy",
      "url": "https://www.fiercebiotech.com/biotech/uniqure-pauses-fabry-gene-therapy-dosing-2-groups-after-toxicities-emerge",
      "published": "2026-02-08T10:04:49.722350+00:00",
      "summary": "Two dose-limiting toxicities have been recorded in uniQure’s trial evaluating an investigational AAV gene therapy designed to treat the rare condition Fabry disease.",
      "content_text": "Two dose-limiting toxicities have been recorded in uniQure’s trial evaluating an investigational AAV gene therapy designed to treat the rare condition Fabry disease. In the phase 1/2 study , two patients receiving uniQure’s therapy, coded AMT-191, at a mid-level dose experienced asymptomatic Grade 3 liver enzyme elevations, according to a Feb. 6 company release . Per protocol, uniQure has halted further dosing in the mid- and high-dose groups amid an ongoing assessment. Both impacted patients have responded to corticosteroid treatment. No serious adverse events have been recorded at the two lower doses, but five were previously reported among two patients who received the third, highest dose. Two of those occurrences—chest pain and elevated troponin levels—were deemed related to AMT-191, and one has been potentially linked to the gene therapy. “Given the positive efficacy signals but less clear safety profile, it will be interesting to see how well the lower dose continues to balance safety and efficacy,” analysts from Leerink Partners wrote in a Feb. 6 note. The phase 1/2a trial enrolled 11 patients across three dose levels. Patients at each level responded to treatment with elevated alpha-galactosidase A levels, and six of the 11 were able to discontinue enzyme replacement therapy, uniQure said. Investors have generally been pleased with the study’s results. One of the trial's goals is to determine the dosing for AMT-191 moving forward, uniQure said. The AAV5-based gene therapy is designed to deliver a functional copy of the gene that makes alpha-galactosidase A, an enzyme critical for breaking down a type of lipid that otherwise builds up in patients’ tissues and blood vessels. In Fabry disease , toxic build-up of these lipids can lead to a range of symptoms, from numbness and pain to gastrointestinal trouble and hearing loss. UniQure's stock ticked up on Friday morning to a high of $27.74 per share, compared to the prior day’s close of $24.52. By 10:40 a.m. ET, the share price had normalized to $25.69. The Leerink analysts expect attention to primarily remain on uniQure’s more high-profile Huntington’s disease program, which has received acclaim from experts for its efficacy but been met with pushback from the FDA. In November, the biotech called the agency’s about-face “a drastic change from the guidance” previously given. Minutes from a type A meeting between uniQure and the FDA about the Huntington’s gene therapy will likely be released in late February or early March, the analysts noted.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-2039571588%20%281%29.jpg?VersionId=5s6bKw3ZXD3UTrCcf0SteskV0ejddJT5"
    },
    {
      "industry": "reagents",
      "source": "Fierce Biotech",
      "title": "Genentech cut at least 489 jobs last year, new filing reveals",
      "url": "https://www.fiercebiotech.com/biotech/genentech-cut-least-489-jobs-last-year-new-disclosure-reveals",
      "published": "2026-02-08T10:04:49.722314+00:00",
      "summary": "On top of 348 known job cuts across the organization last year, Genentech laid off an additional 141 staffers last August that are just now being disclosed.",
      "content_text": "On top of 348 known job cuts across the organization last year, Roche’s Genentech division laid off an additional 141 staffers last August that are just now being disclosed. The layoffs took effect on Aug. 18 and were filed with California’s Employment Development Department on June 26, but didn’t appear on the department’s listing of layoff notices until Feb. 4, 2026, potentially due to a glitch in the system, a Genentech spokesperson told Fierce Biotech. Though the layoffs are listed in the notice as occurring at Genentech’s South San Francisco headquarters at 1 DNA Way , the cuts actually occurred across departments and sites, as did last year’s similar layoff rounds , the spokesperson said. When small layoffs in different parts of the organization collectively add up to more than 50 people, it triggers a WARN notice, she added. “All layoffs are associated with our headquarters in South San Francisco, regardless of what state an employee lives in,” the spokesperson explained. Some of the changes that added up to last year’s layoffs include global manufacturing changes at Genentech’s parent company Roche, the incorporation of Genentech’s inclusion and belonging team into a broader Roche unit, and cuts across IT, research and around a dozen other teams, the spokesperson said. “To stay ahead in a fast-moving industry, we must constantly evolve how we work,” the spokesperson said. “This occasionally means making tough decisions to reallocate resources so we can do the most good for patients.” This means saying goodbye to 143 workers in July, 87 staffers in September and another 118 employees in November. While the layoffs “affect some teams, they also create new opportunities,” the spokesperson said. “We are actively hiring for roles that will embed digital, automation and AI capabilities across our organization.” Genentech has hired more than 400 new employees and doubled its previously announced investment in a new North Carolina manufacturing facility this year, the spokesperson added.",
      "cover_image_url": "https://qtxasset.com/quartz/qcloud5/media/image/GettyImages-1332853323.jpg?VersionId=2o3HoV8E5v_zjELWTgWNtif9averJwtg"
    }
  ]
}