{
  "industry": "technology",
  "collected_at": "2026-02-11T16:28:38.255100+00:00",
  "hours": 24,
  "limit": 25,
  "count": 25,
  "items": [
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Lifx‚Äôs two-pack of Matter-enabled smart color bulbs is down to $20",
      "url": "https://www.theverge.com/gadgets/877023/lifx-smart-color-wifi-bulbs-sony-xm6-oled-oakley-deal-sale",
      "published": "2026-02-11T16:27:35+00:00",
      "summary": "Let’s give it up for companies that are making affordable smart bulbs. Lifx is one, having recently released a two-pack of A19 / E26 LED bulbs at CES 2026 capable of white and color for just $24.99. These dimmable 800-lumen bulbs connect over Wi-Fi, and they’re compatible with Matter, making them work seamlessly with numerous [&#8230;]",
      "content_text": "Let‚Äôs give it up for companies that are making affordable smart bulbs. Lifx is one, having recently released a two-pack of A19 / E26 LED bulbs at CES 2026 capable of white and color for just $24.99. These dimmable 800-lumen bulbs connect over Wi-Fi, and they‚Äôre compatible with Matter, making them work seamlessly with numerous smart home platforms. While their original price was already compelling, they‚Äôre now $19.99 at Amazon , which is their lowest price yet ‚Äî just $10 per bulb. For perspective, a similar two-pack of color-changing Philips Hue bulbs currently costs $71.99. The setup process is simple, whether you have a preexisting smart home platform at work in your home or not. The bulbs can connect to Google Home, Alexa, Apple Home, SmartThings ecosystems, or you can set them up within Lifx‚Äôs mobile app. Otherwise, the only requirement is 2.4GHz connectivity through your Wi-Fi router. Other Verge-approved deals happening now",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/lifxdeallead.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "NanoClaw solves one of OpenClaw's biggest security issues",
      "url": "https://venturebeat.com/orchestration/nanoclaw-solves-one-of-openclaws-biggest-security-issues-and-its-already",
      "published": "2026-02-11T16:17:00+00:00",
      "summary": "<p>Article URL: <a href=\"https://venturebeat.com/orchestration/nanoclaw-solves-one-of-openclaws-biggest-security-issues-and-its-already\">https://venturebeat.com/orchestration/nanoclaw-solves-one-of-openclaws-biggest-security-issues-and-its-already</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46976845\">https://news.ycombinator.com/item?id=46976845</a></p> <p>Points: 6</p> <p># Comments: 0</p>",
      "content_text": "<p>Article URL: <a href=\"https://venturebeat.com/orchestration/nanoclaw-solves-one-of-openclaws-biggest-security-issues-and-its-already\">https://venturebeat.com/orchestration/nanoclaw-solves-one-of-openclaws-biggest-security-issues-and-its-already</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46976845\">https://news.ycombinator.com/item?id=46976845</a></p> <p>Points: 6</p> <p># Comments: 0</p>",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Here are the brands bringing ads to ChatGPT",
      "url": "https://www.theverge.com/ai-artificial-intelligence/877148/openai-chatgpt-advertisers-target-adobe-audible",
      "published": "2026-02-11T16:08:03+00:00",
      "summary": "OpenAI officially launched its advertising pilot in ChatGPT, leaving us with a better idea of the kinds of products we might see stuffed beneath our conversations with the AI chatbot. Several companies have announced plans to show ads inside ChatGPT - placements that will reportedly cost them a pretty penny - ranging from major retailers [&#8230;]",
      "content_text": "OpenAI officially launched its advertising pilot in ChatGPT, leaving us with a better idea of the kinds of products we might see stuffed beneath our conversations with the AI chatbot. Several companies have announced plans to show ads inside ChatGPT ‚Äî placements that will reportedly cost them a pretty penny ‚Äî ranging from major retailers like Target to automakers like Ford and Mazda. You‚Äôll only see ads in ChatGPT if you‚Äôre a free user or subscribed to its cheaper $8 / month Go plan . OpenAI has said it will ‚Äúclearly‚Äù label the ads and that they won‚Äôt influence ChatGPT‚Äôs response. Here are all the brands that we know are partnering with OpenAI so far. Target says in an announcement that it will use ads in ChatGPT to help users ‚Äúdiscover products, deals and inspiration that meet what they‚Äôre seeking at that moment.‚Äù It notes that ads will appear based on keywords that appear in a user‚Äôs ChatGPT prompt. As an example, Target says someone using ChatGPT to look for ‚Äúcountertop cooking appliances that make everyday meals more convenient‚Äù might see an ad for an air fryer from Target. Adobe is planning to show ads for its AI-powered document editor, Acrobat Studio, and its AI video and image generator, Adobe Firefly, in ChatGPT. It‚Äôs positioning the partnership as a way to ‚Äúbetter understand how ads can provide helpful, relevant experiences‚Äù as it ramps up its own platform designed to help advertisers show up in AI search results. You might see ads for Williams-Sonoma‚Äôs range of housewares, kitchenware, furniture, and other products, too. The company says it‚Äôs going to explore how ads in ChatGPT will help ‚Äúsurface relevant, high-quality products‚Äù at ‚Äúdecision-making moments.‚Äù It looks like ChatGPT‚Äôs ads won‚Äôt be limited to tangible products, either, as the Amazon-owned Audible plans to work with OpenAI to ‚Äúreach new audiobook listeners‚Äù through ChatGPT. It‚Äôs not clear whether Audible will only show ads for its subscription or if it will showcase specific audiobooks when someone asks ChatGPT for recommendations. Ford, Mazda, Mrs. Myers, and more The advertising agency WPP Media is working with Ford, Mazda, the cleaning company Mrs. Myers, and the luxury Swiss watch company Audemars Piguet to launch ads in ChatGPT as well. (Its other clients include Audible and Adobe, too). Meanwhile, other agencies, including Dentsu and Omnicom, have announced that they‚Äôre going to bring their clients‚Äô ads to ChatGPT as well, though they don‚Äôt specify which brands are involved. Instead, Dentsu notes that it has ‚Äúseveral clients‚Äù participating in OpenAI‚Äôs test across grocery, hospitality, retail, software, travel, and the consumer packaged goods (CPG) industries, which could include items like food and beverages, cosmetics, or cleaning products. Omnicom lists companies specializing in apparel, automotive, beauty, CPG, technology, telecommunications, hospitality, retail, and fast-food as participants in OpenAI‚Äôs test.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25462010/STK155_OPEN_AI_CVirginia_D.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Former Founders Fund VC Sam Blond launches AI sales startup to upend Salesforce",
      "url": "https://techcrunch.com/2026/02/11/former-founders-fund-vc-sam-blond-launches-ai-sales-startup-to-upend-salesforce/",
      "published": "2026-02-11T16:00:00+00:00",
      "summary": "The startup, Monaco, has come out of stealth as an AI-native all-in-one CRM plus more system backed by names like the Collison brothers and Garry Tan.",
      "content_text": "When Sam Blond left his job as a VC for Founders Fund a year ago — just 18 months after he started — he told the world that being a VC wasn’t for him and he was “going back to operating.” On Wednesday, he officially brought his new startup, Monaco , out of stealth. It was co-founded with his brother Brian Blond, who is also an ex-sales professional turned VC. (Brian is a partner at Human Capital and was formerly at Sutter Hill.) The brothers are joined by two other co-founders, Abishek Viswanathan (previously CPO at Apollo and Qualtrics), and Malay Desai (formerly SVP of engineering at Clari). Monaco has raised a total of $35 million, between a $10 million seed and $25 million Series A round, Sam Blond tells TechCrunch. Both rounds were led by Founders Fund, with participation from Human Capital. The startup has been quietly testing its AI sales platform through a private beta for a while, but on Wednesday opened it up to a public beta. The well-connected Blond brothers (Sam was previously head of sales at Brex), also attracted a bunch of big-name angels as backers: Stripe founders Patrick and John Collison, Y Combinator chief Garry Tan, and Greenoaks Capital founder Neil Mehta. So what attracted such a venerable list of investors? Monaco is entering the crowded field of AI sales tech with a twist. It isn’t just competing with SaaS-era tech via its AI-native alternative; it’s also supplying experienced human salespeople to be experts in the AI loop, monitoring and guiding the AI’s work. The startup is targeting young seed and Series A-level startups with a product suite that includes an AI-native customer relationship management (CRM) system and a built-from-scratch Zoominfo-like database for finding prospects. Its AI agents can create and execute email outreach campaigns and draft follow-up emails all monitored by the human experts. It includes other features, too, like a meeting notetaker. The product is intended to automate much of the sales grunt work. “We can replace full workflows with agents,” Blond says (pictured above, third from left, with brother Brian, pictured second from left). For instance, Monaco builds a database of prospects, identifies the exact people at a target company to pitch and the sequence in which to target them. “We orchestrate and execute that sequence. We schedule a meeting,” Blond says. Techcrunch event Boston, MA | June 23, 2026 The human-in-the-loop salespeople help ensure that the AI isn’t hallucinating and train it to sell the product, and the actual customer meetings are done by the people. No avatars. That makes Monaco a rare AI sales startup that isn’t talking about human replacement . Instead, it’s making experienced salespeople available to companies too nascent to hire them directly. “It’s this combination of the technology, but also the service,” Blond says. “Monaco does not have an agent pretending to be a sales rep trying to sell to the customer.” Currently, Monaco’s main competition is Hubspot, priced as it is to be more affordable for young companies than the big kahuna of the market, Salesforce. Blond declined to tell us what Monaco will charge, except to say that it’s a flat fee and currently discounted while the product remains in beta. He’s also well aware that he’s in an exceptionally crowded market. Y Combinator alone has graduated hundreds of sales startups in the past couple of years ranging from AI CRMs to niche AI tools. Then there’s startups like Attio, Clay, and Conversion, and the crop of so-called AI SDR (sales-development representative) tools — human-replacement agentic startups like 11x , Artisan , and 1mind . On top of that, the incumbents, including Salesforce, Hubspot, Zoho, Zoominfo, are all offering their own AI and agentic tools. Blond points out that today’s top players were built in another era, and none of the upstarts are performing well enough to be a clear-cut winner. “There definitely is not the ‘Cursor for sales’,” he says, referring to the popular AI coding tool. “But there will be.” He obviously wants Monaco to be that winner. “In the broad category of sales technology, there’s a market leader right now. That market leader is Salesforce,” Blond says. “We are in the early innings of the next platform shift that will lead to a new market leader.” Still, out of all the areas he could have entered after leaving Founders Fund, why duke it out among so much competition? Blond, speaking earnestly, says that having spent his entire career in sales, “As a non-technical founder, there’s really only one type of technology company that I’m qualified to be the founder of: a sales technology company.” He’s clearly having fun doing so. The company employs about 40 people and the office, filled with fellow career salespeople, sports WWII-esque motivational posters on the wall with slogans like “Save Startups” and “Build the future with Moncao.” There’s even an office gong that rings out every time the AI lands a meeting with a prospect.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/Monaco-Founder-Photo.jpg?resize=1200,800"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Upside Robotics is reducing fertilizer use and waste in corn crops",
      "url": "https://techcrunch.com/2026/02/11/upside-robotics-is-reducing-fertilizer-use-and-waste-in-corn-crops/",
      "published": "2026-02-11T16:00:00+00:00",
      "summary": "Upside Robotics builds autonomous solar-powered robots that can help farmers reduce their fertilizer use by 70%.",
      "content_text": "The founders of Upside Robotics met in 2023 because they were both looking to build an impact-driven company that touched climate and agriculture. Less than a year later, they were sleeping in a camper on the side of a Canadian corn field building their robotics startup. Waterloo, Ontario-based Upside Robotics builds lightweight solar-powered autonomous robots that deliver right-sized amounts of fertilizer and nutrients to crops when they need it. The company’s software runs on proprietary algorithms to decipher when and how much fertilizer the plants need using weather and soil data. Upside’s robots currently work on corn plants — one of the most fertilizer-intensive crops — which was chosen by Upside for that exact reason, Jana Tian, co-founder and CEO, told TechCrunch. After Tian and Sam Dugan, co-founder and chief technology officer, met at the Entrepreneur First accelerator, they decided to focus on reducing fertilizer waste using robots because it fit squarely into the center of the venn diagram of their interests. It also leaned well toward their backgrounds. Dugan had been building robots since he was ten years old and Tian had years of experience as a chemical engineer in the food division at Unilever. Customer discovery with farmers further confirmed this was an area farmers were willing to pay for a better way. “Traditionally, the way the fertilizer has been applied, only 30% of the total fertilizer gets taken by the crop, so a majority of it gets wasted,” Tian said. “Farmers usually do one application per season, so they have to front load a lot of the fertilizer. But the crops need the fertilizer during the season as well. We knew there was that problem that a lot of our growers really wanted different solutions to.” Techcrunch event Boston, MA | June 23, 2026 Dugan (left) and Tian (right). Courtesy of Upside Robotics The pair formally founded Upside Robotics in 2024 and then hit the fields — literally. “We actually bought a camper trailer, and we moved around field to field,” Dugan said. “We stayed on the side of the field every night, and we would be walking, sometimes around the clock. We have spent every hour of the day in a corn field at some point in time.” Dugan built a robot in two weeks so they could start to test their idea. This device was a remote-controlled car that Dugan and Tian would operate manually. They’d follow the robot around the fields to collect data and demonstrate how the fertilizing system would work to farmers. “We did our manual applications in year one, and that allowed us to iterate super fast, not just kind of on the hardware side, but learning by being with the farmers,” Tian said. “Some of our farmers said that we spent probably more time than they did in a lifetime in their fields. That allowed us to wrap up quickly. Neither of us were farmers, so that gave us firsthand experience into what it is like to basically be a farmer.” After spending the 2024 season proving the company’s concept, they spent that off season developing the fourth generation of their robot for the 2025 growing season. They went from 70 acres in 2024 to 1,200 acres in 2025. Now, the company is gearing up to serve more than 3,000 acres in the upcoming 2026 season with 100% customer retention since the beginning. Upside reported that it has thus far helped its customers cut fertilizer use by 70% which equates to around $150 in savings per acre per season. Upside recently raised a $7.5 million seed round led by Plural with participation from Garage Capital and the founders of Clearpath Robotics . The funding will be used to continue to fund research and development and to keep up with demand — there are more than 200 farms on their waitlist. The company also hopes to expand out of Canada with a target of breaking into the U.S. corn belt. “People always question if farmers are going to adopt new solutions, and they certainly are, and that’s something that we’ve learned firsthand, as long as you can provide them with a clear [return on investment] and a clear reason of why this technology was built,” Tian said. “In our case, it wasn’t something that we actually had to sell to farmers. In a lot of cases, our farmers actually asked for this solution.”",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/Upside-Robotics.jpg?resize=1200,675"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Reanimal review: a horror game that wants to devour you",
      "url": "https://www.theverge.com/games/876355/reanimal-review-ps5-xbox-switch-steam",
      "published": "2026-02-11T16:00:00+00:00",
      "summary": "The woods in Reanimal are full of surprises. You will encounter human cadavers that slither like snakes, gigantic talking pigs, and, at one point, a forlorn, supersized whale who seems resigned to an agonizingly slow death. These variously monstrous beings inhabit a realm that, though it looks like our own, seems to defy spatial logic: [&#8230;]",
      "content_text": "The woods in Reanimal are full of surprises. You will encounter human cadavers that slither like snakes, gigantic talking pigs, and, at one point, a forlorn, supersized whale who seems resigned to an agonizingly slow death. These variously monstrous beings inhabit a realm that, though it looks like our own, seems to defy spatial logic: the forest leads to an oceanic expanse, which segues into a decrepit, towering city. It‚Äôs like Aesop‚Äôs Fables meets the nightmare visions of both Lars von Trier and J.G. Ballard. Playing as a boy and girl (either solo or via local / online co-op), Reanimal evolves the premise Tarsier Studios explored with its first two Little Nightmares games: the timeless terror of children being pursued by larger, looming monsters. But the camera in this action-platformer is more fluid and dynamic. It feels less like you are peering inside a doll‚Äôs house and more like you are seamlessly directing these characters through a miniature film set. Another notable departure: For all its unsettling darkness, Little Nightmares always carried a little storybook charm . That quality is largely absent here. Reanimal is darker, nastier ‚Äî and stronger for it. The game begins on water, with you following dimly lit buoys; you reach a beach and open washed-up suitcases to find a key. From there, you venture into what seems like a hydroelectric facility. Inside, there are light puzzles to solve as you move forward, though nothing so taxing as to impede your progress for very long. The pair you‚Äôre controlling (referred to simply as ‚ÄúBoy‚Äù and ‚ÄúGirl‚Äù) can jump and grab objects; later, they wield a crowbar, useful for prying open doors or whacking smaller enemies. If you have played either a Little Nightmares game or a title by Playdead (the Danish studio‚Äôs landmark first game Limbo or 2016 classic Inside ), then the action will feel instantly familiar. The revelatory moments arrive via finely crafted details: These child protagonists carefully and reassuringly usher one another into each newly discovered room. I love how upon each restart after dying (perhaps in the jaws of a monstrous foe or by tumbling down a sheer drop), the duo are shown hugging one another ‚Äî the only comfort they have in this terrible world. Yet these children are made of steely stuff. For every panicked sequence fleeing a gigantic sheep down a blood-red corridor, there is a moment when it is these youngsters who are doing the chasing. Reanimal , like forebears dating all the way back to 1991‚Äôs Another World , delights in showing you enemy figures loping ominously off-screen through some crack or hole in the wall. You must follow, plucking up the courage to trail these beasts into inky shadows. Reanimal takes some time revealing where its strikingly macabre, exquisitely haunted images are leading. The key moment occurs with the arrival of a soldier wearing a Brodie helmet popular in World War I; a few scenes later, you discover coastal artillery. Tarsier toyed with wartime motifs in its Little Nightmares games, notably the pile of shoes that recalled the heaps of belongings found by Allied soldiers at Nazi extermination camps in West Germany. Reanimal ‚Äôs allegory is more explicit: At one particularly gruesome moment, you must evade the shots of a sniper stationed high in a building. Fail to find cover quickly enough and the young boy or girl‚Äôs body is ripped apart by a speeding bullet. Tarsier‚Äôs latest operates in a different tonal zone to the jingoistic, popcorn warfare of the Call of Duty series and the amped-up-to-11 absurdity of Battlefield . Its solemnity evokes the trench sequences from the first Death Stranding game and finely calibrated dread of 2024‚Äôs underrated survival-horror title Conscript and action-adventure Hell Is Us . That said, for all Reanimal ‚Äôs achievements, it falls just a little short of greatness. The game doesn‚Äôt possess the same crystalline, airtight polish of Playdead‚Äôs work. Some transitions between scenes are a little abrupt, and on a few occasions, I had to reload because of a glitching character. Such is the literal darkness of the game, coupled with the choices of perspective, that distinguishing between the fore and background is a struggle; cue the odd accidental fall. None of this greatly impacts what is a frequently bold and brilliant game. Since 2017, Tarsier has made children‚Äôs nightmares for grown-ups; despite its young protagonists, Reanimal is a nightmare wholly born from the anxieties of adults. It seems to speak to both the horrors of the 20th century and our barbarous present in which large-scale on-the-ground conflicts between sovereign nations have regretfully reemerged. I‚Äôm still running the story‚Äôs deeper meaning through my head. But regardless of the conclusions I eventually draw, there is no denying the sheer verve and power of the images that Tarsier summons on screen. Bodies ‚Äî human or otherwise ‚Äî disappear into bodies; children are doomed to wield the weapons of grown-ups (if they are not torn asunder by them first). The game also harbors a fascination with the spectacle of popular entertainment, delivering showstopping moments in both a cinema and theater. Reanimal does not flinch; this action-platformer delivers a parade of atrocities you cannot take your eyes off of. Reanimal launches February 13th on the PS5, Xbox, PC, and Nintendo Switch 2. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Lewis Gordon Entertainment Games Review Gaming",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/REANIMAL_Screenshot_6.jpg?quality=90&strip=all&crop=0%2C3.4719740594264%2C100%2C93.056051881147&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Railway - Status",
      "url": "https://status.railway.com",
      "published": "2026-02-11T15:51:11+00:00",
      "summary": "<p>Article URL: <a href=\"https://status.railway.com\">https://status.railway.com</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46976466\">https://news.ycombinator.com/item?id=46976466</a></p> <p>Points: 14</p> <p># Comments: 5</p>",
      "content_text": "We are continuing to work on a fix for this incident.",
      "cover_image_url": "https://railway.instatus.com/api/og"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Amazon Pharmacy to expand same-day delivery to nearly 4,500 US cities",
      "url": "https://techcrunch.com/2026/02/11/amazon-pharmacy-to-expand-same-day-delivery-to-nearly-4500-us-cities/",
      "published": "2026-02-11T15:46:26+00:00",
      "summary": "The expansion will cover customers in newly served states such as Idaho and Massachusetts.",
      "content_text": "Amazon Pharmacy, the retail giant’s online pharmacy, plans to bring same-day prescription delivery to almost 4,500 U.S. cities and towns by the end of this year, adding nearly 2,000 new communities to its network. The expansion will cover customers in newly served states such as Idaho and Massachusetts, the company announced on Wednesday. Amazon launched Amazon Pharmacy in 2020, two years after its $753 million acquisition of prescription medicine delivery service PillPack. In 2023, Amazon launched RxPass , a service that offers Prime members in the U.S. as many generic versions of medications as they need for a $5 monthly fee. “Patients shouldn’t have to choose between speed, cost, and convenience when it comes to their medication, regardless of where they live,” said John Love, vice president of Amazon Pharmacy, in a press release . “By combining our pharmacy expertise with our logistics network, we’re removing critical barriers and helping patients start treatment faster—setting a new standard for accessible, digital-forward pharmacy care.” In October, the e-commerce giant debuted prescription vending machines at its One Medical clinics. The in-office kiosks, which are operated by Amazon Pharmacy, let patients pick up their prescriptions immediately after their appointment.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2024/10/amazon-pharmacy.jpeg?w=767"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "AI-First Company Memos",
      "url": "https://the-ai-native.company/",
      "published": "2026-02-11T15:41:18+00:00",
      "summary": "<p>Article URL: <a href=\"https://the-ai-native.company/\">https://the-ai-native.company/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46976317\">https://news.ycombinator.com/item?id=46976317</a></p> <p>Points: 57</p> <p># Comments: 55</p>",
      "content_text": "Three philosophies, one format Reading these memos side by side, a pattern emerges. They all use the same format (CEO writes to all employees about AI transformation) but contain three fundamentally different philosophies about what \"AI-first\" means. AI as gate. Shopify, Duolingo, and Fiverr share a version of this: before you get resources (headcount, budget, tools), demonstrate that AI can't do the work. The human must justify their role relative to AI. This is the most provocative framing, and it generates the most press. AI as ladder. Box takes this approach. AI doesn't replace people, it makes them more productive, and the productivity gains get reinvested. Teams that adopt AI get more resources, not fewer. Levie specifically contrasted his approach with Duolingo's \"prove AI can't do it\" framing. AI as fait accompli. Klarna didn't write a forward-looking memo. It reported what had already happened. This framing is the riskiest. When Klarna's numbers turned out to tell a simpler story than reality allowed, the reversal was public and awkward. The memo is the strategy The CEO AI memo isn't a communication about strategy. It is strategy. Writing it and publishing it under your own name does several things at once that no Slack message or quiet policy change could. It creates accountability. Every manager now has cover to enforce it and no room to ignore it. It sets the narrative externally. Investors, analysts, and potential hires all read these memos. Lutke didn't just tell Shopify employees to use AI. He told the market that Shopify is an AI company. And it creates peer pressure. Not having a memo started to look like not having a strategy. Nobody defines it The most revealing thing about these memos is what's absent: a definition. None of them define what \"AI-first\" actually means. Lutke says it's a \"baseline expectation\" but doesn't specify what that looks like for a designer vs. a supply chain manager. Von Ahn says Duolingo is \"AI-first\" but has to walk it back months later because people filled in their own definition. That's not a flaw. The memo works because it's directional rather than definitional. It says \"this is where we're going\" without getting bogged down in what it looks like when you arrive. The investors are further along on definitions than the operators. Bessemer draws a line between companies advancing AI as a science vs. using it as a distribution machine. Intel Capital uses a four-tier spectrum from AI-Enhanced to AI-Native. Sequoia looks at revenue per employee. Hit $1M+ and you're probably the real thing. But the CEOs don't need taxonomies. They need momentum. And the memo, public, permanent, attached to their name, creates it. The Klarna lesson Every CEO writing one of these memos should read Klarna's story. Siemiatkowski went further than anyone: a hiring freeze, a 40% headcount reduction, public celebrations of AI replacing hundreds of agents. Then he reversed course, admitted quality had suffered, and started hiring humans again. He's been more open about this than most executives would be. He's publicly wrestled with the implications, writing that AI could make his own role unnecessary, which he finds \"gloomy.\" But the arc (from loud AI-first announcements to quietly hiring humans again) exposes the gap between the CEO AI memo as a communications device and what's actually happening inside the company.",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Mamdani Hires Groundbreaking Computer Scientist as Chief Tech Officer",
      "url": "https://www.nytimes.com/2026/02/10/nyregion/mamdani-lisa-gelobter-gif.html",
      "published": "2026-02-11T15:13:21+00:00",
      "summary": "<p>Article URL: <a href=\"https://www.nytimes.com/2026/02/10/nyregion/mamdani-lisa-gelobter-gif.html\">https://www.nytimes.com/2026/02/10/nyregion/mamdani-lisa-gelobter-gif.html</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46975940\">https://news.ycombinator.com/item?id=46975940</a></p> <p>Points: 49</p> <p># Comments: 31</p>",
      "content_text": "During his rapid rise, Mayor Zohran Mamdani showcased his mastery of social media, turning the medium into a political agent of mass reach and vowing to use technology to fuel his plans for New York City. On Tuesday, the mayor will announce that he has lured someone with far more technological heft to join his administration: Lisa Gelobter, a computer scientist who helped shape the modern web by leading the team that developed the animation technology used to create GIFs. Ms. Gelobter, an entrepreneur, was also on the launch team for the streaming service Hulu and founded tEQuitable , a company that uses technology to make workplaces more equitable. As the chief technology officer and commissioner of the Office of Technology and Innovation, she will oversee cybersecurity, data management and the city’s technology infrastructure, and she will aim to improve digital access to essential services for New Yorkers. “I’m deeply honored to be appointed by Mayor Mamdani at a moment when technology is reshaping nearly every aspect of civic life,” Ms. Gelobter said in a statement. “Technology impacts how people experience government every day, from accessing services to trusting that systems work fairly and responsibly.” At 34 years old, Mr. Mamdani is New York City’s first digitally native mayor, and he has continued to embrace social media to communicate with the public. The appointment of Ms. Gelobter adds to Mr. Mamdani’s short but growing list of marquee hires, which includes Lina Khan , the former head of the Federal Trade Commission, to lead his transition; Jessica Tisch , whom he retained as police commissioner; and Julie Su , a former acting labor secretary in the Biden administration, as the first deputy mayor for economic justice. “Lisa Gelobter’s decades-long career as a computer scientist, innovator, and entrepreneur has been defined by her commitment to leveraging technology for the public good,” Mr. Mamdani said in a statement. “I am honored that she will bring that same vision and leadership to City Hall.” Ms. Gelobter, who also served as the chief digital service officer at the U.S. Department of Education for the Obama administration, is viewed as one of the most prominent Black women in the technology world. Her appointment could appease some Black leaders who have criticized Mr. Mamdani for not appointing a Black deputy mayor for the first time in decades . Ms. Gelobter was the director of program management at Macromedia where she helped develop Shockwave into a web plug-in that allowed for video games and animation on the web, turning still images into moving GIFs — animated images known as a graphics interchange format. In 2021, Ms. Gelobter told Forbes that the Shockwave plug-in helped “set the foundation” for the modern web. “It was the thing that made the web move and had the most significant impact in the U.S. from a technological perspective,” she told the magazine. At the U.S. Department of Education, Ms. Gelobter created College Scorecard, a web app that helps students and their families evaluate prospective colleges. John B. King, Jr., the chancellor of the State University of New York, worked with Ms. Gelobter at the Education Department and praised her hire. “No matter where she works,” Mr. King said in a statement, “Lisa brings a relentless belief in the ability of technology to uplift and empower people, to create a country where every person can access and afford an education, to create a tech industry where every person can deepen their skills and find a job, to create programs where every person can participate and get ahead.”",
      "cover_image_url": "https://static01.nyt.com/images/2026/02/10/multimedia/10met-tech-hire-qpcf/10met-tech-hire-qpcf-videoSixteenByNine3000.jpg"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Ask HN: Why electronics are still so unrecyclable?",
      "url": "https://news.ycombinator.com/item?id=46975933",
      "published": "2026-02-11T15:12:53+00:00",
      "summary": "<p>I was wondering why electronics and computer parts are so unrecyclable (is there a better word for that?).<p>From what I searched, only a small percentage of electronics are recycled and those that do, are through chemical processes. Electronics today use plastics and special metals, and extracting them isn't straightforward, because requires energy and big acid digestors.<p>Is there some kind of initiative on this area, on using other materials or designing chips and boards to be more recyclable or reusable?</p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46975933\">https://news.ycombinator.com/item?id=46975933</a></p> <p>Points: 9</p> <p># Comments: 17</p>",
      "content_text": "I was wondering why electronics and computer parts are so unrecyclable (is there a better word for that?). From what I searched, only a small percentage of electronics are recycled and those that do, are through chemical processes. Electronics today use plastics and special metals, and extracting them isn't straightforward, because requires energy and big acid digestors. Is there some kind of initiative on this area, on using other materials or designing chips and boards to be more recyclable or reusable?",
      "cover_image_url": null
    },
    {
      "industry": "technology",
      "source": "Ars Technica",
      "title": "What's next after the Trump administration revokes key finding on climate change?",
      "url": "https://arstechnica.com/science/2026/02/whats-next-after-the-trump-administration-revokes-key-finding-on-climate-change/",
      "published": "2026-02-11T15:10:19+00:00",
      "summary": "The EPA is revoking the finding for legal, not scientific reasons",
      "content_text": "In its original proposal, the Trump EPA relied on recent Supreme Court decisions it said restrict its authority to act on climate under current law, and close observers expect that will be the administration’s strategy. “We expect EPA to revoke the endangerment finding for legal reasons, not scientific ones,” said Jeff Holmstead, a partner at the Bracewell law firm who served as head of EPA’s air office during President George W. Bush’s administration. “This is the only way that they can ‘drive a stake through the heart of climate religion,’ as Administrator Zeldin has said.” If this is about law and not science, how has the law changed since 2009? The second Trump administration had the confidence to take on the endangerment finding largely because of how the president reshaped the Supreme Court in his first term, legal experts say. In two 6-3 decisions from a conservative majority bolstered by Trump’s three appointees, the justices created new doctrine that limited the power of federal regulatory agencies like the EPA. “We’ve had an administrative law revolution,” said industry lawyer Matthew Leopold, who was the EPA’s general counsel in Trump’s first term, speaking at a forum last fall at the American Enterprise Institute (AEI), a conservative think tank. “The playing field that the Obama administration was playing on [when it made the endangerment finding] looks entirely different today.” The Supreme Court struck down Obama’s signature climate policy, the Clean Power Plan, in 2022. And in that case, West Virginia v. EPA , the court established its so-called “ major questions doctrine ,” saying regulation of greenhouse gases was an issue of such great economic and political significance that the EPA could not regulate them without explicit direction from Congress. Then, in a 2024 case over fishing regulations, the Supreme Court overturned the principle that had guided regulatory law for 40 years, saying that federal agencies were due no deference in interpreting ambiguities in the law. The court said judges, not agencies, should decide the meaning of the law, even though in the environmental realm that typically involves application of science and knowledge of the best available technologies for reining in pollution.",
      "cover_image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/coal-1152x648.jpg"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Diesel‚Äôs wired earbuds look exactly like wired earbuds from Diesel",
      "url": "https://www.theverge.com/gadgets/877091/diesel-60458-wired-earbuds-headphones",
      "published": "2026-02-11T15:01:58+00:00",
      "summary": "Despite evidence to the contrary, not only are wired earbuds alive and well, they're enjoying a resurgence. Brands like Belkin and even respected headphone maker Master &#38; Dynamic now offer tethered earbuds again. Even the Italian fashion brand Diesel has decided wired headphones are still cool and has launched a pair of earbuds it describes [&#8230;]",
      "content_text": "Despite evidence to the contrary , not only are wired earbuds alive and well, they‚Äôre enjoying a resurgence. Brands like Belkin and even respected headphone maker Master & Dynamic now offer tethered earbuds again. Even the Italian fashion brand Diesel has decided wired headphones are still cool and has launched a pair of earbuds it describes as being ‚Äúdesigned for fearless daily use.‚Äù We‚Äôre not entirely sure what that means, but these earbuds definitely look distinctly Diesel. The headphones aren‚Äôt yet listed on the US version of Diesel‚Äôs website, but you can find them on the company‚Äôs UK site where they‚Äôre priced at ¬£89.95, or around $123. That‚Äôs cheaper than Master & Dynamic‚Äôs $199 ME05 wired earbuds, but at least we have a full run down of the tech inside M&D‚Äôs . Diesel‚Äôs website doesn‚Äôt go into details about what drivers you‚Äôll find inside its 60458 Wired Earbuds, but images reveal they‚Äôre designed to connect to mobile devices over USB-C, and include an inline remote with volume and playback controls, a microphone, and a sliding switch to mute the mic. The earbuds have a silver finish, but the chains wrapping the wires and attached charms (capitalizing on another trend) are actually made from less precious metals like aluminum and zinc.",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/diesel3.jpg?quality=90&strip=all&crop=0%2C10.928342580292%2C100%2C78.143314839415&w=1200"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Build a pipeline and close deals with an exhibit table at Disrupt 2026",
      "url": "https://techcrunch.com/2026/02/11/build-a-pipeline-and-close-deals-with-an-exhibit-table-at-techcrunch-disrupt-2026/",
      "published": "2026-02-11T15:00:00+00:00",
      "summary": "Get an unmatched ROI by exhibiting your startup in front of 10,000 tech leaders and investors at TechCrunch Disrupt 2026, October 13-15 in San Francisco. Book your table now before it's gone.",
      "content_text": "From October 13–15 at San Francisco’s Moscone West, 10,000+ founders, investors, operators, and decision-makers converge at TechCrunch Disrupt 2026 . This isn’t just an event. It’s three days of concentrated deal flow. An exhibit table turns that energy into measurable business growth. Your startup doesn’t need more “awareness.” It needs customers, investors, and strategic partners. Book your Disrupt exhibit table today and explore the full program details. How exhibiting at Disrupt drives real growth Image Credits: Slava Blazer Photograpy Direct access to buyers and decision-makers The Expo Hall is where founders and operators look for tools and partners. Capture leads instantly through the Disrupt app and start filling your Q4 pipeline on the spot. Investor proximity that shortens fundraising cycles In addition to access to main stage sessions, breakout discussions, and curated networking, your team can turn cold investor outreach into face-to-face momentum by showcasing your breakthrough on the expo floor. Brand credibility through TechCrunch association Your startup is featured across the Disrupt website, app, sponsor directory, announcements, and closing ceremony, reinforcing trust with customers and investors alike. Drive multi-channel ROI With founder perks, sponsor listings, press access, and team-wide passes, you’re not just showing up; you’re executing a growth strategy across sales, marketing, and fundraising. Leverage your team strategically With 10 total passes, you can split focus across sales, partnerships, hiring, and investor meetings — maximizing every hour onsite. Techcrunch event Boston, MA | June 23, 2026 The result? Faster deals. Stronger partnerships. Higher-quality opportunities. Click here to get started. What’s included in the Disrupt Exhibitor Package 6’ x 30″ exhibit table with linen and two chairs 10 passes for you, your team, and guests — 5 all-access Partner and 5 Expo+ Passes 11” x 14” tabletop sign with your startup’s branding Lead generation via the TechCrunch Disrupt app Silver Tier sponsor branding Entry-level listing in the sponsor directory 50% off additional General Admission passes Access to the TechCrunch Disrupt press list Logo on the thank you slide during breaks Logo and profile in TechCrunch Disrupt mobile app Company name in select TechCrunch sponsor announcements Acknowledgment during the closing ceremony Complimentary partner wifi access Limited first-come, first-served availability The Disrupt Expo Hall has limited exhibit table spaces, and they won’t last long. Act fast to secure your spot and amplify your brand at Disrupt 2026. Reserve your table now and get all the details here. Looking to do more than just exhibit? If you’re looking to sponsor TechCrunch Disrupt 2026, get in touch with our sales team by submitting this form .",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2023/07/expo_hall.png?resize=1200,675"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "The Switch 2‚Äôs GameShare multiplayer turns this horror game into an unexpected comedy",
      "url": "https://www.theverge.com/games/876621/nintendo-switch-2-gameshare-tokyo-scramble",
      "published": "2026-02-11T15:00:00+00:00",
      "summary": "GameShare, a multiplayer feature that's exclusive to the Switch 2, is a neat concept that so far has mostly been used in pretty standard ways. It lets you use one copy of a game and beam it to multiple Switches, making it a great way to experience local co-op titles like Survival Kids or Split [&#8230;]",
      "content_text": "GameShare, a multiplayer feature that‚Äôs exclusive to the Switch 2, is a neat concept that so far has mostly been used in pretty standard ways. It lets you use one copy of a game and beam it to multiple Switches, making it a great way to experience local co-op titles like Survival Kids or Split Fiction . But I‚Äôve finally found an inventive, and quite frankly bizarre, use for GameShare: turning survival horror into something more like a comedy. Tokyo Scramble launches this week as a Switch 2 exclusive, and it‚Äôs a game that channels some of the slow, deliberate pace of genre classics like the original Resident Evil . You play as Anne, a woman who was riding a subway in Tokyo that then crashed deep into the Earth, revealing a hidden underground world full of dinosaur-like monsters. You don‚Äôt have a gun or any weapons to defend yourself. Instead, Anne‚Äôs most important tool is her smartwatch: It lets her interact with everything from escalators to turnstiles in order to distract the monsters and then sneak to safety. In that way it‚Äôs like old-school survival horror mixed with a puzzle game, as you have to figure out how to use the environment to stay safe while dealing with new and increasingly dangerous creatures. An early boss, for example, is a giant bat with super-sensitive hearing, forcing you to stay perfectly still whenever its ears perk up. But turn on a fire alarm using your watch and that keen sense of hearing becomes a weakness. At this point you might be asking yourself how, exactly, that kind of solitary survival experience could work as a multiplayer game. And the answer is pretty unexpected. Using GameShare, you can play Tokyo Scramble with up to three other people. And you all play by controlling different aspects of the same character. One player could manage Anne‚Äôs movement, for instance, while another is in charge of rotating the camera. I played through a number of levels as a two-player experience with the following setup: I was in charge of moving around the levels, while my partner handled everything else (camera, performing actions, and activating the smartwatch apps). This is, as you can probably imagine, a challenging way to play a video game. I kept having to say out loud that I needed the camera pointed in a specific direction so that I could actually see the dinosaurs I was trying to avoid, while my partner would snap at me to get closer to something they needed to interact with. These are all actions I intuitively perform when playing a game like this solo, but I had to really think about what I needed to do ‚Äî and then vocalize it ‚Äî in order to get anywhere in Tokyo Scramble . And to be clear, we didn‚Äôt get very far. Our version of Anne, controlled by two different people, kept being slaughtered by giant praying mantises with glowing red eyes. We were yelling at each other just to perform the most basic tasks, which we almost always failed to do. The thing is, while the added challenge of playing cooperatively sucked out any of the tension or scares in the game, it did turn it into a singular experience that was actually kind of fun. It was certainly like no other multiplayer game I‚Äôd ever played before. It had a lot of the same appeal as the friendslop genre that has taken over Twitch and YouTube : The goofiness is part of what makes it work when you‚Äôre playing with a bud. Mostly, though, Tokyo Scramble has me hoping to see more experiments like this in the Switch 2‚Äôs future. Nintendo consoles often have gimmicky features that go underutilized, like the HD rumble of the original Switch that didn‚Äôt get much use outside of a handful of titles. It‚Äôd be a shame if the same happened to GameShare. And given how many Switch consoles are out there ‚Äî GameShare supports both the Switch 2 and the original Switch for sharing games ‚Äî there‚Äôs a lot of potential. We just need some more out-there ideas like Tokyo Scramble .",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/TOKYOSCRAMBLE03.jpg?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "TikTok launches an opt-in Local Feed in the U.S. leveraging users' precise location",
      "url": "https://techcrunch.com/2026/02/11/tiktok-launches-an-opt-in-local-feed-in-the-u-s-leveraging-users-precise-location/",
      "published": "2026-02-11T14:40:55+00:00",
      "summary": "TikTok's new Local Feed will show you nearby shopping, dining, events, news, and more.",
      "content_text": "TikTok on Wednesday announced the launch of a new “Local Feed” in the U.S. version of the app, which displays content related to travel, news, events, shopping, and dining near the user’s current location. The feed’s arrival comes shortly after a change in TikTok’s terms of service under the new U.S. joint venture , which said that the app would begin to collect precise location information from TikTok users. Today, TikTok confirms the reason it’s now asking for more accurate location information is to help power the Local Feed. However, it notes that users will be able to control whether or not precise location sharing is on, and the default will be set to “off,” making this an opt-in experience. The Local Feed had rolled out in December to select European markets, including the U.K., France, Italy, and Germany. The company explains in its announcement that the feed is meant to help users stay connected to their local community, and its posts are shown to people based on their location, the content’s topic, and when the content was posted. This makes it a more current feed of local information — like suggestions of new restaurants to try, local events, shopping suggestions, and more. The new feature also ties into TikTok’s push to attract small businesses to its app, not only as content producers but as advertisers. This could help insulate it against further regulation and help it to claim, as Meta does, that it should not be reigned in because so many small businesses rely on its services to reach their customers. TikTok notes that 7.5 million businesses currently use the app to reach global customers, and these businesses support more than 28 million workers, per a 2025 Oxford Economics report . The company also highlighted figures from the Small Business & Entrepreneurship Council , which found that 84% of TikTok small business users said the platform helped grow their business, and 75% said TikTok helped them reach customers beyond their local area. In addition, another 74% said TikTok helps them connect with their local community. As TikTok sees it, the Local Feed will help to generate real-world traffic and sales for these brick-and-mortar stores across the U.S. Image Credits: TikTok The first time users access the Local Feed, they’ll be prompted to allow the app to use their location data. On iOS, for example, the pop-up request will allow users to pick whether they want to allow the activity once or while using the app or not at all. “This approach is consistent with how many modern apps use location today and gives people the choice to enable it when they want more relevant, local experiences, while keeping them in control,” the company writes in its announcement. However, TikTok would have likely seen a better reception to this feature had it rolled out the request for precise location data before its ownership transition in the U.S. , or at least at the same time. That way, the app could at least point to a reason as to why it wanted to collect this additional data. Still, even if the location data now has a purpose, it’s worth considering whether or not the value of a local feed is worth the privacy risk. TikTok also notes that the feature will be available only to users 18 and older and will only collect information while the app is in use.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/TikTok-Local-Feed.jpg?resize=1200,655"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "mogenius/renovate-operator: Operator to streamline renovate executions in Kubernetes",
      "url": "https://github.com/mogenius/renovate-operator",
      "published": "2026-02-11T14:36:18+00:00",
      "summary": "<p>Hey folks, we built a Kubernetes operator for Renovate and wanted to share it. Instead of running Renovate as a cron job or relying on hosted services, this operator lets you manage it as a native Kubernetes resource with CRDs. You define your repos and config declaratively, and the operator handles scheduling and execution inside your cluster. No external dependencies, no SaaS lock-in, no webhook setup. The whole thing is open source and will stay that way – there's no paid tier or monetization plan behind it, we just needed this ourselves and figured others might too.<p>Would love to hear feedback or ideas if you give it a try: <a href=\"https://github.com/mogenius/renovate-operator\" rel=\"nofollow\">https://github.com/mogenius/renovate-operator</a></p> <hr /> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46975449\">https://news.ycombinator.com/item?id=46975449</a></p> <p>Points: 16</p> <p># Comments: 10</p>",
      "content_text": "mogenius/renovate-operator You can’t perform that action at this time.",
      "cover_image_url": "https://opengraph.githubassets.com/1c93af722dd648282eb78ccec49336bfe6414e74e35edf4546651e31450745b2/mogenius/renovate-operator"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Integrate raises $17M to move defense project management into the 21st century",
      "url": "https://techcrunch.com/2026/02/11/integrate-raises-17m-to-move-defense-project-management-into-the-21st-century/",
      "published": "2026-02-11T14:21:28+00:00",
      "summary": "The round was led by FPV Ventures co-founder and managing partner Wesley Chan.",
      "content_text": "John Conafay, a veteran of the US Air Force, has spent most of his career leading business development at public and private aerospace companies, including Spire, Astranis, and ABL Space Systems. At each company, Conafay ran into the same software hurdle: collaborating on government contracts was a logistical mess that forced his teams and their federal counterparts to rely on a tedious back-and-forth of PDFs and Excel files. The bottleneck was always the same—most project management tools like Atlassian’s Jira and Asana simply weren’t secure enough to meet the government’s strict security standards. So, in early 2022, Conafay launched Integrate, a collaboration platform designed specifically to allow private companies, the US Department of Defense, and other government agencies to work jointly on classified, multi-entity projects. Last year, the Seattle-based startup won a $25 million , five-year contract from the US Space Force. That validation from a major agency was one of the reasons Wesley Chan, co-founder and managing partner at FPV Ventures, just led Integrate’s $17 million Series A. Chan, known for early bets on Canva, Robinhood, Plaid, and more than 20 other unicorns, told TechCrunch he invested because Integrate solves a big problem for the government and the private companies that serve it. Until recently, the tech sector shunned selling to the US Department of Defense, feeling that it was immoral to create products for the military. But that sentiment changed after Russia invaded Ukraine and China began to be viewed as an adversary. This shift also means other project management companies may now want to sell their products to the government, but Conafay claims it will be technically difficult for them to catch up to Integrate. “If you don’t build something from the ground up with government requirements, you can’t really go back and re-architect software that exists for government purposes,” he told TechCrunch. Techcrunch event Boston, MA | June 23, 2026 According to Conafay, what sets Integrate apart from its civilian-focused competitors is its ability to let different organizations simultaneously and securely collaborate on massive project schedules while keeping sensitive details hidden from other participants. Integrate is designed to handle the coordination of mammoth, multi-year mega-projects, such as the F-35 Lightning II program or the James Webb Space Telescope, where thousands of partners must stay in sync, Conafay explained. While he was careful not to reveal too much about customers besides the Space Force, he did say that some of the work the startup is doing for that branch of US military involves deployments of large rockets. “They have to coordinate tens of satellites on a single launch across dozens of missions,” Conafay said. “The complexity is pretty extreme, and they use us to coordinate those things.” Integrate intends to grow by selling its software to other branches of the U.S. military, including the Navy, the Army, and the intelligence community, as well as to the private companies that serve them.",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2015/12/8465603992_a033bf55f5_o.jpg?resize=1200,853"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "How an ‚Äúicepocalypse‚Äù raises more questions about Meta‚Äôs biggest data center project",
      "url": "https://www.theverge.com/science/876555/meta-data-center-winter-power-outages-storm-ice",
      "published": "2026-02-11T14:06:11+00:00",
      "summary": "Donna Collins lives about 20 miles from where Meta's biggest data center is being built, in a house her family has lived in for five generations. Construction has thrown the small agricultural community in North Louisiana into the spotlight as a high-profile example of how the infrastructure behind generative AI could impact nearby residents. For [&#8230;]",
      "content_text": "Donna Collins lives about 20 miles from where Meta‚Äôs biggest data center is being built, in a house her family has lived in for five generations. Construction has thrown the small agricultural community in North Louisiana into the spotlight as a high-profile example of how the infrastructure behind generative AI could impact nearby residents. For Collins, this place is ‚Äúa little piece of heaven.‚Äù ‚ÄúIt‚Äôs all I‚Äôve ever known as a home. It‚Äôs quiet. It‚Äôs rural. It is beautiful,‚Äù she says. ‚ÄúWe can‚Äôt imagine the changes that are coming.‚Äù The region was particularly hard-hit by the recent cold snap that knocked out power for hundreds of thousands of Americans. Frigid temperatures raise electricity rates ‚Äî as well as questions about how ready power grids will be for future disasters while straining under growing pressure from data centers. Louisiana has built back time and again from storm after storm, but now community members and advocates want assurances that energy-hungry data centers won‚Äôt add to the costs. ‚ÄúWe can‚Äôt imagine the changes that are coming.‚Äù ‚ÄúWe‚Äôre very nervous,‚Äù Collins says. ‚ÄúWhen the wind blows, electricity goes out here in a lot of these remote areas. We live in an area where electricity is kind of uncertain as is.‚Äù The recent ‚Äúicepocalypse,‚Äù as Collins described, arrived with a January 24th winter storm. The storm was only the start ‚Äî forecasters had warned that persistent freezing temperatures would allow ice to build up on trees and energy infrastructure across a large part of the US east of the Rockies. The weight of that ice can bring power lines crashing down or snarl them with falling branches. By February 5th, local utility Entergy Louisiana said that it had finished restoring power to almost 130,000 customers affected. Collins says her home, which is served by an electric cooperative, lost power for four days. She also owns a property she uses as an Airbnb, served by Entergy, which lost power for a few days. Meta might be Entergy‚Äôs most controversial new customer in the area. The utility is building three new gas plants to supply enough electricity for Meta‚Äôs $27 billion AI data center in Richland Parish. The facility is expected to use three times as much electricity annually as the city of New Orleans. Meta‚Äôs data center and two of the gas plants are under construction, with the data center slated to be completed in 2030 . It‚Äôs too soon for them to have had an impact on the power grid during this storm. But consumer advocates are concerned about whether residents could get stuck with higher bills as a result of rising electricity demand and new infrastructure being built for Meta, and they are already pushing for stronger protections. Gas prices spiked as wells froze up while the cold snap increased demand for the fuel used in heating and electricity. In the coming months, those increased costs are likely to show up on residents‚Äôs utility bills . Advocates are worried that the price spike could be even higher as more energy-hungry data centers used for generative AI connect to the grid. ‚ÄúIn a world where those three new gas power plants [serving Meta] are online, that would be further upward pressure on the cost of gas and therefore on the cost of both home heating and the cost of electricity on the larger market,‚Äù Logan Burke, executive director of the Alliance for Affordable Energy (AAE), tells The Verge . Entergy didn‚Äôt respond to requests for comment. In a statement to The Verge, Meta spokesperson Ashley Settle said, ‚ÄúWe worked closely with Entergy to provide additional protection for customers, which projects that the electricity payments for the Richland Parish Data Center will cut both grid upgrade customer costs and storm charges by about 10%, resulting in $650 million in customer savings over 15 years.‚Äù But while Meta has agreed to pay for 15 years of the capital costs of the three new power plants, Burke says that‚Äôs an incomplete picture. There are more costs associated with upgrading transmission lines , for example, and Burke is still concerned about increased demand for gas and electricity raising utility bills for other customers. Earlier this month, Burke‚Äôs organization and the Union of Concerned Scientists also filed a response to a grid stability analysis Entergy conducted, alleging it ‚Äúfails to adequately assess the reliability risks of serving the data center.‚Äù Specifically, they‚Äôre calling on the utility to redo the analysis to more thoroughly assess what would happen to the grid if there were to be a large disturbance like a transmission line or power plant going down, as the state has already seen happen during major storms. ‚ÄúPeople in North Louisiana are already facing a lot of outages, and there‚Äôs this new [project] that is being rushed through the process, not adequately studied in terms of impact on the grid,‚Äù says Paul Arbaje, an energy analyst at the Union of Concerned Scientists. ‚ÄúIt could potentially cause even more disruptions and cause even more harm if we don‚Äôt take this seriously enough.‚Äù Across the US, local opposition to other data center projects ‚Äî often driven by concerns about how much electricity and water they would use ‚Äî have led to delays and cancellations . In North Louisiana, Collins says residents are worried about property costs, taxes, and rents going up, too. Meta‚Äôs moving into a community where the landscape has been defined by farmland for generations. Collins hopes the company follows through on pledges to support local vocational training and hiring as local farmers find it harder to make a living. She has a nephew who‚Äôs a farmer who now works at the Meta construction site. ‚ÄúI‚Äôm not against progress,‚Äù she says. ‚ÄúBut, you know‚Ä¶ those of us that have lived here our whole lives have to be concerned about our water supply, our electricity cost, our property values and taxes. All of those are big concerns because we‚Äôre going to pay the price.‚Äù Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Justine Calma AI Energy Environment Meta Report Science Tech",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/STK043_VRG_Illo_N_Barclay_2_Meta.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Complyance raises $20M to help companies manage risk and compliance",
      "url": "https://techcrunch.com/2026/02/11/complyance-raises-20m-to-help-companies-manage-risk-and-compliance/",
      "published": "2026-02-11T14:00:00+00:00",
      "summary": "Complyance raised a $20 million Series A led by GV for its AI-native compliance platform.",
      "content_text": "Richa Kaul says she’s a bit of a data privacy nut. At parties, for example, she’s the one helping people with their phone privacy configurations. “It got to a point where I realized the best way to actually protect consumer data is to help secure the enterprises that hold the world’s data.” So she launched a company called Complyance to do just that. On Wednesday, the company announced a $20 million Series A led by GV. Complyance is an app that companies integrate into their existing tech stack. It uses AI agents to help them manage governance, risk, and, well, data compliance. “The AI basically automates a number of manual tasks,” Kaul said. “It uses AI to do custom checks on data coming in against their own specific criteria and risk thresholds.” The AI then flags any risks that need review. These risk reviews can take weeks or months when done manually. It’s a standard audit-based process that happens perhaps once a year or once a quarter, where teams will run a check on their organization. Tools like Complyance hope to make this process more efficient by using technology to run continuous checks in seconds, so companies never have to wonder if they are in data compliance. It also has an agent that assesses the risk of any third-party vendors. “We’re trying to redefine what enterprise GRC teams spend their time doing right now,” she said, adding that it’s usually chasing down mundane tasks. GRC refers to general, risk, and compliance. Others in the market include Archer, ServiceNow GRC, and OneTrust. She said her company differs from incumbents because it is AI-native, rather than layering AI features on top. Kaul declined to say how many customers the company has, but noted that it works with a few Fortune 500 companies. Complyance has raised $28 million in funding to date. Though the company came out of stealth in 2023, its first product didn’t go to market until the end of 2024. Kaul called fundraising “kind of a fairy tale,” because GV actually approached her. Techcrunch event Boston, MA | June 23, 2026 “They’ve been looking for an enterprise-grade AI-led product in the space that was winning over enterprise clients, and we were doing that,” Kaul said. Others in this latest Series A round include Speedinvest, Everywhere Ventures, and angel investors from Anthropic and Mastercard. The fresh capital will be used to help with go-to-market expansion, Kaul said. She wants to release 30 more purpose-built agents on top of the 16 the product already has. The goal is to help make the lives and work of GRCs much easier. After all, they didn’t sign up to chase down mundane tasks. “They signed up to help protect their businesses and help protect their business customers,” she said. “By redefining some of those workflows and redefining how work gets done, we’re able to unblock them to help them focus on those strategic priorities.”",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/Richa-Kaul-.jpg?resize=1200,798"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Humanoid robot startup Apptronik has now raised $935M at a $5B+ valuation",
      "url": "https://techcrunch.com/2026/02/11/humanoid-robot-startup-apptronik-has-now-raised-935m-at-a-5b-valuation/",
      "published": "2026-02-11T14:00:00+00:00",
      "summary": "Apptronik has sold another $520 million in a Series A extension to existing and new investors like Google and Mercedes-Benz.",
      "content_text": "University of Texas spinout Apptronik , a builder of humanoid robots for Google DeepMind among others, on Wednesday announced that it re-opened its Series A to raise a total of $935 million for the round. While the company did not disclose the valuation, TechCrunch separately learned that its post-money valuation is now about $5.3 billion. Apptronik previously announced a $350 million Series A a year ago , but demand was so strong, according to the company, that it expanded the round to $415 million. Now it has raised another $520 million from earlier investors Google, Mercedes-Benz, and B Capital, alongside some new investors. While it may sound like the startup is just selling off ever bigger chunks of itself at its Series A price, that’s not exactly what’s happening. The company says its investors have paid progressively more for shares in each subsequent extension — valuing it at roughly triple the initial Series A valuation of around $1.75 billion, according to PitchBook. Why not just call this a Series B then? The company says it is still in early stages of development and was not actively seeking funding — rather it was dealing with inbound interest, says a source close to the company. Fair enough. Another $520 million in a year, especially at a higher valuation, would be hard to turn away, particularly for tech as expensive to build as bipedal robots. Closely watched competitor Figure AI, for instance, had raised nearly $2 billion total since its 2022 founding before announcing a further $1 billion round last fall. Part of the excitement over Apptronik is that it has partnered with Google DeepMind , as well as GXO and Mercedes-Benz, to deliver what the industry calls embodied AI — robots capable of perceiving their environment and taking physical action based on reasoning, rather than just following fixed instructions. The robot is being built for tasks like unloading trailers, picking warehouse inventory, and tending machinery, the company says. Techcrunch event Boston, MA | June 23, 2026 Despite retaining the early-stage funding label, Apptronik is no Johnny-come-lately to this field. As we’ve previously reported , its humanoid work dates all the way back to 2013, three years before the company was formally founded. That’s when members of the Human Centered Robotics Lab from the University of Austin at Texas competed in the NASA-DARPA Robotics Challenge , working on a robot called Valkyrie . Since then, the space agency has maintained a partnership with Apptronik as the company has readied its own humanoid robot, named Apollo .",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/Apptronik-Founders-New-1-e1770763778901.jpg?resize=1200,678"
    },
    {
      "industry": "technology",
      "source": "TechCrunch",
      "title": "Meridian raises $17 million to remake the agentic spreadsheet",
      "url": "https://techcrunch.com/2026/02/11/meridian-ai-raises-17-million-to-remake-the-agentic-spreadsheet/",
      "published": "2026-02-11T14:00:00+00:00",
      "summary": "A new company called Meridian.AI has emerged from stealth with an IDE-based approach to agentic financial modeling.",
      "content_text": "The fight to tame spreadsheets with AI isn’t over yet. A new company called Meridian has emerged from stealth with a more comprehensive IDE-based approach to agentic financial modeling — and plenty of funding to build it. On Wednesday, the company announced $17 million in seed funding at a $100 million post-money valuation. “Our goal is to make financial modeling and spreadsheets way more predictable and auditable,” CEO and co-founder John Ling told TechCrunch. “How can you take a process that traditionally might have taken several hours and condense it down into like 10 minutes?” The round was led by Andressen Horowitz and the General Partnership, with participation from QED Investors, FPV Ventures, and Litquidity Ventures. The company says it is currently working with teams at Decagon and OffDeal, and signed $5 million of contracts in December alone. Excel agents have been a popular target for AI startups , due in part to the high cost of human-led financial analysis. But where previous Excel agents like Shortcut AI built agents into Excel, Meridian operates as a stand-alone workspace, more akin to Cursor. This allows the app to operate like an IDE, integrating data sources and other outside references that might otherwise create friction. Based in New York, the Meridian team includes both alumni of AI firms like Scale AI and Anthropic as well as financial veterans from firms like Goldman Sachs. As Ling describes it, Meridian’s biggest challenge is the strict requirements of financial clients, which often clash with the non-deterministic nature of AI models. “If you go to ten different software engineers at Google, and you want to add some new feature into an app, you’ll probably get like 10 completely different implementations. And that’s totally fine,” Ling says. “But if you go to 10 banking analysts at Goldman Sachs and you ask for 10 valuation models for a company, you would probably get 10 almost identical workbooks.” Techcrunch event Boston, MA | June 23, 2026 As a result, the Meridian team has done significant work to make their outputs more auditable and deterministic, while maintaining the flexibility of LLM-based tools. The result is a mixture of agentic AI and more conventional tooling, minimizing the hallucinations that slow down many enterprise deployments. “Our goal is to really remove the doubt layer right from the LLM process,” Ling says. “You know exactly how the logic flows, and all of these assumptions or whatever that go into the model, you can see exactly where they’re coming from.”",
      "cover_image_url": "https://techcrunch.com/wp-content/uploads/2026/02/260122_MeridianAi_Group_0047.jpg?resize=1200,900"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Halide Mark III Process Zero for iPhone: Enough to convert a skeptic like me",
      "url": "https://www.theverge.com/tech/875919/halide-mark-iii-process-zero-hands-on",
      "published": "2026-02-11T14:00:00+00:00",
      "summary": "Something happens every time I try to use an iPhone camera like a real camera. Here's how it goes: I shoot RAW in addition to the default HEIC output, and since I have the RAW file I might as well edit it to my taste. And if I'm going to do that, I want to [&#8230;]",
      "content_text": "Something happens every time I try to use an iPhone camera like a real camera. Here‚Äôs how it goes: I shoot RAW in addition to the default HEIC output, and since I have the RAW file I might as well edit it to my taste. And if I‚Äôm going to do that, I want to use Lightroom on my MacBook. You know, real software. Then I remember: iPhone photos hate real software. Moving image files between devices is mysterious. If I Airdrop them to my MacBook will the HDR gain map tag along? Why do my photos always come out of Lightroom looking different than my edit? Where did that gain map go? I lack the patience to find out, so I just live with what my phone camera produces on its own and leave the heavy lifting to my ‚Äúreal‚Äù camera. This has its pros and cons. On the plus side, it‚Äôs way easier to deal with iPhone photos if they never leave the native camera app. But it also means leaving processing up to the iPhone, which tends to run amok with sharpening and raising shadows . I lean on the app‚Äôs built-in Photographic Styles (shout out to Rich Contrast, you‚Äôre a real one) to avoid this, but lots of people look to third party options like Halide‚Äôs Process Zero . Halide introduced this mode to its popular iPhone camera app last year. Process Zero promises to strip away the excess processing the native camera pipeline applies to images, resulting in photos with deeper shadows and less aggressive sharpening. Sounds great if you‚Äôre sick of the processed-to-death phone camera look! But I‚Äôll admit to being a bit of a Process Zero skeptic. I lived through the pre-computational-photography era of crappy phone cameras, and I generally prefer the lower noise and usable low light photos you get with current camera tech. With a higher contrast photo style applied, it gets me close enough to the look I like, even if it feels like I‚Äôm taking pictures with a computer and not so much a camera . But Halide just released the second version of Process Zero in beta , adding a couple of features that got me interested: HDR support, and the ability to shoot in Apple‚Äôs RAW format. If those sound antithetical to Process Zero‚Äôs whole deal, well, maybe they are. And if we‚Äôre being technical about it, there was already some processing going on in Process Zero ‚Äî there‚Äôs no other way to turn a bunch of sensor data into a usable image. But here‚Äôs what I appreciate about version two‚Äôs upgrades. First of all, adding HDR support doesn‚Äôt mean it‚Äôs going to turn your photo into a Thomas Kinkade painting . It means that the brightest areas of your photo can be brighter, creating a greater contrast between light and dark areas of the image. It‚Äôs the exact opposite of the flat, HDR-ish look that phone cameras often produce to try and represent a wide range of tones for an SDR screen. Don‚Äôt take my word for it; listen to Marc Levoy , who pioneered computational photography on smartphones. There‚Äôs also the option to shoot HEIC + RAW, meaning that in addition to the Process Zero image, you‚Äôll have a DNG file that has been through some of Apple‚Äôs computational pipeline. Apple‚Äôs ProRAW format combines multiple frames to reduce noise, but retains all of the extra data you‚Äôd expect a RAW file to contain so you can apply your preferred tone mapping. You can turn this additional RAW capture on or off, and it doesn‚Äôt affect the Process Zero output, so you can treat it like a failsafe if you don‚Äôt like the default image. Whether or not you shoot RAW, you‚Äôll have an option to adjust tone mapping within the Halide app through a new feature called Tone Fusion. It essentially boosts shadows, but it‚Äôs in your control and it‚Äôs not as intense as Apple‚Äôs tendencies. Even when I crank it all the way up, it doesn‚Äôt try to shift a blown-out sky blue the way the native iPhone processing does, and I appreciate that. 1/3 Default Process Zero output I think an underrated benefit of Process Zero, or Adobe‚Äôs Project Indigo , is what it does for your mindset as you take photos. Sure, you could achieve the same kind of look by shooting with ProRAW in the native camera app, taking the photo into Lightroom, and adjusting contrast to your liking. But Process Zero provides appealing results straight out of the camera; it feels different knowing you‚Äôre going to get something you like right away, rather than a file you have to fight with first. I also feel like it gives me permission to think of myself as a photographer for a little while, not just a person with a phone. I went on a little photo walk in Seattle‚Äôs Pioneer Square and International District neighborhoods, which I‚Äôve done dozens of times over the past decade. Outside Union Station ‚Äî an old train station-turned-transit-agency-headquarters ‚Äî I noticed a sign I‚Äôd never seen before, noting that the building‚Äôs great hall was open to the public. I‚Äôm not sure I would have bothered if I was just out wandering around, but with a specialized camera app on my phone I felt more like I was out doing photography , so I went in. It‚Äôs stunning, as it turns out, and I don‚Äôt know how I went over a decade living in this city without setting foot inside. And you know what? I do like the photos I got in there with Process Zero. Shooting with a ProRAW file in my back pocket, I knew I‚Äôd have something to work with if I didn‚Äôt like the default. But I haven‚Äôt touched those files, because the JPEGs are great. There was some late afternoon sun illuminating the station‚Äôs massive windows; rather than trying to bring those highlights down and boost every shadow, Process Zero lets the bright spots clip and keeps the emphasis on the interior. The HDR gain map lets the brightest parts of the scene pop, creating contrast between the fully illuminated windows and the slightly-less-bright golden sunlight filtering in against the wall. HDR is good, y‚Äôall. Process Zero v2 is part of a public preview of Halide‚Äôs larger Mark III update, so things might change before it‚Äôs finalized. But I like what I‚Äôm seeing, especially for Process Zero. The computational photography era has offered us a lot more than some over-processed JPEGs ‚Äî the fact that we can take decent photos in basically any light conditions with the tiny sensors on our phones is nothing short of a technological triumph. Updating Process Zero to incorporate some of those benefits, if and when you want them, doesn‚Äôt detract from the minimalist experience; it‚Äôs an enhancement. And it‚Äôs enough to convert a skeptic like me. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Allison Johnson Apple Gadgets Hands-on iPhone Mobile Reviews Tech",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/DSC02494_processed.jpg?quality=90&strip=all&crop=0%2C10.723165084465%2C100%2C78.55366983107&w=1200"
    },
    {
      "industry": "technology",
      "source": "The Verge",
      "title": "Pokopia turns the Pok√©mon world into a relaxing, human-free paradise",
      "url": "https://www.theverge.com/games/876285/pokemon-pokopia-hands-on-preview",
      "published": "2026-02-11T14:00:00+00:00",
      "summary": "Though catching monsters and making them fight have always been core elements of the Pok&#233;mon brand, spinoffs like the Pok&#233;mon Snap and Detective Pikachu series have stood out by approaching the franchise from different angles. In different (and often small) ways, recent mainline Pok&#233;mon titles like Sword / Shield, Scarlet / Violet, and Legends: Z-A [&#8230;]",
      "content_text": "Though catching monsters and making them fight have always been core elements of the Pok√©mon brand, spinoffs like the Pok√©mon Snap and Detective Pikachu series have stood out by approaching the franchise from different angles. In different (and often small) ways, recent mainline Pok√©mon titles like Sword / Shield , Scarlet / Violet , and Legends: Z-A have acknowledged that there are some players who would much rather spend their time hanging out and taking pictures with their monster friends. That leisurely approach to enjoying the Pok√©mon world doesn‚Äôt exactly gel with the main games‚Äô focus on becoming a competitive champion, but it is exactly the sort of mindset you should have when you start playing Pok√©mon Pokopia for the Nintendo Switch 2. Co-developed by The Pok√©mon Company, Game Freak, and Koei Tecmo‚Äôs Omega Force division , Pokopia feels like Nintendo taking another stab at everything that makes Animal Crossing so enjoyable while experimenting with features from other crafting-forward games, like Minecraft . Pokopia uses conventions from the core Pok√©mon series to make its spin on classic life simulation game mechanics like building and nurturing relationships feel distinct. It‚Äôs a fun, cute game that plays just differently enough from Animal Crossing to say that Pokopia isn‚Äôt simply a Pok√©mon -themed New Horizons . But what delighted me most when I recently spent some hands-on time with the game was how ‚Äî when you look past its bright, island-y vibes ‚Äî Pokopia ‚Äôs story seems to be teasing something dark and ominous about the Pok√©mon world. In Pokopia , you play as an unusual Ditto that has somehow ended up on an island after getting separated from its trainer. This Ditto isn‚Äôt great at transforming into other pok√©mon, and it doesn‚Äôt remember what happened to its partner. But after finding its lost trainer‚Äôs pok√©dex, the Ditto uses its powers to assume their form (the game‚Äôs character customization options are surprisingly robust), and it starts to explore the land around it. When I first started playing, I knew that Pokopia was focused on a Ditto in human drag making friends with other pok√©mon, like Professor Tangrowth, and creating unique habitats to attract more monsters. But I was surprised and intrigued when the grass-type professor explained that it hadn‚Äôt seen another living human or pok√©mon out in ‚Äúthe desolate world‚Äù for a very long time. After teasing me with the mystery of what happened to everyone, Pokopia dropped me right into a simple bit of gameplay involving a dehydrated Squirtle that covered the basics of how things work on the island. By meeting certain pok√©mon with special moves like Water Gun, Ditto can copy them and use their powers to affect terrain in the game. When selected, each move ‚Äî which can only be used a certain number of times before you have to eat to recharge your Power Points ‚Äî displays a grid of squares letting you know the areas it will affect when used. 1/3 Image: The Pok√©mon Company, Game Freak, Koei Tecmo Games Hitting patches of dried-up grass with Water Gun turned them vibrant green, and when I‚Äôd created enough connected grass squares, they sparkled to let me know that I had created a patch of Tall Grass . In Pokopia , your Pok√©dex registers pok√©mon and areas like Tall Grass as different kinds of habitats where specific monsters might show up. A timid but friendly Charmander popped out of my first patch of Tall Grass, and its powers were exactly what I needed to start a campfire. The deeper you get into Pokopia , the more complex creating new habitats becomes. Some pok√©mon would only spawn if I created patches of grass shaded by large boulders, while others required me to cultivate fertile ground with wheelbarrows nearby. I had to have already met certain pok√©mon in order to use the moves necessary to create the conditions that would attract new monsters. And it wasn‚Äôt always guaranteed that the exact pok√©mon I wanted would spawn when their habitat requirements were met. The more pok√©mon you befriend on the island, the more Pokopia begins to open up in terms of space that you can explore and things you can build using Animal Crossing- style recipes and workbenches. I could easily imagine myself spending hours just making places for wild pok√©mon to relax, but Pokopia is also clearly a game that‚Äôs aimed at builders. With the right moves and transformations, you can start doing heavy construction to reshape your island‚Äôs geography or travel to other nearby landmasses. Full-on island overhauls might take a while to complete if you‚Äôre working by yourself, but the work can go much faster when you‚Äôre using Pokopia ‚Äôs multiplayer mode. 1/3 Image: The Pok√©mon Company, Game Freak, Koei Tecmo Games During my demo run, my groupmates and I didn‚Äôt spend much time trying to complete the objective we were encouraged to focus on as a team because it was much more fun to run around transforming into Dragonites and flying through the air. But if we had been a little more goal-oriented, we could have built some buildings or snapped a few group photos with our conspicuously retro Pok√©dexes. Aside from the foreshadowed desolation, what struck me most about Pokopia was how relaxing its interpolations of classic Pok√©mon songs were and how expressive the game‚Äôs monster animations are. Though the game isn‚Äôt voice acted, pok√©mon‚Äôs faces charmingly convey the emotions they‚Äôre feeling ‚Äî sometimes they‚Äôre excited to talk to you, sometimes they‚Äôre in a bad mood and need cheering up ‚Äî as you visit them in their new homes. And while I wasn‚Äôt able to get a look at just how many pok√©mon can be befriended in the game, it was clear that a sizable number of them can make appearances on the island. Even though it‚Äôs clearly aimed at kids, Pokopia feels like the kind of game that‚Äôs going to be just as enjoyable for adult Pok√©mon fans when it hits the Nintendo Switch 2 on March 5th. And if the game‚Äôs deeper story is anywhere nearly as dark as it seems, it might be one of the franchise‚Äôs most fascinating side stories yet. Follow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates. Charles Pulliam-Moore Entertainment Gaming Pokemon",
      "cover_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/Pokemon_Pokopia_Screenshot_12.png?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200"
    },
    {
      "industry": "technology",
      "source": "Hacker News (Frontpage)",
      "title": "Free AI Chatbot & Agent powered by GLM-5 & GLM-4.7",
      "url": "https://chat.z.ai/",
      "published": "2026-02-11T13:42:16+00:00",
      "summary": "<p>Article URL: <a href=\"https://chat.z.ai/\">https://chat.z.ai/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46974853\">https://news.ycombinator.com/item?id=46974853</a></p> <p>Points: 154</p> <p># Comments: 134</p>",
      "content_text": "",
      "cover_image_url": null
    }
  ]
}